<abi-corpus path='libefivar.so' architecture='elf-amd-x86_64' soname='libefivar.so.1'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_efi_set_variable' version='libefivar.so.0' is-default-version='no' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_efi_set_variable_variadic' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_append_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_chmod_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_del_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_error_clear' version='LIBEFIVAR_1.30' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='efi_guid_lenovo_setup' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_lenovo_startup_interrupt' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_microsoft' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_pkcs7_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat_2' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_security' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha224' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shell' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shim' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_ux_capsule' size='16' version='LIBEFIVAR_1.32' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_zero' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids' size='18480' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids_end' size='1' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='/home/pjones/devel/github.com/efivar/master/src' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-2' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='33' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-7'/>
    <typedef-decl name='__uint32_t' type-id='type-id-7' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-8'/>
    <typedef-decl name='uint32_t' type-id='type-id-8' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-4'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-9'/>
    <typedef-decl name='__uint16_t' type-id='type-id-9' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-10'/>
    <typedef-decl name='uint16_t' type-id='type-id-10' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-5'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-11'/>
    <typedef-decl name='__uint8_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-12'/>
    <typedef-decl name='uint8_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-13'/>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='48' id='type-id-6'>
      <subrange length='6'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-15' name='a' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='35' column='1'/>
      <parameter type-id='type-id-15' name='b' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='35' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='efi_variable' size-in-bits='320' is-struct='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='34' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrs' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-18' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-19' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-20' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='39' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-22'/>
    <typedef-decl name='__uint64_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-23'/>
    <typedef-decl name='uint64_t' type-id='type-id-23' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-17'/>
    <typedef-decl name='efi_guid_t' type-id='type-id-3' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='39' column='1' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-18'/>
    <type-decl name='char' size-in-bits='8' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-20'/>
    <typedef-decl name='size_t' type-id='type-id-22' filepath='/usr/lib/gcc/x86_64-redhat-linux/7/include/stddef.h' line='216' column='1' id='type-id-21'/>
    <typedef-decl name='efi_variable_t' type-id='type-id-16' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='131' column='1' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-27'/>
    <function-decl name='efi_variable_get_attributes' mangled-name='efi_variable_get_attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='337' column='1'/>
      <parameter type-id='type-id-27' name='attrs' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='337' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_set_attributes' mangled-name='efi_variable_set_attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='328' column='1'/>
      <parameter type-id='type-id-17' name='attrs' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='328' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-28'/>
    <typedef-decl name='__ssize_t' type-id='type-id-28' filepath='/usr/include/bits/types.h' line='181' column='1' id='type-id-29'/>
    <typedef-decl name='ssize_t' type-id='type-id-29' filepath='/usr/include/sys/types.h' line='109' column='1' id='type-id-30'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-32'/>
    <function-decl name='efi_variable_get_data' mangled-name='efi_variable_get_data' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_data@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='313' column='1'/>
      <parameter type-id='type-id-31' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='313' column='1'/>
      <parameter type-id='type-id-32' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='313' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efi_variable_set_data' mangled-name='efi_variable_set_data' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_data@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='298' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='298' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='298' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-33'/>
    <function-decl name='efi_variable_get_guid' mangled-name='efi_variable_get_guid' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_guid@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='284' column='1'/>
      <parameter type-id='type-id-33' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='284' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_set_guid' mangled-name='efi_variable_set_guid' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_guid@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='275' column='1'/>
      <parameter type-id='type-id-18' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='275' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_get_name' mangled-name='efi_variable_get_name' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_name@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='262' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='efi_variable_set_name' mangled-name='efi_variable_set_name' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_name@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='248' column='1'/>
      <parameter type-id='type-id-19' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='248' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-34'/>
    <function-decl name='efi_variable_free' mangled-name='efi_variable_free' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_free@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='225' column='1'/>
      <parameter type-id='type-id-1' name='free_data' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='225' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='efi_variable_export' mangled-name='efi_variable_export' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='153' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='153' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='153' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-35'/>
    <function-decl name='efi_variable_import' mangled-name='efi_variable_import' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_import@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='59' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='59' column='1'/>
      <parameter type-id='type-id-35' name='var_out' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='59' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efi_error_clear' mangled-name='efi_error_clear' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear@@LIBEFIVAR_1.30'>
      <return type-id='type-id-34'/>
    </function-decl>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <function-decl name='efi_error_set' mangled-name='efi_error_set' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-37' name='filename' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='82' column='1'/>
      <parameter type-id='type-id-37' name='function' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='83' column='1'/>
      <parameter type-id='type-id-1' name='line' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='84' column='1'/>
      <parameter type-id='type-id-1' name='error' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='85' column='1'/>
      <parameter type-id='type-id-37' name='fmt' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='86' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='__mode_t' type-id='type-id-7' filepath='/usr/include/bits/types.h' line='138' column='1' id='type-id-38'/>
    <typedef-decl name='mode_t' type-id='type-id-38' filepath='/usr/include/fcntl.h' line='50' column='1' id='type-id-39'/>
    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='219' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='219' column='1'/>
      <parameter type-id='type-id-39' name='mode' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='219' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-40'/>
    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0'>
      <parameter type-id='type-id-33' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='200' column='1'/>
      <parameter type-id='type-id-40' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='200' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='181' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='181' column='1'/>
      <parameter type-id='type-id-32' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='181' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='181' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='181' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-41'/>
    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='161' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='161' column='1'/>
      <parameter type-id='type-id-41' name='attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='162' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='141' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='141' column='1'/>
      <parameter type-id='type-id-31' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='141' column='1'/>
      <parameter type-id='type-id-32' name='data_size' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='142' column='1'/>
      <parameter type-id='type-id-41' name='attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='142' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='122' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='122' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='98' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='98' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='98' column='1'/>
      <parameter type-id='type-id-21' name='data_size' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='99' column='1'/>
      <parameter type-id='type-id-4' name='attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='99' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_realize' mangled-name='efi_variable_realize' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_realize@@libefivar.so.0'>
      <parameter type-id='type-id-26' name='var' filepath='/home/pjones/devel/github.com/efivar/master/src/export.c' line='351' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='61' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='61' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='61' column='1'/>
      <parameter type-id='type-id-21' name='data_size' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='62' column='1'/>
      <parameter type-id='type-id-4' name='attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='62' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='61' column='1'/>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='61' column='1'/>
      <parameter type-id='type-id-20' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='61' column='1'/>
      <parameter type-id='type-id-21' name='data_size' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='62' column='1'/>
      <parameter type-id='type-id-4' name='attributes' filepath='/home/pjones/devel/github.com/efivar/master/src/lib.c' line='62' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_id_guid' mangled-name='efi_guid_to_id_guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_id_guid@@libefivar.so.0'>
      <parameter type-id='type-id-15' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='197' column='1'/>
      <parameter type-id='type-id-40' name='sp' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='197' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_symbol' mangled-name='efi_guid_to_symbol' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_symbol@@libefivar.so.0'>
      <parameter type-id='type-id-18' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='181' column='1'/>
      <parameter type-id='type-id-40' name='symbol' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='181' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
      <parameter type-id='type-id-15' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='69' column='1'/>
      <parameter type-id='type-id-40' name='sp' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='69' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_name' mangled-name='efi_guid_to_name' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_name@@libefivar.so.0'>
      <parameter type-id='type-id-18' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='181' column='1'/>
      <parameter type-id='type-id-40' name='symbol' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='181' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' mangled-name='efi_str_to_guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-37' name='s' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='57' column='1'/>
      <parameter type-id='type-id-18' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='57' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_name_to_guid' mangled-name='efi_name_to_guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_name_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-37' name='name' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='269' column='1'/>
      <parameter type-id='type-id-18' name='guid' filepath='/home/pjones/devel/github.com/efivar/master/src/guid.c' line='269' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-42'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-43'/>
    <function-decl name='efi_error_get' mangled-name='efi_error_get' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_get@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-7' name='n' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='53' column='1'/>
      <parameter type-id='type-id-42' name='filename' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='54' column='1'/>
      <parameter type-id='type-id-42' name='function' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='55' column='1'/>
      <parameter type-id='type-id-43' name='line' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='56' column='1'/>
      <parameter type-id='type-id-42' name='message' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='57' column='1'/>
      <parameter type-id='type-id-43' name='error' filepath='/home/pjones/devel/github.com/efivar/master/src/error.c' line='58' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='451' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='451' column='1'/>
      <parameter type-id='type-id-13' name='type' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='451' column='1'/>
      <parameter type-id='type-id-13' name='subtype' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='451' column='1'/>
      <parameter type-id='type-id-30' name='total_size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='452' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='813' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='813' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='813' column='1'/>
      <parameter type-id='type-id-18' name='uuid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='813' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='787' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='787' column='1'/>
      <parameter type-id='type-id-17' name='sas_address' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='787' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='763' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='763' column='1'/>
      <parameter type-id='type-id-5' name='primary' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='763' column='1'/>
      <parameter type-id='type-id-5' name='slave' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='764' column='1'/>
      <parameter type-id='type-id-5' name='lun' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='764' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-44'/>
    <typedef-decl name='__int16_t' type-id='type-id-44' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-45'/>
    <typedef-decl name='int16_t' type-id='type-id-45' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-46'/>
    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='740' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='740' column='1'/>
      <parameter type-id='type-id-5' name='hba_port' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='740' column='1'/>
      <parameter type-id='type-id-46' name='port_multiplier_port' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='741' column='1'/>
      <parameter type-id='type-id-5' name='lun' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='741' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='713' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='713' column='1'/>
      <parameter type-id='type-id-4' name='namespace_id' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='713' column='1'/>
      <parameter type-id='type-id-20' name='ieee_eui_64' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='714' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='694' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='694' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='694' column='1'/>
      <parameter type-id='type-id-5' name='target' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='694' column='1'/>
      <parameter type-id='type-id-5' name='lun' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='694' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='664' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='664' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='664' column='1'/>
      <parameter type-id='type-id-4' name='local' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='664' column='1'/>
      <parameter type-id='type-id-4' name='remote' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='664' column='1'/>
      <parameter type-id='type-id-4' name='gateway' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='665' column='1'/>
      <parameter type-id='type-id-4' name='netmask' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='665' column='1'/>
      <parameter type-id='type-id-5' name='local_port' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='666' column='1'/>
      <parameter type-id='type-id-5' name='remote_port' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='666' column='1'/>
      <parameter type-id='type-id-5' name='protocol' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='667' column='1'/>
      <parameter type-id='type-id-1' name='is_static' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='667' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-49'/>
    <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='642' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='642' column='1'/>
      <parameter type-id='type-id-13' name='if_type' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='642' column='1'/>
      <parameter type-id='type-id-49' name='mac_addr' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='643' column='1'/>
      <parameter type-id='type-id-30' name='mac_addr_size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-message.c' line='643' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='179' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='179' column='1'/>
      <parameter type-id='type-id-4' name='num' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='179' column='1'/>
      <parameter type-id='type-id-17' name='part_start' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='179' column='1'/>
      <parameter type-id='type-id-17' name='part_size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='180' column='1'/>
      <parameter type-id='type-id-20' name='signature' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='180' column='1'/>
      <parameter type-id='type-id-13' name='format' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='180' column='1'/>
      <parameter type-id='type-id-13' name='signature_type' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='181' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='157' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='157' column='1'/>
      <parameter type-id='type-id-19' name='filepath' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-media.c' line='157' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='106' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='106' column='1'/>
      <parameter type-id='type-id-4' name='hardware_device' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='106' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='86' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='86' column='1'/>
      <parameter type-id='type-id-13' name='device' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='86' column='1'/>
      <parameter type-id='type-id-13' name='function' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-hw.c' line='86' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='239' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='239' column='1'/>
      <parameter type-id='type-id-4' name='hid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='240' column='1'/>
      <parameter type-id='type-id-4' name='uid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='240' column='1'/>
      <parameter type-id='type-id-4' name='cid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='240' column='1'/>
      <parameter type-id='type-id-19' name='hidstr' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='241' column='1'/>
      <parameter type-id='type-id-19' name='uidstr' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='241' column='1'/>
      <parameter type-id='type-id-19' name='cidstr' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='241' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='217' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='217' column='1'/>
      <parameter type-id='type-id-4' name='hid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='217' column='1'/>
      <parameter type-id='type-id-4' name='uid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp-acpi.c' line='217' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-50'/>
    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='434' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='434' column='1'/>
      <parameter type-id='type-id-13' name='type' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='434' column='1'/>
      <parameter type-id='type-id-13' name='subtype' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='434' column='1'/>
      <parameter type-id='type-id-2' name='vendor_guid' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='435' column='1'/>
      <parameter type-id='type-id-50' name='data' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='435' column='1'/>
      <parameter type-id='type-id-21' name='data_size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='435' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='832' column='1' id='type-id-51'>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='838' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pci' type-id='type-id-54' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='839' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pccard' type-id='type-id-55' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mmio' type-id='type-id-56' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hw_vendor' type-id='type-id-57' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='controller' type-id='type-id-58' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='843' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bmc' type-id='type-id-59' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid' type-id='type-id-60' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid_ex' type-id='type-id-61' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_adr' type-id='type-id-62' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='atapi' type-id='type-id-63' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='scsi' type-id='type-id-64' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fc' type-id='type-id-65' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fcex' type-id='type-id-66' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firewire' type-id='type-id-67' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb' type-id='type-id-68' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_class' type-id='type-id-69' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_wwid' type-id='type-id-70' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='lun' type-id='type-id-71' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sata' type-id='type-id-72' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i2o' type-id='type-id-73' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac_addr' type-id='type-id-74' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv4_addr' type-id='type-id-75' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv6_addr' type-id='type-id-76' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vlan' type-id='type-id-77' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='infiniband' type-id='type-id-78' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart' type-id='type-id-79' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='msg_vendor' type-id='type-id-80' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart_flow_control' type-id='type-id-81' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas' type-id='type-id-82' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas_ex' type-id='type-id-83' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iscsi' type-id='type-id-84' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvme' type-id='type-id-85' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uri' type-id='type-id-86' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ufs' type-id='type-id-87' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sd' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bt' type-id='type-id-89' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='wifi' type-id='type-id-90' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='emmc' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='btle' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dns' type-id='type-id-93' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvdimm' type-id='type-id-94' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hd' type-id='type-id-95' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cdrom' type-id='type-id-96' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='media_vendor' type-id='type-id-97' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='file' type-id='type-id-98' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='883' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='protocol' type-id='type-id-99' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='884' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_file' type-id='type-id-100' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='885' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_volume' type-id='type-id-101' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='886' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='relative_offset' type-id='type-id-102' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='887' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ramdisk' type-id='type-id-103' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='888' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bios_boot' type-id='type-id-104' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='889' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='833' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='836' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-105' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-53'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-54' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pci' type-id='type-id-106' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-54'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-55' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pccard' type-id='type-id-107' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-55'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-56' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_mmio' type-id='type-id-108' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-56'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-57' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='750' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-110' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='753' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='0' type-id='type-id-13' size-in-bits='infinite' id='type-id-110'/>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-109' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-57'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-58' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_controller' type-id='type-id-111' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-58'/>
    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-59' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bmc' type-id='type-id-112' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-59'/>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-60' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-113' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-60'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-61' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-115' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='0' type-id='type-id-24' size-in-bits='infinite' id='type-id-115'/>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-114' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-61'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-62' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='165' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-117' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='0' type-id='type-id-4' size-in-bits='infinite' id='type-id-117'/>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-116' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='168' column='1' id='type-id-62'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-63' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_atapi' type-id='type-id-118' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-63'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-64' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='336' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='339' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_scsi' type-id='type-id-119' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-64'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-65' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='349' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fc' type-id='type-id-120' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='350' column='1' id='type-id-65'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-66' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-122' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-122' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='357' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='64' id='type-id-122'>
      <subrange length='8'/>
    </array-type-def>
    <typedef-decl name='efidp_fcex' type-id='type-id-121' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='358' column='1' id='type-id-66'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-67' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='361' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='364' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_1394' type-id='type-id-123' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='365' column='1' id='type-id-67'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-68' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='368' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb' type-id='type-id-124' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='372' column='1' id='type-id-68'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-69' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='375' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='381' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_class' type-id='type-id-125' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='382' column='1' id='type-id-69'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-70' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='402' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-127' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='0' type-id='type-id-5' size-in-bits='infinite' id='type-id-127'/>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-126' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='408' column='1' id='type-id-70'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-71' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='411' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='413' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_lun' type-id='type-id-128' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='414' column='1' id='type-id-71'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sata' type-id='type-id-129' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='422' column='1' id='type-id-72'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-73' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='428' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='430' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_i2o' type-id='type-id-130' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='431' column='1' id='type-id-73'/>
    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-74' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='434' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-132' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='437' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='256' id='type-id-132'>
      <subrange length='32'/>
    </array-type-def>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-131' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='438' column='1' id='type-id-74'/>
    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-75' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='446' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-134' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-134' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-135' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-134' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-134' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='455' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='32' id='type-id-134'>
      <subrange length='4'/>
    </array-type-def>
    <typedef-decl name='efidp_boolean' type-id='type-id-13' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-135'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-133' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='456' column='1' id='type-id-75'/>
    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-76' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='468' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-137' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-137' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='477' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-137'>
      <subrange length='16'/>
    </array-type-def>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-136' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='478' column='1' id='type-id-76'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-77' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='485' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='487' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_vlan' type-id='type-id-138' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='488' column='1' id='type-id-77'/>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-78' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='491' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-140' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='500' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-17' size-in-bits='128' id='type-id-140'>
      <subrange length='2'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='495' column='1' id='type-id-141'>
      <data-member access='private'>
        <var-decl name='ioc_guid' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='service_id' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='497' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efidp_infiniband' type-id='type-id-139' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='501' column='1' id='type-id-78'/>
    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-79' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='510' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='516' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart' type-id='type-id-142' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='517' column='1' id='type-id-79'/>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-109' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-80'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-81' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='557' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-143' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='558' column='1' id='type-id-81'/>
    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-82' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='565' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='573' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas' type-id='type-id-144' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='574' column='1' id='type-id-82'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-83' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='598' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-122' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-122' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='604' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-145' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='605' column='1' id='type-id-83'/>
    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-84' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='611' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-122' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-110' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='617' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_iscsi' type-id='type-id-146' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='618' column='1' id='type-id-84'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-85' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-122' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvme' type-id='type-id-147' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='650' column='1' id='type-id-85'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-86' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='655' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-110' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='657' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uri' type-id='type-id-148' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='658' column='1' id='type-id-86'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-87' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='664' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ufs' type-id='type-id-149' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-87'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='670' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sd' type-id='type-id-150' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-88'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-89' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='676' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bt' type-id='type-id-151' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-89'/>
    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-90' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-132' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='682' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_wifi' type-id='type-id-152' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='683' column='1' id='type-id-90'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='686' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='688' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_emmc' type-id='type-id-153' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='689' column='1' id='type-id-91'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='692' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='695' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_btle' type-id='type-id-154' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='696' column='1' id='type-id-92'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-93' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-156' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='705' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='49' column='1' id='type-id-157'>
      <data-member access='private'>
        <var-decl name='addr' type-id='type-id-158' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='50' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v4' type-id='type-id-159' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='51' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v6' type-id='type-id-160' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='52' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-158'>
      <subrange length='4'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-159' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='41' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-134' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-161' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='43' column='1' id='type-id-159'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-160' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='45' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-137' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-162' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='47' column='1' id='type-id-160'/>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-157' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='53' column='1' id='type-id-163'/>
    <array-type-def dimensions='0' type-id='type-id-163' size-in-bits='infinite' id='type-id-156'/>
    <typedef-decl name='efidp_dns' type-id='type-id-155' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='706' column='1' id='type-id-93'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-94' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='709' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-2' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='711' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-164' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='712' column='1' id='type-id-94'/>
    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-95' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='717' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-137' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-13' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='724' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hd' type-id='type-id-165' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='728' column='1' id='type-id-95'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-96' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='742' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_cdrom' type-id='type-id-166' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='747' column='1' id='type-id-96'/>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-109' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='754' column='1' id='type-id-97'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='761' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-127' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='763' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_file' type-id='type-id-167' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='764' column='1' id='type-id-98'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-99' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='768' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-2' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='770' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_protocol' type-id='type-id-168' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='771' column='1' id='type-id-99'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-100' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='780' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-110' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-169' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='777' column='1' id='type-id-100'/>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-169' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='783' column='1' id='type-id-101'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-102' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='786' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='790' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-170' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='791' column='1' id='type-id-102'/>
    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-103' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='794' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-17' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-2' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='799' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-171' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='800' column='1' id='type-id-103'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-104' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='813' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-110' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='817' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-172' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='818' column='1' id='type-id-104'/>
    <typedef-decl name='efidp_data' type-id='type-id-51' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='890' column='1' id='type-id-173'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <typedef-decl name='efidp' type-id='type-id-174' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='891' column='1' id='type-id-175'/>
    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-19' name='path' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='423' column='1'/>
      <parameter type-id='type-id-175' name='out' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='424' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='425' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0'>
      <parameter type-id='type-id-19' name='path' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='423' column='1'/>
      <parameter type-id='type-id-175' name='out' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='424' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='425' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <typedef-decl name='const_efidp' type-id='type-id-177' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='892' column='1' id='type-id-178'/>
    <function-decl name='efidp_format_device_path' mangled-name='efidp_format_device_path' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-19' name='buf' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='307' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='307' column='1'/>
      <parameter type-id='type-id-178' name='dp' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='307' column='1'/>
      <parameter type-id='type-id-30' name='limit' filepath='/home/pjones/devel/github.com/efivar/master/src/dp.c' line='307' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-179'/>
