<abi-corpus version='2.0' path='libefiboot.so' architecture='elf-amd-x86_64' soname='libefiboot.so.1'>
  <elf-needed>
    <dependency name='libefivar.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='efi_generate_file_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_file_device_path_from_esp' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_ipv4_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_get_libefiboot_version' version='LIBEFIBOOT_1.31' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_ucs2' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_utf8' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_from_file' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_clear' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_set' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attrs' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_create' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_desc' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_is_valid' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data_size' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_pathlen' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='creator.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-2'>
      <subrange length='3' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='type-id-5'/>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' id='type-id-7'>
      <subrange length='1' type-id='type-id-3' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' id='type-id-9'>
      <subrange length='20' type-id='type-id-3' id='type-id-10'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-12'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-13'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-14'/>
    <type-decl name='int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-16'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-17'/>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='48' id='type-id-19'>
      <subrange length='6' type-id='type-id-3' id='type-id-20'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='64' id='type-id-21'>
      <subrange length='8' type-id='type-id-3' id='type-id-22'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-23'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-24'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-25'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-26'/>
    <type-decl name='variadic parameter type' id='type-id-27'/>
    <type-decl name='void' id='type-id-28'/>
    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='13' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-types.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-types.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-types.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_guid_t' type-id='type-id-30' filepath='src/include/efivar/efivar-types.h' line='19' column='1' id='type-id-29'/>
    <class-decl name='acpi_root_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='18' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acpi_hid' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acpi_uid' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acpi_cid' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acpi_hid_str' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='acpi_uid_str' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='acpi_cid_str' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pci_root_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='27' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pci_domain' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pci_bus' type-id='type-id-18' visibility='default' filepath='src/linux.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pci_dev_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/linux.h' line='32' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pci_domain' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pci_bus' type-id='type-id-18' visibility='default' filepath='src/linux.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='pci_device' type-id='type-id-18' visibility='default' filepath='src/linux.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pci_function' type-id='type-id-18' visibility='default' filepath='src/linux.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driverlink' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='scsi_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/linux.h' line='40' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sas_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='47' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sata_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/linux.h' line='56' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ata_devno' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ata_port' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ata_pmp' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ata_print_id' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ata_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='69' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scsi_host' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_info' size-in-bits='160' is-struct='yes' visibility='default' filepath='src/linux.h' line='78' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrl_id' type-id='type-id-43' visibility='default' filepath='src/linux.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ns_id' type-id='type-id-43' visibility='default' filepath='src/linux.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='has_eui' type-id='type-id-15' visibility='default' filepath='src/linux.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='eui' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvdimm_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='85' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='namespace_label' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvdimm_label' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='emmc_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='90' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot_id' type-id='type-id-43' visibility='default' filepath='src/linux.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='interface_type' filepath='src/linux.h' line='94' column='1' id='type-id-46'>
      <underlying-type type-id='type-id-23'/>
      <enumerator name='unknown' value='0'/>
      <enumerator name='isa' value='1'/>
      <enumerator name='acpi_root' value='2'/>
      <enumerator name='pci_root' value='3'/>
      <enumerator name='soc_root' value='4'/>
      <enumerator name='virtual_root' value='5'/>
      <enumerator name='pci' value='6'/>
      <enumerator name='network' value='7'/>
      <enumerator name='ata' value='8'/>
      <enumerator name='atapi' value='9'/>
      <enumerator name='scsi' value='10'/>
      <enumerator name='sata' value='11'/>
      <enumerator name='sas' value='12'/>
      <enumerator name='usb' value='13'/>
      <enumerator name='i1394' value='14'/>
      <enumerator name='fibre' value='15'/>
      <enumerator name='i2o' value='16'/>
      <enumerator name='md' value='17'/>
      <enumerator name='virtblk' value='18'/>
      <enumerator name='nvme' value='19'/>
      <enumerator name='nd_pmem' value='20'/>
      <enumerator name='emmc' value='21'/>
    </enum-decl>
    <class-decl name='device' size-in-bits='2752' is-struct='yes' visibility='default' filepath='src/linux.h' line='107' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interface_type' type-id='type-id-46' visibility='default' filepath='src/linux.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probes' type-id='type-id-48' visibility='default' filepath='src/linux.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_probes' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2368' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='117' column='1' id='type-id-49'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ifname' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='146' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='2368' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='118' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stat' type-id='type-id-51' visibility='default' filepath='src/linux.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='controllernum' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='disknum' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='part' type-id='type-id-15' visibility='default' filepath='src/linux.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='major' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='minor' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='edd10_devicenum' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='disk_name' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='part_name' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='acpi_root' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='pci_root' type-id='type-id-36' visibility='default' filepath='src/linux.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='n_pci_devs' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pci_dev' type-id='type-id-52' visibility='default' filepath='src/linux.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='' type-id='type-id-53' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='136' column='1' id='type-id-53'>
      <data-member access='public'>
        <var-decl name='scsi_info' type-id='type-id-38' visibility='default' filepath='src/linux.h' line='137' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas_info' type-id='type-id-39' visibility='default' filepath='src/linux.h' line='138' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sata_info' type-id='type-id-40' visibility='default' filepath='src/linux.h' line='139' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ata_info' type-id='type-id-41' visibility='default' filepath='src/linux.h' line='140' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_info' type-id='type-id-42' visibility='default' filepath='src/linux.h' line='141' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='emmc_info' type-id='type-id-45' visibility='default' filepath='src/linux.h' line='142' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvdimm_info' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='143' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='dev_probe' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='329' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iftypes' type-id='type-id-55' visibility='default' filepath='src/linux.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parse' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='create' type-id='type-id-57' visibility='default' filepath='src/linux.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='make_part_name' type-id='type-id-58' visibility='default' filepath='src/linux.h' line='337' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-59' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-43'/>
    <typedef-decl name='uint8_t' type-id='type-id-60' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-18'/>
    <typedef-decl name='uint16_t' type-id='type-id-61' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-32'/>
    <typedef-decl name='uint32_t' type-id='type-id-62' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-31'/>
    <typedef-decl name='uint64_t' type-id='type-id-63' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-34'/>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-72' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint8_t' type-id='type-id-24' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-60'/>
    <typedef-decl name='__uint16_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-61'/>
    <typedef-decl name='__int32_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-59'/>
    <typedef-decl name='__uint32_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-62'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-63'/>
    <typedef-decl name='__dev_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-64'/>
    <typedef-decl name='__uid_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-68'/>
    <typedef-decl name='__gid_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-69'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-65'/>
    <typedef-decl name='__mode_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-67'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-66'/>
    <typedef-decl name='__off_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-70'/>
    <typedef-decl name='__off64_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-74'/>
    <typedef-decl name='__time_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-75'/>
    <typedef-decl name='__blksize_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-71'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='180' column='1' id='type-id-72'/>
    <typedef-decl name='__ssize_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-76'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-1'/>
    <typedef-decl name='FILE' type-id='type-id-77' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-78'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-28' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-79'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-74' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-83' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-84' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-86' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DIR' type-id='type-id-14' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-87'/>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/mntent.h' line='51' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-35' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-35' visibility='default' filepath='/usr/include/mntent.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-35' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-35' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-15' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-15' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ssize_t' type-id='type-id-76' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-89'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/11/include/stddef.h' line='209' column='1' id='type-id-86'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-91'/>
    <qualified-type-def type-id='type-id-91' restrict='yes' id='type-id-92'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-58'/>
    <qualified-type-def type-id='type-id-35' restrict='yes' id='type-id-94'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-95'/>
    <qualified-type-def type-id='type-id-95' restrict='yes' id='type-id-96'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-97'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-99'/>
    <qualified-type-def type-id='type-id-98' restrict='yes' id='type-id-100'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-105'/>
    <qualified-type-def type-id='type-id-105' restrict='yes' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-85'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-12'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-13'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-14'/>
    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' filepath='src/creator.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0'>
      <parameter type-id='type-id-109' name='buf' filepath='src/creator.c' line='318' column='1'/>
      <parameter type-id='type-id-89' name='size' filepath='src/creator.c' line='318' column='1'/>
      <parameter type-id='type-id-98' name='devpath' filepath='src/creator.c' line='319' column='1'/>
      <parameter type-id='type-id-15' name='partition' filepath='src/creator.c' line='319' column='1'/>
      <parameter type-id='type-id-98' name='relpath' filepath='src/creator.c' line='320' column='1'/>
      <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='321' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' filepath='src/creator.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0'>
      <parameter type-id='type-id-109' name='buf' filepath='src/creator.c' line='370' column='1'/>
      <parameter type-id='type-id-89' name='size' filepath='src/creator.c' line='370' column='1'/>
      <parameter type-id='type-id-99' name='filepath' filepath='src/creator.c' line='371' column='1'/>
      <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='372' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
      <parameter type-id='type-id-109' name='buf' filepath='src/creator.c' line='461' column='1'/>
      <parameter type-id='type-id-89' name='size' filepath='src/creator.c' line='461' column='1'/>
      <parameter type-id='type-id-99' name='ifname' filepath='src/creator.c' line='462' column='1'/>
      <parameter type-id='type-id-99' name='local_addr' filepath='src/creator.c' line='463' column='1'/>
      <parameter type-id='type-id-99' name='remote_addr' filepath='src/creator.c' line='464' column='1'/>
      <parameter type-id='type-id-99' name='gateway_addr' filepath='src/creator.c' line='465' column='1'/>
      <parameter type-id='type-id-99' name='netmask' filepath='src/creator.c' line='466' column='1'/>
      <parameter type-id='type-id-32' name='local_port' filepath='src/creator.c' line='467' column='1'/>
      <parameter type-id='type-id-32' name='remote_port' filepath='src/creator.c' line='468' column='1'/>
      <parameter type-id='type-id-32' name='protocol' filepath='src/creator.c' line='469' column='1'/>
      <parameter type-id='type-id-18' name='addr_origin' filepath='src/creator.c' line='470' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='is_partitioned' filepath='src/disk.h' line='10' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='make_hd_dn' filepath='src/disk.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-98'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='device_get' filepath='src/linux.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='device_free' filepath='src/linux.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='set_part' filepath='src/linux.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='make_blockdev_path' filepath='src/linux.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='find_parent_devpath' filepath='src/linux.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='make_mac_path' filepath='src/linux.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='open' filepath='/usr/include/fcntl.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-15'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getmntent' filepath='/usr/include/mntent.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-100'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-100'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='782' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='554' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='391' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='stat' filepath='/usr/include/sys/stat.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='837' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-94'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-93'>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-35'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-107'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-89'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-89'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='disk.c' comp-dir-path='src' language='LANG_C11'>
    <typedef-decl name='__suseconds_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='162' column='1' id='type-id-110'/>
    <class-decl name='timeval' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='8' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-110' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-113' restrict='yes' id='type-id-114'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-115'/>
    <qualified-type-def type-id='type-id-85' restrict='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-117'/>
    <function-decl name='gpt_disk_get_partition_info' filepath='src/gpt.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='722' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='get_sector_size' filepath='src/linux.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='585' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fstat' filepath='/usr/include/sys/stat.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gettimeofday' filepath='/usr/include/sys/time.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='lseek' filepath='/usr/include/unistd.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-89'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gpt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='520' id='type-id-118'>
      <subrange length='65' type-id='type-id-3' id='type-id-119'/>
    </array-type-def>
    <class-decl name='utsname' size-in-bits='3120' is-struct='yes' visibility='default' filepath='/usr/include/sys/utsname.h' line='48' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-118' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-118' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-118' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-118' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-118' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='domainname' type-id='type-id-118' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <function-decl name='crc32' filepath='src/crc32.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-acpi-root.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='parse_acpi_hid_uid' filepath='src/linux.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-98'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <var-decl name='acpi_root_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='349' column='1'/>
    <function-decl name='strndup' filepath='/usr/include/string.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-86'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-122'/>
    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='parse_scsi_link' filepath='src/linux.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <var-decl name='ata_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='359' column='1'/>
    <function-decl name='strstr' filepath='/usr/include/string.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-35'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-emmc.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <var-decl name='emmc_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='360' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C11'>
    <var-decl name='i2o_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='357' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <var-decl name='nvme_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='355' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci-root.c' comp-dir-path='src' language='LANG_C11'>
    <var-decl name='pci_root_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='348' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <var-decl name='pci_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='352' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <var-decl name='pmem_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='347' column='1'/>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-35'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <var-decl name='sas_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='353' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-123'>
      <subrange length='256' type-id='type-id-3' id='type-id-124'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-125'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/dirent.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/dirent.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-123' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='type-id-127' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-128'/>
    <typedef-decl name='__int16_t' type-id='type-id-125' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-127'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-129'/>
    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='is_pata' filepath='src/linux.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='sata_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='354' column='1'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='readdir' filepath='/usr/include/dirent.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-129'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <var-decl name='scsi_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='358' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-soc-root.c' comp-dir-path='src' language='LANG_C11'>
    <var-decl name='soc_root_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='350' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C11'>
    <var-decl name='virtblk_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='356' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtual-root.c' comp-dir-path='src' language='LANG_C11'>
    <var-decl name='virtual_root_parser' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='351' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux.c' comp-dir-path='src' language='LANG_C11'>
    <typedef-decl name='const_efidp' type-id='type-id-130' filepath='src/include/efivar/efivar-dp.h' line='885' column='1' id='type-id-131'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-132'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-130'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <qualified-type-def type-id='type-id-136' const='yes' id='type-id-137'/>
    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='find_path_segment' filepath='src/path-helpers.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-140'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='loadopt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-141'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-142'/>
    </array-type-def>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-85' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-144' size-in-bits='infinite' id='type-id-145'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-142'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='infinite' id='type-id-146'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-142'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-147'>
      <subrange length='4' type-id='type-id-3' id='type-id-148'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='infinite' id='type-id-149'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-142'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='128' id='type-id-150'>
      <subrange length='2' type-id='type-id-3' id='type-id-151'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='128' id='type-id-152'>
      <subrange length='16' type-id='type-id-3' id='type-id-153'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='256' id='type-id-154'>
      <subrange length='32' type-id='type-id-3' id='type-id-155'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='32' id='type-id-156'>
      <subrange length='4' type-id='type-id-3' id='type-id-148'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='infinite' id='type-id-157'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-142'/>
    </array-type-def>
    <typedef-decl name='efi_load_option' type-id='type-id-158' filepath='src/include/efivar/efiboot-loadopt.h' line='10' column='1' id='type-id-159'/>
    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='23' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-160'/>
    <typedef-decl name='efidp_boolean' type-id='type-id-18' filepath='src/include/efivar/efivar-dp.h' line='30' column='1' id='type-id-162'/>
    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='42' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pci' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-163'/>
    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pccard' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='54' column='1' id='type-id-165'/>
    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_mmio' type-id='type-id-168' filepath='src/include/efivar/efivar-dp.h' line='62' column='1' id='type-id-167'/>
    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-170' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-169'/>
    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_controller' type-id='type-id-172' filepath='src/include/efivar/efivar-dp.h' line='89' column='1' id='type-id-171'/>
    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bmc' type-id='type-id-174' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-173'/>
    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-176' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-175'/>
    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='122' column='1' id='type-id-177'/>
    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='156' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-180' filepath='src/include/efivar/efivar-dp.h' line='159' column='1' id='type-id-179'/>
    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-181' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='317' column='1' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_atapi' type-id='type-id-182' filepath='src/include/efivar/efivar-dp.h' line='322' column='1' id='type-id-181'/>
    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_scsi' type-id='type-id-184' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-183'/>
    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fc' type-id='type-id-186' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-185'/>
    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fcex' type-id='type-id-188' filepath='src/include/efivar/efivar-dp.h' line='349' column='1' id='type-id-187'/>
    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_1394' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-189'/>
    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-191'/>
    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_class' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-193'/>
    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='393' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='399' column='1' id='type-id-195'/>
    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_lun' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='405' column='1' id='type-id-197'/>
    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sata' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='413' column='1' id='type-id-199'/>
    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_i2o' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='422' column='1' id='type-id-201'/>
    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='428' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-203'/>
    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-206' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-205'/>
    <class-decl name='efidp_ipv6_addr' size-in-bits='360' is-struct='yes' naming-typedef-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='459' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-207'/>
    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_vlan' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-209'/>
    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-213'>
      <data-member access='public'>
        <var-decl name='ioc_guid' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='service_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efidp_infiniband' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-211'/>
    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='508' column='1' id='type-id-214'/>
    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='532' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='535' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-217' filepath='src/include/efivar/efivar-dp.h' line='536' column='1' id='type-id-216'/>
    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-219' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-218'/>
    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas' type-id='type-id-221' filepath='src/include/efivar/efivar-dp.h' line='565' column='1' id='type-id-220'/>
    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='589' column='1' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-223' filepath='src/include/efivar/efivar-dp.h' line='596' column='1' id='type-id-222'/>
    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_iscsi' type-id='type-id-225' filepath='src/include/efivar/efivar-dp.h' line='609' column='1' id='type-id-224'/>
    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='637' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='640' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvme' type-id='type-id-227' filepath='src/include/efivar/efivar-dp.h' line='641' column='1' id='type-id-226'/>
    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uri' type-id='type-id-229' filepath='src/include/efivar/efivar-dp.h' line='649' column='1' id='type-id-228'/>
    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='655' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ufs' type-id='type-id-231' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-230'/>
    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sd' type-id='type-id-233' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-232'/>
    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bt' type-id='type-id-235' filepath='src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-234'/>
    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_wifi' type-id='type-id-237' filepath='src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-236'/>
    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_emmc' type-id='type-id-239' filepath='src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-238'/>
    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_btle' type-id='type-id-241' filepath='src/include/efivar/efivar-dp.h' line='689' column='1' id='type-id-240'/>
    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='695' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='698' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_dns' type-id='type-id-243' filepath='src/include/efivar/efivar-dp.h' line='699' column='1' id='type-id-242'/>
    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-245' filepath='src/include/efivar/efivar-dp.h' line='705' column='1' id='type-id-244'/>
    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='714' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hd' type-id='type-id-247' filepath='src/include/efivar/efivar-dp.h' line='721' column='1' id='type-id-246'/>
    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='735' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='739' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_cdrom' type-id='type-id-249' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' id='type-id-248'/>
    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-251' filepath='src/include/efivar/efivar-dp.h' line='747' column='1' id='type-id-250'/>
    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='754' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='756' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_file' type-id='type-id-253' filepath='src/include/efivar/efivar-dp.h' line='757' column='1' id='type-id-252'/>
    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='763' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_protocol' type-id='type-id-255' filepath='src/include/efivar/efivar-dp.h' line='764' column='1' id='type-id-254'/>
    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-257' filepath='src/include/efivar/efivar-dp.h' line='770' column='1' id='type-id-256'/>
    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-259' filepath='src/include/efivar/efivar-dp.h' line='776' column='1' id='type-id-258'/>
    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='783' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-261' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-260'/>
    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-263' filepath='src/include/efivar/efivar-dp.h' line='793' column='1' id='type-id-262'/>
    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='806' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='810' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-265' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' id='type-id-264'/>
    <union-decl name='efidp_data' size-in-bits='384' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='825' column='1' id='type-id-266'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pci' type-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pccard' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mmio' type-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hw_vendor' type-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='835' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='controller' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bmc' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid' type-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid_ex' type-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_adr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='atapi' type-id='type-id-181' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scsi' type-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fc' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fcex' type-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firewire' type-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_class' type-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_wwid' type-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='lun' type-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sata' type-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i2o' type-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mac_addr' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv4_addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv6_addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='vlan' type-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='infiniband' type-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart' type-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='msg_vendor' type-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart_flow_control' type-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas' type-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas_ex' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='iscsi' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme' type-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uri' type-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ufs' type-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sd' type-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bt' type-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='wifi' type-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='emmc' type-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='btle' type-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dns' type-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvdimm' type-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hd' type-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdrom' type-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='media_vendor' type-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='protocol' type-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_file' type-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_volume' type-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='relative_offset' type-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ramdisk' type-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bios_boot' type-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='826' column='1' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-18' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='829' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_data' type-id='type-id-266' filepath='src/include/efivar/efivar-dp.h' line='883' column='1' id='type-id-133'/>
    <typedef-decl name='efidp' type-id='type-id-268' filepath='src/include/efivar/efivar-dp.h' line='884' column='1' id='type-id-269'/>
    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-types.h' line='31' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-types.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-271' filepath='src/include/efivar/efivar-types.h' line='33' column='1' id='type-id-270'/>
    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-types.h' line='35' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-273' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-272'/>
    <union-decl name='efi_ip_addr_t' size-in-bits='128' naming-typedef-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-types.h' line='39' column='1' id='type-id-274'>
      <data-member access='public'>
        <var-decl name='addr' type-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v4' type-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-types.h' line='41' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v6' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-types.h' line='42' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-274' filepath='src/include/efivar/efivar-types.h' line='43' column='1' id='type-id-144'/>
    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='17' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attributes' type-id='type-id-31' visibility='default' filepath='src/loadopt.c' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='file_path_list_length' type-id='type-id-32' visibility='default' filepath='src/loadopt.c' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='description' type-id='type-id-146' visibility='default' filepath='src/loadopt.c' line='20' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-140'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-275'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-277'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-282'/>
    <function-decl name='efi_get_verbose' filepath='src/include/efivar/efivar.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_loadopt_create' mangled-name='efi_loadopt_create' filepath='src/loadopt.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_create@@libefiboot.so.0'>
      <parameter type-id='type-id-109' name='buf' filepath='src/loadopt.c' line='26' column='1'/>
      <parameter type-id='type-id-89' name='size' filepath='src/loadopt.c' line='26' column='1'/>
      <parameter type-id='type-id-31' name='attributes' filepath='src/loadopt.c' line='26' column='1'/>
      <parameter type-id='type-id-269' name='dp' filepath='src/loadopt.c' line='27' column='1'/>
      <parameter type-id='type-id-89' name='dp_size' filepath='src/loadopt.c' line='27' column='1'/>
      <parameter type-id='type-id-138' name='description' filepath='src/loadopt.c' line='27' column='1'/>
      <parameter type-id='type-id-109' name='optional_data' filepath='src/loadopt.c' line='28' column='1'/>
      <parameter type-id='type-id-86' name='optional_data_size' filepath='src/loadopt.c' line='28' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_loadopt_optional_data_size' mangled-name='efi_loadopt_optional_data_size' filepath='src/loadopt.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data_size@@libefiboot.so.0'>
      <parameter type-id='type-id-280' name='opt' filepath='src/loadopt.c' line='102' column='1'/>
      <parameter type-id='type-id-86' name='size' filepath='src/loadopt.c' line='102' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='efi_loadopt_is_valid' mangled-name='efi_loadopt_is_valid' filepath='src/loadopt.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_is_valid@@libefiboot.so.0'>
      <parameter type-id='type-id-280' name='opt' filepath='src/loadopt.c' line='152' column='1'/>
      <parameter type-id='type-id-86' name='size' filepath='src/loadopt.c' line='152' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_loadopt_attrs' mangled-name='efi_loadopt_attrs' filepath='src/loadopt.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attrs@@libefiboot.so.0'>
      <parameter type-id='type-id-280' name='opt' filepath='src/loadopt.c' line='161' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
