<abi-corpus version='2.1' path='libefiboot.so' architecture='elf-amd-x86_64' soname='libefiboot.so.1'>
  <elf-needed>
    <dependency name='libefivar.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='efi_generate_file_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_file_device_path_from_esp' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_ipv4_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_get_libefiboot_version' version='LIBEFIBOOT_1.31' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_ucs2' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_utf8' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_from_file' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_clear' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_set' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attrs' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_create' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_desc' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_is_valid' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data_size' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_pathlen' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='creator.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-2'>
      <subrange length='3' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='type-id-5'/>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' id='type-id-7'>
      <subrange length='1' type-id='type-id-3' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='160' id='type-id-9'>
      <subrange length='20' type-id='type-id-3' id='type-id-10'/>
    </array-type-def>
    <enum-decl name='interface_type' filepath='src/linux.h' line='94' column='1' id='type-id-11'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='unknown' value='0'/>
      <enumerator name='isa' value='1'/>
      <enumerator name='acpi_root' value='2'/>
      <enumerator name='pci_root' value='3'/>
      <enumerator name='soc_root' value='4'/>
      <enumerator name='virtual_root' value='5'/>
      <enumerator name='pci' value='6'/>
      <enumerator name='network' value='7'/>
      <enumerator name='ata' value='8'/>
      <enumerator name='atapi' value='9'/>
      <enumerator name='scsi' value='10'/>
      <enumerator name='sata' value='11'/>
      <enumerator name='sas' value='12'/>
      <enumerator name='usb' value='13'/>
      <enumerator name='i1394' value='14'/>
      <enumerator name='fibre' value='15'/>
      <enumerator name='i2o' value='16'/>
      <enumerator name='md' value='17'/>
      <enumerator name='virtblk' value='18'/>
      <enumerator name='nvme' value='19'/>
      <enumerator name='nd_pmem' value='20'/>
      <enumerator name='emmc' value='21'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-13'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-14'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-15'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-26' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='acpi_root_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='18' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acpi_hid' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acpi_uid' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acpi_cid' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acpi_hid_str' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='acpi_uid_str' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='acpi_cid_str' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ata_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='69' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scsi_host' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_probe' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='329' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iftypes' type-id='type-id-35' visibility='default' filepath='src/linux.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parse' type-id='type-id-36' visibility='default' filepath='src/linux.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='create' type-id='type-id-37' visibility='default' filepath='src/linux.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='make_part_name' type-id='type-id-38' visibility='default' filepath='src/linux.h' line='337' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device' size-in-bits='2752' is-struct='yes' visibility='default' filepath='src/linux.h' line='107' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interface_type' type-id='type-id-11' visibility='default' filepath='src/linux.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probes' type-id='type-id-40' visibility='default' filepath='src/linux.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_probes' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-41' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='emmc_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='90' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot_id' type-id='type-id-47' visibility='default' filepath='src/linux.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/mntent.h' line='51' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-17' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-17' visibility='default' filepath='/usr/include/mntent.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-17' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-17' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-13' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-13' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvdimm_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='85' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='namespace_label' type-id='type-id-42' visibility='default' filepath='src/linux.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvdimm_label' type-id='type-id-42' visibility='default' filepath='src/linux.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_info' size-in-bits='160' is-struct='yes' visibility='default' filepath='src/linux.h' line='78' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrl_id' type-id='type-id-47' visibility='default' filepath='src/linux.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ns_id' type-id='type-id-47' visibility='default' filepath='src/linux.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='has_eui' type-id='type-id-13' visibility='default' filepath='src/linux.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='eui' type-id='type-id-51' visibility='default' filepath='src/linux.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pci_dev_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/linux.h' line='32' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pci_domain' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pci_bus' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='pci_device' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pci_function' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driverlink' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pci_root_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='27' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pci_domain' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pci_bus' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sas_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='47' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sata_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/linux.h' line='56' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ata_devno' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ata_port' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ata_pmp' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ata_print_id' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='scsi_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/linux.h' line='40' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-60' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-63' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='2368' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='118' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stat' type-id='type-id-58' visibility='default' filepath='src/linux.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='controllernum' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='disknum' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='part' type-id='type-id-13' visibility='default' filepath='src/linux.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='major' type-id='type-id-32' visibility='default' filepath='src/linux.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='minor' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='edd10_devicenum' type-id='type-id-31' visibility='default' filepath='src/linux.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='disk_name' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='part_name' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='acpi_root' type-id='type-id-30' visibility='default' filepath='src/linux.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='pci_root' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='n_pci_devs' type-id='type-id-29' visibility='default' filepath='src/linux.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pci_dev' type-id='type-id-70' visibility='default' filepath='src/linux.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DIR' type-id='type-id-72' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-73'/>
    <typedef-decl name='FILE' type-id='type-id-16' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-74'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-75' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-76'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='180' column='1' id='type-id-66'/>
    <typedef-decl name='__blksize_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-65'/>
    <typedef-decl name='__dev_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-59'/>
    <typedef-decl name='__gid_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-64'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-60'/>
    <typedef-decl name='__int32_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-77'/>
    <typedef-decl name='__mode_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-62'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-61'/>
    <typedef-decl name='__off64_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-23'/>
    <typedef-decl name='__off_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-20'/>
    <typedef-decl name='__ssize_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-78'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-1'/>
    <typedef-decl name='__time_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-68'/>
    <typedef-decl name='__uid_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-63'/>
    <typedef-decl name='__uint16_t' type-id='type-id-21' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-79'/>
    <typedef-decl name='__uint32_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-80'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-81'/>
    <typedef-decl name='__uint8_t' type-id='type-id-82' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-83'/>
    <typedef-decl name='efi_guid_t' type-id='type-id-43' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-42'/>
    <typedef-decl name='int32_t' type-id='type-id-77' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-47'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/13/include/stddef.h' line='214' column='1' id='type-id-27'/>
    <typedef-decl name='ssize_t' type-id='type-id-78' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-84'/>
    <typedef-decl name='uint16_t' type-id='type-id-79' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-44'/>
    <typedef-decl name='uint32_t' type-id='type-id-80' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-31'/>
    <typedef-decl name='uint64_t' type-id='type-id-81' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-32'/>
    <typedef-decl name='uint8_t' type-id='type-id-83' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-53'/>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='48' id='type-id-45'>
      <subrange length='6' type-id='type-id-3' id='type-id-85'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='64' id='type-id-51'>
      <subrange length='8' type-id='type-id-3' id='type-id-86'/>
    </array-type-def>
    <union-decl name='__anonymous_union__1' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='136' column='1' id='type-id-71'>
      <data-member access='public'>
        <var-decl name='scsi_info' type-id='type-id-57' visibility='default' filepath='src/linux.h' line='137' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas_info' type-id='type-id-55' visibility='default' filepath='src/linux.h' line='138' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sata_info' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='139' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ata_info' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='140' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_info' type-id='type-id-50' visibility='default' filepath='src/linux.h' line='141' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='emmc_info' type-id='type-id-46' visibility='default' filepath='src/linux.h' line='142' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvdimm_info' type-id='type-id-49' visibility='default' filepath='src/linux.h' line='143' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2368' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='117' column='1' id='type-id-41'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ifname' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='146' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-12'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-82'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-29'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-21'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-88'/>
    <qualified-type-def type-id='type-id-88' restrict='yes' id='type-id-89'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-17' restrict='yes' id='type-id-95'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-96'/>
    <qualified-type-def type-id='type-id-96' restrict='yes' id='type-id-97'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-98'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-100'/>
    <qualified-type-def type-id='type-id-99' restrict='yes' id='type-id-101'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-106'/>
    <qualified-type-def type-id='type-id-106' restrict='yes' id='type-id-107'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-26'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-90'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-91'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-92'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <type-decl name='variadic parameter type' id='type-id-111'/>
    <type-decl name='void' id='type-id-75'/>
    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' filepath='src/creator.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0'>
      <parameter type-id='type-id-110' name='buf' filepath='src/creator.c' line='318' column='1'/>
      <parameter type-id='type-id-84' name='size' filepath='src/creator.c' line='318' column='1'/>
      <parameter type-id='type-id-99' name='devpath' filepath='src/creator.c' line='319' column='1'/>
      <parameter type-id='type-id-13' name='partition' filepath='src/creator.c' line='319' column='1'/>
      <parameter type-id='type-id-99' name='relpath' filepath='src/creator.c' line='320' column='1'/>
      <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='321' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' filepath='src/creator.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0'>
      <parameter type-id='type-id-110' name='buf' filepath='src/creator.c' line='370' column='1'/>
      <parameter type-id='type-id-84' name='size' filepath='src/creator.c' line='370' column='1'/>
      <parameter type-id='type-id-100' name='filepath' filepath='src/creator.c' line='371' column='1'/>
      <parameter type-id='type-id-31' name='options' filepath='src/creator.c' line='372' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
      <parameter type-id='type-id-110' name='buf' filepath='src/creator.c' line='461' column='1'/>
      <parameter type-id='type-id-84' name='size' filepath='src/creator.c' line='461' column='1'/>
      <parameter type-id='type-id-100' name='ifname' filepath='src/creator.c' line='462' column='1'/>
      <parameter type-id='type-id-100' name='local_addr' filepath='src/creator.c' line='463' column='1'/>
      <parameter type-id='type-id-100' name='remote_addr' filepath='src/creator.c' line='464' column='1'/>
      <parameter type-id='type-id-100' name='gateway_addr' filepath='src/creator.c' line='465' column='1'/>
      <parameter type-id='type-id-100' name='netmask' filepath='src/creator.c' line='466' column='1'/>
      <parameter type-id='type-id-44' name='local_port' filepath='src/creator.c' line='467' column='1'/>
      <parameter type-id='type-id-44' name='remote_port' filepath='src/creator.c' line='468' column='1'/>
      <parameter type-id='type-id-44' name='protocol' filepath='src/creator.c' line='469' column='1'/>
      <parameter type-id='type-id-53' name='addr_origin' filepath='src/creator.c' line='470' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='is_partitioned' filepath='src/disk.h' line='10' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='make_hd_dn' filepath='src/disk.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-99'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='device_get' filepath='src/linux.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='device_free' filepath='src/linux.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='set_part' filepath='src/linux.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='make_blockdev_path' filepath='src/linux.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='find_parent_devpath' filepath='src/linux.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='make_mac_path' filepath='src/linux.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='setmntent' filepath='/usr/include/mntent.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='getmntent' filepath='/usr/include/mntent.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-101'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-101'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-84'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-84'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='disk.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='timeval' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='8' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-113' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__suseconds_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='162' column='1' id='type-id-113'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-115'/>
    <qualified-type-def type-id='type-id-115' restrict='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-118'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-119'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <function-decl name='gpt_disk_get_partition_info' filepath='src/gpt.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='get_sector_size' filepath='src/linux.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gettimeofday' filepath='/usr/include/sys/time.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gpt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='520' id='type-id-121'>
      <subrange length='65' type-id='type-id-3' id='type-id-122'/>
    </array-type-def>
    <class-decl name='utsname' size-in-bits='3120' is-struct='yes' visibility='default' filepath='/usr/include/sys/utsname.h' line='48' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='domainname' type-id='type-id-121' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <function-decl name='crc32' filepath='src/crc32.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-acpi-root.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='parse_acpi_hid_uid' filepath='src/linux.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-99'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <var-decl name='acpi_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='349' column='1'/>
    <function-decl name='strndup' filepath='/usr/include/string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-acpi.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-128'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='parse_scsi_link' filepath='src/linux.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <var-decl name='ata_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='359' column='1'/>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strstr' filepath='/usr/include/string.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-emmc.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-130'/>
    <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <var-decl name='emmc_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='360' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
    <var-decl name='i2o_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='357' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-md.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-133'/>
    <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-75'/>
    </function-decl>
    <var-decl name='nvme_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='355' column='1'/>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci-root.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
    <var-decl name='pci_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='348' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
    <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <var-decl name='pci_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='352' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-136'/>
    <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <var-decl name='pmem_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='347' column='1'/>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-137'/>
    <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='571' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <var-decl name='sas_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='353' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-138'>
      <subrange length='256' type-id='type-id-3' id='type-id-139'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-140'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-142' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-138' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='149' column='1' id='type-id-142'/>
    <typedef-decl name='__int16_t' type-id='type-id-140' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-143'/>
    <typedef-decl name='int16_t' type-id='type-id-143' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-144'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-145'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-146'/>
    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='is_pata' filepath='src/linux.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='sata_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='354' column='1'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-147'/>
    <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <var-decl name='scsi_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='358' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-soc-root.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-148'/>
    <var-decl name='soc_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='350' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-149'/>
    <var-decl name='virtblk_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='356' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtual-root.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-150'/>
    <var-decl name='virtual_root_parser' type-id='type-id-34' visibility='default' filepath='src/linux.h' line='351' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux.c' comp-dir-path='src' language='LANG_C11'>
    <typedef-decl name='const_efidp' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' id='type-id-152'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-155'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-151'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-156'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-158'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-159'/>
    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='find_path_segment' filepath='src/path-helpers.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='loadopt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-162'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-163'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-164' size-in-bits='infinite' id='type-id-165'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-163'/>
    </array-type-def>
    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-types.h' line='35' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-types.h' line='39' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='17' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attributes' type-id='type-id-31' visibility='default' filepath='src/loadopt.c' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='file_path_list_length' type-id='type-id-44' visibility='default' filepath='src/loadopt.c' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='description' type-id='type-id-173' visibility='default' filepath='src/loadopt.c' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-180' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-184' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-213' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv6_addr' size-in-bits='480' is-struct='yes' naming-typedef-id='type-id-227' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-229' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-231' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-233' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-235' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='645' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-266' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-268' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='553' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-274' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-276' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-278' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-280' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-282' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-235' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-285' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-164'/>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-167' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-166'/>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-170' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-169'/>
    <typedef-decl name='efi_load_option' type-id='type-id-172' filepath='src/include/efivar/efiboot-loadopt.h' line='14' column='1' id='type-id-286'/>
    <typedef-decl name='efidp' type-id='type-id-287' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' id='type-id-288'/>
    <typedef-decl name='efidp_1394' type-id='type-id-175' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-174'/>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-177'/>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-181' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-180'/>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-183' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-182'/>
    <typedef-decl name='efidp_atapi' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-184'/>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-187' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-186'/>
    <typedef-decl name='efidp_bmc' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-189'/>
    <typedef-decl name='efidp_boolean' type-id='type-id-53' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' id='type-id-226'/>
    <typedef-decl name='efidp_bt' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-191'/>
    <typedef-decl name='efidp_btle' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-193'/>
    <typedef-decl name='efidp_cdrom' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-195'/>
    <typedef-decl name='efidp_controller' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-197'/>
    <typedef-decl name='efidp_data' type-id='type-id-289' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-154'/>
    <typedef-decl name='efidp_dns' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-199'/>
    <typedef-decl name='efidp_emmc' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-201'/>
    <typedef-decl name='efidp_fc' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-203'/>
    <typedef-decl name='efidp_fcex' type-id='type-id-206' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-205'/>
    <typedef-decl name='efidp_file' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-207'/>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-209'/>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-211'/>
    <typedef-decl name='efidp_hd' type-id='type-id-214' filepath='src/include/efivar/efivar-dp.h' line='726' column='1' id='type-id-213'/>
