<abi-corpus version='2.4' path='libefiboot.so' soname='libefiboot.so.1'>
  <elf-needed>
    <dependency name='libefivar.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='efi_generate_file_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_file_device_path_from_esp' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_ipv4_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_get_libefiboot_version' version='LIBEFIBOOT_1.31' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_ucs2' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_utf8' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='malloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='open64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='opendir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='posix_memalign' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='readdir64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='readlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sched_yield' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='setmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcspn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strstr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vasprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='creator.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='03085adc' size-in-bits='192' hash='9904ddbe9e0e1da6' id='083f8d58'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' hash='e1c8b625c73024c4' id='8e100159'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' hash='dedab36ee0ea6582' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='ede1f91d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='8910171f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='8e100159' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mntent' is-struct='yes' visibility='default' size-in-bits='320' hash='d7b62e92027a844d' id='56fe4a37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' hash='4f24305487cf2e09' id='aafc373f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='e43e523d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='80f0b9df' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='e1c52942' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='cc5fcceb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='d94ec6d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='d3f10a7f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='dbc43803' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='083f8d58' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' hash='7451f9a3207df4f1' id='a9c79a1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='65eda9c0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='03085adc' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <typedef-decl name='__blkcnt_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='dbc43803'/>
    <typedef-decl name='__blksize_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='d3f10a7f'/>
    <typedef-decl name='__dev_t' type-id='f0981eeb' size-in-bits='64' hash='8fdc5eea2983a729' id='35ed8932'/>
    <typedef-decl name='__gid_t' type-id='f0981eed' size-in-bits='32' hash='e66b43f97c38e87a' id='d94ec6d9'/>
    <typedef-decl name='__ino_t' type-id='f0981eeb' size-in-bits='64' hash='8fdc5eea2983a729' id='e43e523d'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__mode_t' type-id='f0981eed' size-in-bits='32' hash='e66b43f97c38e87a' id='e1c52942'/>
    <typedef-decl name='__nlink_t' type-id='f0981eeb' size-in-bits='64' hash='8fdc5eea2983a729' id='80f0b9df'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='41060289'/>
    <typedef-decl name='__syscall_slong_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='03085adc'/>
    <typedef-decl name='__time_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='65eda9c0'/>
    <typedef-decl name='__uid_t' type-id='f0981eed' size-in-bits='32' hash='e66b43f97c38e87a' id='cc5fcceb'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' hash='6ebac62b3366db68' id='b96825af'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='dca988a5' size-in-bits='64' hash='e8c018048121152c' id='ede1f91d'/>
    <pointer-type-def type-id='d5027220' size-in-bits='64' hash='39fc40d7ba4ca689' id='b7f2d5e6'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='26a90f95' const='yes' hash='351aa155d9983c83' id='57de658a'/>
    <qualified-type-def type-id='26a90f95' restrict='yes' hash='566dfacc48804f50' id='266fe297'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' hash='a93039fe023ed77b' id='9b23c9ad'/>
    <qualified-type-def type-id='9b23c9ad' restrict='yes' hash='b04f089b5ae14a6d' id='8c85230f'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='80f4b756' const='yes' hash='ec42cf78a9d93a8c' id='b99c00c9'/>
    <qualified-type-def type-id='80f4b756' restrict='yes' hash='b7d5472019e79b5f' id='9d26089a'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='7292109c'/>
    <pointer-type-def type-id='56fe4a37' size-in-bits='64' hash='0674698d60236763' id='b6b61d2f'/>
    <pointer-type-def type-id='aafc373f' size-in-bits='64' hash='925ad1338878bb49' id='4330df87'/>
    <qualified-type-def type-id='4330df87' restrict='yes' hash='625d51349de39d13' id='73665405'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' hash='24d8cca8965ce13e' id='ae3e8ca6'/>
    <pointer-type-def type-id='54a5d683' size-in-bits='64' id='f09217ba'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='66e487eb' size-in-bits='64' id='fa0b179b'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f2'/>
    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0' hash='c3ec68b77fe0cdaf'>
      <parameter type-id='ae3e8ca6' name='buf'/>
      <parameter type-id='79a0948f' name='size'/>
      <parameter type-id='80f4b756' name='devpath'/>
      <parameter type-id='95e97e5e' name='partition'/>
      <parameter type-id='80f4b756' name='relpath'/>
      <parameter type-id='8f92235e' name='options'/>
      <parameter is-variadic='yes'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0' hash='29c8c87e28d7328f'>
      <parameter type-id='ae3e8ca6' name='buf'/>
      <parameter type-id='79a0948f' name='size'/>
      <parameter type-id='b99c00c9' name='filepath'/>
      <parameter type-id='8f92235e' name='options'/>
      <parameter is-variadic='yes'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0' hash='39a5bbe456365610'>
      <parameter type-id='ae3e8ca6' name='buf'/>
      <parameter type-id='79a0948f' name='size'/>
      <parameter type-id='b99c00c9' name='ifname'/>
      <parameter type-id='b99c00c9' name='local_addr'/>
      <parameter type-id='b99c00c9' name='remote_addr'/>
      <parameter type-id='b99c00c9' name='gateway_addr'/>
      <parameter type-id='b99c00c9' name='netmask'/>
      <parameter type-id='149c6638' name='local_port'/>
      <parameter type-id='149c6638' name='remote_port'/>
      <parameter type-id='149c6638' name='protocol'/>
      <parameter type-id='b96825af' name='addr_origin'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31' hash='2bb88322482ae81c'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10' hash='07eca923f855f911'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='8f92235e'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4' hash='03e6b2de327a64a6'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efidp_make_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file' hash='3ce455c27a41063c'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='26a90f95'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efidp_make_generic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic' hash='b506cd9ed266061a'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='79a0948f'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efi_error_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set' hash='70b5b1b837bb6203'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='efi_error_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='efi_set_loglevel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38' hash='388da3fa973fde78'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='efi_get_logfile' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile' hash='2c833d407d937488'>
      <return type-id='822cd80b'/>
    </function-decl>
    <class-decl name='device' is-struct='yes' visibility='default' is-declaration-only='yes' id='66e487eb'/>
    <typedef-decl name='DIR' type-id='20cd73f2' id='54a5d683'/>
    <function-decl name='closedir' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir' hash='388da3fa973fde78'>
      <parameter type-id='f09217ba'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='7292109c'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64' hash='1d81aff51c388187'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='setmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setmntent' hash='ce3a19dab827954e'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntent' hash='91d4bad7dccf9ae4'>
      <parameter type-id='822cd80b'/>
      <return type-id='b6b61d2f'/>
    </function-decl>
    <function-decl name='endmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endmntent' hash='5ac3795bb1331787'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fflush' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush' hash='5ac3795bb1331787'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf' hash='31c19dfde3fac410'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vfprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf' hash='c4bcbce131b4d300'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='asprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asprintf' hash='156e512eaea45d1d'>
      <parameter type-id='8c85230f'/>
      <parameter type-id='9d26089a'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='feof' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof' hash='5ac3795bb1331787'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free' hash='7f32ffea222edbe7'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='strcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='d2c49d83b30fb50c'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strncmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strdup' hash='bac6a89264ba699c'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='stat' mangled-name='stat64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64' hash='5ffe6a576201da98'>
      <parameter type-id='9d26089a'/>
      <parameter type-id='73665405'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='readlink' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlink' hash='f237a668886d5b45'>
      <parameter type-id='9d26089a'/>
      <parameter type-id='266fe297'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
  </abi-instr>
  <abi-instr address-size='64' path='disk.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='efi_guid_t' is-struct='yes' naming-typedef-id='1a7f9ac1' visibility='default' size-in-bits='128' hash='499ca0d1cb6501b7' id='c76c79a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='0f562bd0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timeval' is-struct='yes' visibility='default' size-in-bits='128' hash='bc6c194f1d75b24d' id='2a693ac3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='65eda9c0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='5b102a54' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__suseconds_t' type-id='95e97e5f' size-in-bits='64' hash='b119fe0931d2ee10' id='5b102a54'/>
    <typedef-decl name='efi_guid_t' type-id='c76c79a0' size-in-bits='128' id='1a7f9ac1'/>
    <typedef-decl name='ssize_t' type-id='41060289' size-in-bits='64' hash='b119fe0931d2ee10' id='79a0948f'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='48' hash='b6435304905fc8f6' id='0f562bd0'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='52fa524b'/>
    </array-type-def>
    <pointer-type-def type-id='1a7f9ac1' size-in-bits='64' hash='c6942bb633dc77f9' id='e4b4d1d6'/>
    <pointer-type-def type-id='2a693ac3' size-in-bits='64' hash='5f318e120e3d3e21' id='896f1b83'/>
    <qualified-type-def type-id='896f1b83' restrict='yes' hash='105de60df608a8be' id='4bcf44c1'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' hash='473a9667a2856e32' id='63e171df'/>
    <pointer-type-def type-id='54a5d684' size-in-bits='64' id='f09217bb'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f3'/>
    <qualified-type-def type-id='eaa32e2f' restrict='yes' id='1b7446cd'/>
    <function-decl name='efidp_make_hd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd' hash='6522f79156f34f09'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='b96825af'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73f3' id='54a5d684'/>
    <function-decl name='posix_memalign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_memalign' hash='f74641e922c0ae49'>
      <parameter type-id='63e171df'/>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ioctl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl' hash='b03aa5f98a3a1499'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='f0981eeb'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fstat' mangled-name='fstat64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64' hash='5227d00433989f9c'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='4330df87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='gettimeofday' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gettimeofday' hash='71e4ee281a0f808c'>
      <parameter type-id='4bcf44c1'/>
      <parameter type-id='1b7446cd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lseek64' hash='e90b592389225111'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='724e4de6'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='724e4de6'/>
    </function-decl>
    <function-decl name='read' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='read' hash='e1f135b405ab837f'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='write' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write' hash='e1f135b405ab837f'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gpt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='520' hash='5b11e0ff30e6fbfa' id='5ddd38d2'>
      <subrange length='65' lower-bound='0' upper-bound='64' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='ba3b86918ae00425' id='b50e2e4a'/>
    </array-type-def>
    <class-decl name='utsname' is-struct='yes' visibility='default' size-in-bits='3120' hash='e8c5f4e1269cd961' id='414a2ac6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='5ddd38d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='5ddd38d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='5ddd38d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='5ddd38d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='5ddd38d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='domainname' type-id='5ddd38d2' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='414a2ac6' size-in-bits='64' hash='907e6270359c7eb6' id='a6724cec'/>
    <pointer-type-def type-id='54a5d685' size-in-bits='64' id='f09217bc'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f4'/>
    <typedef-decl name='DIR' type-id='20cd73f4' id='54a5d685'/>
    <function-decl name='sscanf' mangled-name='__isoc23_sscanf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_sscanf' hash='5f03b5b551b5a51f'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc' hash='e0055d99adb0e173'>
      <parameter type-id='f0981eeb'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strerror' hash='64137bddd2d8bd37'>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='uname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname' hash='5024d1665fd35374'>
      <parameter type-id='a6724cec'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-acpi-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d686' size-in-bits='64' id='f09217bd'/>
    <pointer-type-def type-id='66e487eb' size-in-bits='64' id='fa0b179c'/>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputc' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f5'/>
    <function-decl name='efidp_make_acpi_hid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid' hash='f5a2a9c0c61e24a4'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex' hash='4281f7728a24ab46'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73f5' id='54a5d686'/>
    <function-decl name='strndup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strndup' hash='64b4b60cdba4ca37'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strchr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='1b0d39e45ce45198'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strnlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen' hash='e62a7a46b2904b02'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='b59d7dce'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-acpi.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d687' size-in-bits='64' id='f09217be'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f6'/>
    <typedef-decl name='DIR' type-id='20cd73f6' id='54a5d687'/>
    <function-decl name='sched_yield' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vasprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf' hash='cf2e9adf5c1c1adb'>
      <parameter type-id='8c85230f'/>
      <parameter type-id='9d26089a'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc' hash='91495cdf6321a116'>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc' hash='e0055d99adb0e173'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' hash='a285db8f38e4ea02' id='90421557'/>
    <pointer-type-def type-id='54a5d688' size-in-bits='64' id='f09217bf'/>
    <pointer-type-def type-id='66e487eb' size-in-bits='64' id='fa0b179d'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f7'/>
    <function-decl name='efidp_make_atapi' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi' hash='8d0fa82e7b25b51b'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='149c6638'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73f7' id='54a5d688'/>
    <function-decl name='strrchr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strrchr' hash='1b0d39e45ce45198'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strstr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strstr' hash='21babdbcb7a34ebe'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-emmc.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d689' size-in-bits='64' id='f09217c0'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f8'/>
    <function-decl name='efidp_make_emmc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc' hash='07eca923f855f911'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='8f92235e'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73f8' id='54a5d689'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d68a' size-in-bits='64' id='f09217c1'/>
    <pointer-type-def type-id='66e487eb' size-in-bits='64' id='fa0b179e'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f9'/>
    <typedef-decl name='DIR' type-id='20cd73f9' id='54a5d68a'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-md.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d68b' size-in-bits='64' id='f09217c2'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73fa'/>
    <typedef-decl name='DIR' type-id='20cd73fa' id='54a5d68b'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d68c' size-in-bits='64' id='f09217c3'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73fb'/>
    <function-decl name='efidp_make_nvme' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme' hash='d9a2c0e27704fe63'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='ae3e8ca6'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efi_error_pop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_pop@@LIBEFIVAR_1.38' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73fb' id='54a5d68c'/>
    <function-decl name='access' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access' hash='1d81aff51c388187'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d68d' size-in-bits='64' id='f09217c4'/>
    <pointer-type-def type-id='66e487eb' size-in-bits='64' id='fa0b179f'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73fc'/>
    <typedef-decl name='DIR' type-id='20cd73fc' id='54a5d68d'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d68e' size-in-bits='64' id='f09217c5'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73fd'/>
    <function-decl name='efidp_make_pci' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci' hash='b73f76c73cec0ebf'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='b96825af'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73fd' id='54a5d68e'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d68f' size-in-bits='64' id='f09217c6'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73fe'/>
    <function-decl name='efidp_make_nvdimm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm' hash='a569643fc7cb3129'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='e4b4d1d6'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid' hash='b0097e728d3a5ab0'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='e4b4d1d6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73fe' id='54a5d68f'/>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv' hash='bac6a89264ba699c'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d690' size-in-bits='64' id='f09217c7'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73ff'/>
    <function-decl name='efidp_make_sas' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas' hash='b5a3c136924ec33c'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd73ff' id='54a5d690'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='d1617432'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='95e97e60'/>
    <class-decl name='dirent' is-struct='yes' visibility='default' size-in-bits='2240' hash='f8f1acd4a88a2190' id='611586a1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='71288a47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='002ac4a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino64_t' type-id='f0981eeb' size-in-bits='64' hash='8fdc5eea2983a729' id='71288a47'/>
    <typedef-decl name='__int16_t' type-id='95e97e60' size-in-bits='16' hash='6c2352eccdcd3eea' id='03896e23'/>
    <typedef-decl name='int16_t' type-id='03896e23' size-in-bits='16' hash='6c2352eccdcd3eea' id='23bd8cb5'/>
    <pointer-type-def type-id='611586a1' size-in-bits='64' hash='1ce54f87b39780f9' id='2e243169'/>
    <pointer-type-def type-id='54a5d691' size-in-bits='64' id='f09217c8'/>
    <pointer-type-def type-id='66e487eb' size-in-bits='64' id='fa0b17a0'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd7400'/>
    <function-decl name='efidp_make_sata' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata' hash='6218a14b01b1ebaf'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='23bd8cb5'/>
      <parameter type-id='149c6638'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd7400' id='54a5d691'/>
    <function-decl name='opendir' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756'/>
      <return type-id='f09217c8'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64' hash='8210c868a3f56bcd'>
      <parameter type-id='f09217c8'/>
      <return type-id='2e243169'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d692' size-in-bits='64' id='f09217c9'/>
    <pointer-type-def type-id='66e487eb' size-in-bits='64' id='fa0b17a1'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd7401'/>
    <function-decl name='efidp_make_scsi' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi' hash='7050a255ca14152e'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='149c6638'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='20cd7401' id='54a5d692'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-soc-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d693' size-in-bits='64' id='f09217ca'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd7402'/>
    <typedef-decl name='DIR' type-id='20cd7402' id='54a5d693'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d694' size-in-bits='64' id='f09217cb'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd7403'/>
    <typedef-decl name='DIR' type-id='20cd7403' id='54a5d694'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtual-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='54a5d695' size-in-bits='64' id='f09217cc'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd7404'/>
    <typedef-decl name='DIR' type-id='20cd7404' id='54a5d695'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux.c' comp-dir-path='src' language='LANG_C11'>
    <typedef-decl name='const_efidp' type-id='01b0e8b3' size-in-bits='64' hash='8183b12658ab99b1' id='d34c43a2'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' hash='cea1d4b0943594a3' id='7d3cd834'/>
    <qualified-type-def type-id='dea47adb' const='yes' hash='6a235f390cae8715' id='e000704b'/>
    <pointer-type-def type-id='e000704b' size-in-bits='64' hash='8183b12658ab99b1' id='01b0e8b3'/>
    <qualified-type-def type-id='b96825af' const='yes' hash='5a6582fbecdbfc78' id='2b61797f'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='64' hash='d2a42ec7d4838233' id='9f7200cf'/>
    <qualified-type-def type-id='9f7200cf' const='yes' hash='5211ca787f6a625f' id='2a45725c'/>
    <pointer-type-def type-id='54a5d696' size-in-bits='64' id='f09217cd'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd7405'/>
    <function-decl name='efidp_make_mac_addr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr' hash='64bda095715de9e4'>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='79a0948f'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='2a45725c'/>
      <parameter type-id='79a0948f'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='efidp_format_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path' hash='432553564090deee'>
      <parameter type-id='cf536864'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='d34c43a2'/>
      <parameter type-id='79a0948f'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <class-decl name='dev_probe' is-struct='yes' visibility='default' is-declaration-only='yes' id='423f6ac5'/>
    <typedef-decl name='DIR' type-id='20cd7405' id='54a5d696'/>
    <function-decl name='strncpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='2da84c559242300d'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='socket' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='socket' hash='a3e40634f2a60824'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='loadopt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='unknown' hash='6915b710ae33e54a' id='e84913bd'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e5f58cef' size-in-bits='unknown' hash='19a7bd76e4562e22' id='ffd877e8'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <class-decl name='efi_ipv4_addr_t' is-struct='yes' naming-typedef-id='412b364d' visibility='default' size-in-bits='32' hash='06e09f2ac003723c' id='b31ebfd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='d351502e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_ipv6_addr_t' is-struct='yes' naming-typedef-id='fc92b1bb' visibility='default' size-in-bits='128' hash='ce461c0a8c6878a7' id='cbfebeac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_1394' is-struct='yes' naming-typedef-id='3d4efd62' visibility='default' size-in-bits='128' hash='8544afd2aafea6c4' id='28b6ee97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_adr' is-struct='yes' naming-typedef-id='08cbf432' visibility='default' size-in-bits='32' hash='75d0e8e62717b42b' id='1ce400fb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='1e7b9b2b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid' is-struct='yes' naming-typedef-id='0c84f0de' visibility='default' size-in-bits='96' hash='f05a5786606cbb01' id='4b86752f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid_ex' is-struct='yes' naming-typedef-id='9bf7f2ce' visibility='default' size-in-bits='128' hash='29b2990c41a9b4f0' id='6cde4435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='e84913bd' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_atapi' is-struct='yes' naming-typedef-id='2cad3672' visibility='default' size-in-bits='64' hash='d9b48e4e9e80de96' id='eeb93fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bios_boot' is-struct='yes' naming-typedef-id='fbc6a14d' visibility='default' size-in-bits='64' hash='9b20103dc7a182eb' id='153d42de'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bmc' is-struct='yes' naming-typedef-id='13c4654b' visibility='default' size-in-bits='104' hash='943de8cd84cab34c' id='bf95ae98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bt' is-struct='yes' naming-typedef-id='6c854e35' visibility='default' size-in-bits='80' hash='3d8ecae31af49d99' id='a5a12170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='0f562bd0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_btle' is-struct='yes' naming-typedef-id='3fb6285a' visibility='default' size-in-bits='88' hash='52eaff9ff963af14' id='80167ee3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_cdrom' is-struct='yes' naming-typedef-id='6290ba36' visibility='default' size-in-bits='192' hash='2ac237d180dcc5c5' id='b2f8c585'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_controller' is-struct='yes' naming-typedef-id='3ef96a7f' visibility='default' size-in-bits='64' hash='cf9515f165aacac4' id='7761162e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_dns' is-struct='yes' naming-typedef-id='a1bdbd56' visibility='default' size-in-bits='40' hash='d81b45e96bb460cd' id='e45cb779'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='ffd877e8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_emmc' is-struct='yes' naming-typedef-id='0a899529' visibility='default' size-in-bits='40' hash='064ef1691332f3bc' id='a1dc3ae8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fc' is-struct='yes' naming-typedef-id='6d8fdd24' visibility='default' size-in-bits='192' hash='ced686a5243015d8' id='c496c4e1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fcex' is-struct='yes' naming-typedef-id='b7f47ab1' visibility='default' size-in-bits='192' hash='fdd9f398457280d4' id='84855c5c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='13339fda' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_file' is-struct='yes' naming-typedef-id='45b122cd' visibility='default' size-in-bits='32' hash='2a58d2bcdef661c1' id='59d5c928'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='b2ac2861' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_file' is-struct='yes' naming-typedef-id='dd0d98b9' visibility='default' size-in-bits='32' hash='740a52927612a4c5' id='0d4d4b76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_volume' is-struct='yes' naming-typedef-id='fe432af1' visibility='default' size-in-bits='32' hash='b6940d9eaecb7302' id='b2533432'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hd' is-struct='yes' naming-typedef-id='589ec69f' visibility='default' size-in-bits='336' hash='500adc973b4f83f2' id='b9923662'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_header' is-struct='yes' naming-typedef-id='a2bb6842' visibility='default' size-in-bits='32' hash='8bed7d4ae6a96e19' id='6671dbbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hw_vendor' is-struct='yes' naming-typedef-id='fdaecb0d' visibility='default' size-in-bits='160' hash='62254feea29f4446' id='f5774636'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_i2o' is-struct='yes' naming-typedef-id='05243501' visibility='default' size-in-bits='64' hash='ab016445bf7b0a85' id='bb34d6ce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_infiniband' is-struct='yes' naming-typedef-id='20bf68db' visibility='default' size-in-bits='384' hash='7a7174f779eb6615' id='db9b1b26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='c1c22e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv4_addr' is-struct='yes' naming-typedef-id='5b31688a' visibility='default' size-in-bits='216' hash='6553af3521986270' id='59a756e5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='d351502e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='d351502e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='e13418d1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='d351502e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='d351502e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv6_addr' is-struct='yes' naming-typedef-id='56e51784' visibility='default' size-in-bits='480' hash='02c8d2b93351d381' id='074e5cbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_iscsi' is-struct='yes' naming-typedef-id='7682f86c' visibility='default' size-in-bits='144' hash='8c2211be2f136161' id='ae7bc80b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_lun' is-struct='yes' naming-typedef-id='03616852' visibility='default' size-in-bits='40' hash='e54cf8b0a6f0bab5' id='7a694e05'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mac_addr' is-struct='yes' naming-typedef-id='e8635d54' visibility='default' size-in-bits='296' hash='fa351eabfeb13867' id='71f318d9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='d0f1c0cb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_media_vendor' is-struct='yes' naming-typedef-id='6e1bf8dc' visibility='default' size-in-bits='160' hash='d30ec0e0233a9e6a' id='0e23b2a1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mmio' is-struct='yes' naming-typedef-id='1b8dbe41' visibility='default' size-in-bits='192' hash='5d1130b2b90fd17a' id='2fad9120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_msg_vendor' is-struct='yes' naming-typedef-id='e582a5a7' visibility='default' size-in-bits='160' hash='3d3d09ed7bdcfc6c' id='f1b08eba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvdimm' is-struct='yes' naming-typedef-id='39f50192' visibility='default' size-in-bits='160' hash='f68f8a8ba35971ac' id='502ffbeb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvme' is-struct='yes' naming-typedef-id='d283817d' visibility='default' size-in-bits='128' hash='7266005b40c2b239' id='df379988'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='13339fda' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pccard' is-struct='yes' naming-typedef-id='6a88795c' visibility='default' size-in-bits='40' hash='76864c2dbba27f52' id='16fbcd2d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pci' is-struct='yes' naming-typedef-id='21ab9665' visibility='default' size-in-bits='48' hash='bf4270d0b234e04c' id='80829236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_protocol' is-struct='yes' naming-typedef-id='8671d137' visibility='default' size-in-bits='160' hash='0e9283dad46f6b4d' id='5f2d0e06'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ramdisk' is-struct='yes' naming-typedef-id='7cdc50d8' visibility='default' size-in-bits='304' hash='915026c28973b548' id='0f37fad3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_relative_offset' is-struct='yes' naming-typedef-id='cec0a3b7' visibility='default' size-in-bits='192' hash='86db1d650c6b12a5' id='e3ae37f8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas' is-struct='yes' naming-typedef-id='d99603e0' visibility='default' size-in-bits='352' hash='a7ddda3ae9ac9409' id='f99b6d93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas_ex' is-struct='yes' naming-typedef-id='0d6e36e0' visibility='default' size-in-bits='192' hash='b7dbda6eb2aaf21a' id='01de6db1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sata' is-struct='yes' naming-typedef-id='1038d9cc' visibility='default' size-in-bits='80' hash='4e06f84c3eccdf80' id='e1b94ce9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_scsi' is-struct='yes' naming-typedef-id='1560f6f5' visibility='default' size-in-bits='64' hash='a57bbdd0ad8cce62' id='f4d80d0c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sd' is-struct='yes' naming-typedef-id='565bdd8c' visibility='default' size-in-bits='40' hash='c5b3811e3ec32dd9' id='9bca5fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart' is-struct='yes' naming-typedef-id='b5779e4f' visibility='default' size-in-bits='152' hash='0443805f2b07cf8e' id='9a583d86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart_flow_control' is-struct='yes' naming-typedef-id='da17af9e' visibility='default' size-in-bits='192' hash='bddccc1608b5a3af' id='7f18a66d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='1a7f9ac1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ufs' is-struct='yes' naming-typedef-id='7fa01f3d' visibility='default' size-in-bits='48' hash='e481220be92dac0d' id='287e2fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uri' is-struct='yes' naming-typedef-id='5d6e4ceb' visibility='default' size-in-bits='32' hash='a1f6bf871f5656f3' id='169c2860'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb' is-struct='yes' naming-typedef-id='7870b603' visibility='default' size-in-bits='48' hash='69ba10b704e1d6fa' id='379a1dbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_class' is-struct='yes' naming-typedef-id='a343413c' visibility='default' size-in-bits='88' hash='04d52521607f7783' id='9d226d43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_wwid' is-struct='yes' naming-typedef-id='02d14527' visibility='default' size-in-bits='80' hash='7b7cd9f4d8ad2c99' id='f551ad6a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='b2ac2861' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_vlan' is-struct='yes' naming-typedef-id='dc8329c2' visibility='default' size-in-bits='48' hash='627f0a8e48e4c38d' id='b04ea8db'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_wifi' is-struct='yes' naming-typedef-id='426a3196' visibility='default' size-in-bits='288' hash='655741e75268fa66' id='42e8e31b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='a2bb6842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='d0f1c0cb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' hash='91ff375fdb83a6da' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ip_addr_t' type-id='5a7edc3f' size-in-bits='128' id='e5f58cef'/>
    <typedef-decl name='efi_ipv4_addr_t' type-id='b31ebfd2' size-in-bits='32' id='412b364d'/>
    <typedef-decl name='efi_ipv6_addr_t' type-id='cbfebeac' size-in-bits='128' id='fc92b1bb'/>
    <typedef-decl name='efidp' type-id='3cce6e24' size-in-bits='64' hash='de702e35ca2a7687' id='1e2e605e'/>
    <typedef-decl name='efidp_1394' type-id='28b6ee97' size-in-bits='128' id='3d4efd62'/>
    <typedef-decl name='efidp_acpi_adr' type-id='1ce400fb' size-in-bits='32' id='08cbf432'/>
    <typedef-decl name='efidp_acpi_hid' type-id='4b86752f' size-in-bits='96' id='0c84f0de'/>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='6cde4435' size-in-bits='128' id='9bf7f2ce'/>
    <typedef-decl name='efidp_atapi' type-id='eeb93fb9' size-in-bits='64' id='2cad3672'/>
    <typedef-decl name='efidp_bios_boot' type-id='153d42de' size-in-bits='64' id='fbc6a14d'/>
    <typedef-decl name='efidp_bmc' type-id='bf95ae98' size-in-bits='104' id='13c4654b'/>
    <typedef-decl name='efidp_boolean' type-id='b96825af' size-in-bits='8' hash='6ebac62b3366db68' id='e13418d1'/>
    <typedef-decl name='efidp_bt' type-id='a5a12170' size-in-bits='80' id='6c854e35'/>
    <typedef-decl name='efidp_btle' type-id='80167ee3' size-in-bits='88' id='3fb6285a'/>
    <typedef-decl name='efidp_cdrom' type-id='b2f8c585' size-in-bits='192' id='6290ba36'/>
    <typedef-decl name='efidp_controller' type-id='7761162e' size-in-bits='64' id='3ef96a7f'/>
    <typedef-decl name='efidp_data' type-id='24897e2b' size-in-bits='480' id='dea47adb'/>
    <typedef-decl name='efidp_dns' type-id='e45cb779' size-in-bits='40' id='a1bdbd56'/>
    <typedef-decl name='efidp_emmc' type-id='a1dc3ae8' size-in-bits='40' id='0a899529'/>
    <typedef-decl name='efidp_fc' type-id='c496c4e1' size-in-bits='192' id='6d8fdd24'/>
    <typedef-decl name='efidp_fcex' type-id='84855c5c' size-in-bits='192' id='b7f47ab1'/>
    <typedef-decl name='efidp_file' type-id='59d5c928' size-in-bits='32' id='45b122cd'/>
    <typedef-decl name='efidp_firmware_file' type-id='0d4d4b76' size-in-bits='32' id='dd0d98b9'/>
    <typedef-decl name='efidp_firmware_volume' type-id='b2533432' size-in-bits='32' id='fe432af1'/>
    <typedef-decl name='efidp_hd' type-id='b9923662' size-in-bits='336' id='589ec69f'/>
    <typedef-decl name='efidp_header' type-id='6671dbbf' size-in-bits='32' id='a2bb6842'/>
    <typedef-decl name='efidp_hw_vendor' type-id='f5774636' size-in-bits='160' id='fdaecb0d'/>
    <typedef-decl name='efidp_i2o' type-id='bb34d6ce' size-in-bits='64' id='05243501'/>
    <typedef-decl name='efidp_infiniband' type-id='db9b1b26' size-in-bits='384' id='20bf68db'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='59a756e5' size-in-bits='216' id='5b31688a'/>
    <typedef-decl name='efidp_ipv6_addr' type-id='074e5cbb' size-in-bits='480' id='56e51784'/>
    <typedef-decl name='efidp_iscsi' type-id='ae7bc80b' size-in-bits='144' id='7682f86c'/>
    <typedef-decl name='efidp_lun' type-id='7a694e05' size-in-bits='40' id='03616852'/>
    <typedef-decl name='efidp_mac_addr' type-id='71f318d9' size-in-bits='296' id='e8635d54'/>
    <typedef-decl name='efidp_media_vendor' type-id='0e23b2a1' size-in-bits='160' id='6e1bf8dc'/>
    <typedef-decl name='efidp_mmio' type-id='2fad9120' size-in-bits='192' id='1b8dbe41'/>
    <typedef-decl name='efidp_msg_vendor' type-id='f1b08eba' size-in-bits='160' id='e582a5a7'/>
    <typedef-decl name='efidp_nvdimm' type-id='502ffbeb' size-in-bits='160' id='39f50192'/>
    <typedef-decl name='efidp_nvme' type-id='df379988' size-in-bits='128' id='d283817d'/>
    <typedef-decl name='efidp_pccard' type-id='16fbcd2d' size-in-bits='40' id='6a88795c'/>
    <typedef-decl name='efidp_pci' type-id='80829236' size-in-bits='48' id='21ab9665'/>
