<abi-corpus version='2.4' path='libefiboot.so' architecture='elf-amd-x86_64' soname='libefiboot.so.1'>
  <elf-needed>
    <dependency name='libefivar.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='efi_generate_file_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_file_device_path_from_esp' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_ipv4_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_get_libefiboot_version' version='LIBEFIBOOT_1.31' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_ucs2' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_utf8' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='memcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='open64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='opendir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='posix_memalign' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='readdir64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='readlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sched_yield' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='setmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcspn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strstr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vasprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='creator.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' hash='9904ddbe9e0e1da6' id='type-id-2'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-4'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-5'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-6'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-7'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-9'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-10'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-12'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-13'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-16' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-24' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mntent' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/mntent.h' line='51' column='1' hash='d7b62e92027a844d' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-15' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-15' visibility='default' filepath='/usr/include/mntent.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-15' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-15' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-11' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-11' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' hash='4f24305487cf2e09' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-34' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-37' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-14' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-41'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-42' filepath='/usr/include/bits/types/struct_FILE.h' line='45' column='1' id='type-id-43'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-38'/>
    <typedef-decl name='__blksize_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-37'/>
    <typedef-decl name='__dev_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-31'/>
    <typedef-decl name='__gid_t' type-id='type-id-28' size-in-bits='32' filepath='/usr/include/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-36'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='148' column='1' hash='8fdc5eea2983a729' id='type-id-32'/>
    <typedef-decl name='__int32_t' type-id='type-id-11' size-in-bits='32' filepath='/usr/include/bits/types.h' line='41' column='1' hash='09d17c08f594edc7' id='type-id-44'/>
    <typedef-decl name='__mode_t' type-id='type-id-28' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-34'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-33'/>
    <typedef-decl name='__off64_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='153' column='1' hash='b119fe0931d2ee10' id='type-id-21'/>
    <typedef-decl name='__off_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-18'/>
    <typedef-decl name='__ssize_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-45'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-1'/>
    <typedef-decl name='__time_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-40'/>
    <typedef-decl name='__uid_t' type-id='type-id-28' size-in-bits='32' filepath='/usr/include/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-35'/>
    <typedef-decl name='__uint16_t' type-id='type-id-19' size-in-bits='16' filepath='/usr/include/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-46'/>
    <typedef-decl name='__uint32_t' type-id='type-id-28' size-in-bits='32' filepath='/usr/include/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-47'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-26'/>
    <typedef-decl name='__uint8_t' type-id='type-id-48' size-in-bits='8' filepath='/usr/include/bits/types.h' line='38' column='1' hash='6ebac62b3366db68' id='type-id-49'/>
    <typedef-decl name='int32_t' type-id='type-id-44' size-in-bits='32' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='type-id-50'/>
    <typedef-decl name='size_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-51'/>
    <typedef-decl name='uint16_t' type-id='type-id-46' size-in-bits='16' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-52'/>
    <typedef-decl name='uint32_t' type-id='type-id-47' size-in-bits='32' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-53'/>
    <typedef-decl name='uint8_t' type-id='type-id-49' size-in-bits='8' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='type-id-54'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-48'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-28'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='type-id-19'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-55'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-17'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='e8c018048121152c' id='type-id-25'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-56'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-15'/>
    <qualified-type-def type-id='type-id-15' const='yes' hash='351aa155d9983c83' id='type-id-57'/>
    <qualified-type-def type-id='type-id-15' restrict='yes' hash='566dfacc48804f50' id='type-id-58'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-59'/>
    <qualified-type-def type-id='type-id-59' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-60'/>
    <qualified-type-def type-id='type-id-6' const='yes' hash='3e50fd33f9bb78d9' id='type-id-61'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='c44743f354f6a443' id='type-id-62'/>
    <qualified-type-def type-id='type-id-62' const='yes' hash='ec42cf78a9d93a8c' id='type-id-63'/>
    <qualified-type-def type-id='type-id-62' restrict='yes' hash='b7d5472019e79b5f' id='type-id-64'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-65'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' hash='0674698d60236763' id='type-id-66'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' hash='925ad1338878bb49' id='type-id-67'/>
    <qualified-type-def type-id='type-id-67' restrict='yes' hash='625d51349de39d13' id='type-id-68'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' hash='24d8cca8965ce13e' id='type-id-69'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-42'/>
    </function-decl>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-77'/>
    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' filepath='src/creator.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0' hash='c3ec68b77fe0cdaf'>
      <parameter type-id='type-id-69' name='buf' filepath='src/creator.c' line='313' column='1'/>
      <parameter type-id='type-id-78' name='size' filepath='src/creator.c' line='313' column='1'/>
      <parameter type-id='type-id-62' name='devpath' filepath='src/creator.c' line='314' column='1'/>
      <parameter type-id='type-id-11' name='partition' filepath='src/creator.c' line='314' column='1'/>
      <parameter type-id='type-id-62' name='relpath' filepath='src/creator.c' line='315' column='1'/>
      <parameter type-id='type-id-53' name='options' filepath='src/creator.c' line='316' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' filepath='src/creator.c' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0' hash='29c8c87e28d7328f'>
      <parameter type-id='type-id-69' name='buf' filepath='src/creator.c' line='365' column='1'/>
      <parameter type-id='type-id-78' name='size' filepath='src/creator.c' line='365' column='1'/>
      <parameter type-id='type-id-63' name='filepath' filepath='src/creator.c' line='366' column='1'/>
      <parameter type-id='type-id-53' name='options' filepath='src/creator.c' line='367' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0' hash='39a5bbe456365610'>
      <parameter type-id='type-id-69' name='buf' filepath='src/creator.c' line='456' column='1'/>
      <parameter type-id='type-id-78' name='size' filepath='src/creator.c' line='456' column='1'/>
      <parameter type-id='type-id-63' name='ifname' filepath='src/creator.c' line='457' column='1'/>
      <parameter type-id='type-id-63' name='local_addr' filepath='src/creator.c' line='458' column='1'/>
      <parameter type-id='type-id-63' name='remote_addr' filepath='src/creator.c' line='459' column='1'/>
      <parameter type-id='type-id-63' name='gateway_addr' filepath='src/creator.c' line='460' column='1'/>
      <parameter type-id='type-id-63' name='netmask' filepath='src/creator.c' line='461' column='1'/>
      <parameter type-id='type-id-52' name='local_port' filepath='src/creator.c' line='462' column='1'/>
      <parameter type-id='type-id-52' name='remote_port' filepath='src/creator.c' line='463' column='1'/>
      <parameter type-id='type-id-52' name='protocol' filepath='src/creator.c' line='464' column='1'/>
      <parameter type-id='type-id-54' name='addr_origin' filepath='src/creator.c' line='465' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31' hash='2bb88322482ae81c'>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10' hash='07eca923f855f911'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4' hash='03e6b2de327a64a6'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file' hash='3ce455c27a41063c'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic' hash='b506cd9ed266061a'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set' hash='70b5b1b837bb6203'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-62'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear' hash='7f32ffea222edbe7'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38' hash='388da3fa973fde78'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile' hash='2c833d407d937488'>
      <return type-id='type-id-55'/>
    </function-decl>
    <class-decl name='device' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='src/linux.h' line='107' column='1' id='type-id-75'/>
    <typedef-decl name='DIR' type-id='type-id-77' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-70'/>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir' hash='388da3fa973fde78'>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64' hash='1d81aff51c388187'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-11'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='setmntent' filepath='/usr/include/mntent.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setmntent' hash='ce3a19dab827954e'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='getmntent' filepath='/usr/include/mntent.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntent' hash='91d4bad7dccf9ae4'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endmntent' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf' hash='31c19dfde3fac410'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-62'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf' hash='c4bcbce131b4d300'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asprintf' hash='156e512eaea45d1d'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-64'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='d2c49d83b30fb50c'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strdup' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64' hash='5ffe6a576201da98'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlink' hash='f237a668886d5b45'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-79'/>
    <type-decl name='void' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' id='type-id-24'/>
  </abi-instr>
  <abi-instr address-size='64' path='disk.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='efi_guid_t' is-struct='yes' naming-typedef-id='type-id-80' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='17' column='1' hash='499ca0d1cb6501b7' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timeval' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timeval.h' line='8' column='1' hash='bc6c194f1d75b24d' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-84' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__suseconds_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='162' column='1' hash='b119fe0931d2ee10' id='type-id-84'/>
    <typedef-decl name='efi_guid_t' type-id='type-id-81' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-80'/>
    <typedef-decl name='ssize_t' type-id='type-id-45' size-in-bits='64' filepath='/usr/include/stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='type-id-78'/>
    <typedef-decl name='uint64_t' type-id='type-id-26' size-in-bits='64' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-85'/>
    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='48' hash='b6435304905fc8f6' id='type-id-82'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-86'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='c6942bb633dc77f9' id='type-id-87'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' hash='5f318e120e3d3e21' id='type-id-88'/>
    <qualified-type-def type-id='type-id-88' restrict='yes' hash='105de60df608a8be' id='type-id-89'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='a7b536d51360d693' id='type-id-90'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' hash='473a9667a2856e32' id='type-id-91'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-94'/>
    <qualified-type-def type-id='type-id-24' restrict='yes' id='type-id-95'/>
    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd' hash='6522f79156f34f09'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-94' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-92'/>
    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_memalign' hash='f74641e922c0ae49'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl' hash='b03aa5f98a3a1499'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64' hash='5227d00433989f9c'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gettimeofday' filepath='/usr/include/sys/time.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gettimeofday' hash='71e4ee281a0f808c'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lseek64' hash='e90b592389225111'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='read' hash='e1f135b405ab837f'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write' hash='e1f135b405ab837f'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-78'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gpt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='520' hash='5b11e0ff30e6fbfa' id='type-id-96'>
      <subrange length='65' lower-bound='0' upper-bound='64' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='ba3b86918ae00425' id='type-id-97'/>
    </array-type-def>
    <class-decl name='utsname' is-struct='yes' visibility='default' size-in-bits='3120' filepath='/usr/include/sys/utsname.h' line='48' column='1' hash='e8c5f4e1269cd961' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-96' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-96' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-96' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-96' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-96' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='domainname' type-id='type-id-96' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' hash='907e6270359c7eb6' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-102'/>
    <typedef-decl name='DIR' type-id='type-id-102' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-100'/>
    <function-decl name='sscanf' mangled-name='__isoc23_sscanf' filepath='/usr/include/stdio.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_sscanf' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strerror' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname' hash='5024d1665fd35374'>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-acpi-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-105'/>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-42'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-106'/>
    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid' hash='f5a2a9c0c61e24a4'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex' hash='4281f7728a24ab46'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-106' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-103'/>
    <function-decl name='strndup' filepath='/usr/include/string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strndup' hash='64b4b60cdba4ca37'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen' hash='e62a7a46b2904b02'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-51'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-acpi.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-109'/>
    <typedef-decl name='DIR' type-id='type-id-109' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-107'/>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield' hash='388da3fa973fde78'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf' hash='cf2e9adf5c1c1adb'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc' hash='91495cdf6321a116'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-24'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='a285db8f38e4ea02' id='type-id-110'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-113'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi' hash='8d0fa82e7b25b51b'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-114' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-111'/>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strrchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strstr' filepath='/usr/include/string.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strstr' hash='21babdbcb7a34ebe'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-emmc.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc' hash='07eca923f855f911'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-117' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-115'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-120'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <typedef-decl name='DIR' type-id='type-id-121' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-118'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-md.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <typedef-decl name='DIR' type-id='type-id-124' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-122'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme' hash='d9a2c0e27704fe63'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_pop@@LIBEFIVAR_1.38' hash='7f32ffea222edbe7'>
      <return type-id='type-id-42'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-127' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-125'/>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access' hash='1d81aff51c388187'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-130'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
    <typedef-decl name='DIR' type-id='type-id-131' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-128'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
    <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci' hash='b73f76c73cec0ebf'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-134' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-132'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-137'/>
    <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm' hash='a569643fc7cb3129'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid' hash='b0097e728d3a5ab0'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-137' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-135'/>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-139'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-140'/>
    <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas' hash='b5a3c136924ec33c'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-140' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-138'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-141'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-142'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-143'/>
    <class-decl name='dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='/usr/include/bits/dirent.h' line='22' column='1' hash='f8f1acd4a88a2190' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-145' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-141' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='149' column='1' hash='8fdc5eea2983a729' id='type-id-145'/>
    <typedef-decl name='__int16_t' type-id='type-id-143' size-in-bits='16' filepath='/usr/include/bits/types.h' line='39' column='1' hash='6c2352eccdcd3eea' id='type-id-146'/>
    <typedef-decl name='int16_t' type-id='type-id-146' size-in-bits='16' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' hash='6c2352eccdcd3eea' id='type-id-147'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='1ce54f87b39780f9' id='type-id-148'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-151'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-152'/>
    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata' hash='6218a14b01b1ebaf'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-152' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-149'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64' hash='8210c868a3f56bcd'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-148'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-155'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-156'/>
    <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi' hash='7050a255ca14152e'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-156' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-153'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-soc-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-159'/>
    <typedef-decl name='DIR' type-id='type-id-159' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-157'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-162'/>
    <typedef-decl name='DIR' type-id='type-id-162' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-160'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux-virtual-root.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-164'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-165'/>
    <typedef-decl name='DIR' type-id='type-id-165' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-163'/>
  </abi-instr>
  <abi-instr address-size='64' path='linux.c' comp-dir-path='src' language='LANG_C11'>
    <typedef-decl name='const_efidp' type-id='type-id-166' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' hash='8183b12658ab99b1' id='type-id-167'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-168'/>
    <qualified-type-def type-id='type-id-169' const='yes' hash='6a235f390cae8715' id='type-id-170'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' hash='8183b12658ab99b1' id='type-id-166'/>
    <qualified-type-def type-id='type-id-54' const='yes' hash='5a6582fbecdbfc78' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' hash='d2a42ec7d4838233' id='type-id-172'/>
    <qualified-type-def type-id='type-id-172' const='yes' hash='5211ca787f6a625f' id='type-id-173'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-176'/>
    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr' hash='64bda095715de9e4'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path' hash='432553564090deee'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <class-decl name='dev_probe' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='src/linux.h' line='329' column='1' id='type-id-178'/>
    <typedef-decl name='DIR' type-id='type-id-176' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-174'/>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='2da84c559242300d'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='socket' hash='a3e40634f2a60824'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='loadopt.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='unknown' hash='6915b710ae33e54a' id='type-id-179'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-180'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-181' size-in-bits='unknown' hash='19a7bd76e4562e22' id='type-id-182'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-180'/>
    </array-type-def>
    <class-decl name='efi_ipv4_addr_t' is-struct='yes' naming-typedef-id='type-id-183' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='35' column='1' hash='06e09f2ac003723c' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_ipv6_addr_t' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='39' column='1' hash='ce461c0a8c6878a7' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_1394' is-struct='yes' naming-typedef-id='type-id-189' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' hash='8544afd2aafea6c4' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_adr' is-struct='yes' naming-typedef-id='type-id-192' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' hash='75d0e8e62717b42b' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-194' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid' is-struct='yes' naming-typedef-id='type-id-195' visibility='default' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' hash='f05a5786606cbb01' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid_ex' is-struct='yes' naming-typedef-id='type-id-197' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' hash='29b2990c41a9b4f0' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_atapi' is-struct='yes' naming-typedef-id='type-id-199' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' hash='d9b48e4e9e80de96' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bios_boot' is-struct='yes' naming-typedef-id='type-id-201' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' hash='9b20103dc7a182eb' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bmc' is-struct='yes' naming-typedef-id='type-id-204' visibility='default' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' hash='943de8cd84cab34c' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bt' is-struct='yes' naming-typedef-id='type-id-206' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' hash='3d8ecae31af49d99' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_btle' is-struct='yes' naming-typedef-id='type-id-208' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' hash='52eaff9ff963af14' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_cdrom' is-struct='yes' naming-typedef-id='type-id-210' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' hash='2ac237d180dcc5c5' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_controller' is-struct='yes' naming-typedef-id='type-id-212' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' hash='cf9515f165aacac4' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_dns' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' hash='d81b45e96bb460cd' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_emmc' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' hash='064ef1691332f3bc' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fc' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' hash='ced686a5243015d8' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fcex' is-struct='yes' naming-typedef-id='type-id-220' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' hash='fdd9f398457280d4' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_file' is-struct='yes' naming-typedef-id='type-id-223' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' hash='2a58d2bcdef661c1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_file' is-struct='yes' naming-typedef-id='type-id-226' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' hash='740a52927612a4c5' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_volume' is-struct='yes' naming-typedef-id='type-id-228' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' hash='b6940d9eaecb7302' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hd' is-struct='yes' naming-typedef-id='type-id-230' visibility='default' size-in-bits='336' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' hash='500adc973b4f83f2' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_header' is-struct='yes' naming-typedef-id='type-id-191' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' hash='8bed7d4ae6a96e19' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hw_vendor' is-struct='yes' naming-typedef-id='type-id-233' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' hash='62254feea29f4446' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_i2o' is-struct='yes' naming-typedef-id='type-id-235' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' hash='ab016445bf7b0a85' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_infiniband' is-struct='yes' naming-typedef-id='type-id-237' visibility='default' size-in-bits='384' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' hash='7a7174f779eb6615' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-239' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-240' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv4_addr' is-struct='yes' naming-typedef-id='type-id-241' visibility='default' size-in-bits='216' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' hash='6553af3521986270' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-243' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv6_addr' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' hash='02c8d2b93351d381' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_iscsi' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' size-in-bits='144' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' hash='8c2211be2f136161' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_lun' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' hash='e54cf8b0a6f0bab5' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mac_addr' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' size-in-bits='296' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' hash='fa351eabfeb13867' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_media_vendor' is-struct='yes' naming-typedef-id='type-id-253' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' hash='d30ec0e0233a9e6a' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mmio' is-struct='yes' naming-typedef-id='type-id-255' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' hash='5d1130b2b90fd17a' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_msg_vendor' is-struct='yes' naming-typedef-id='type-id-257' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' hash='3d3d09ed7bdcfc6c' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvdimm' is-struct='yes' naming-typedef-id='type-id-259' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' hash='f68f8a8ba35971ac' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvme' is-struct='yes' naming-typedef-id='type-id-261' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' hash='7266005b40c2b239' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='645' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pccard' is-struct='yes' naming-typedef-id='type-id-263' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' hash='76864c2dbba27f52' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pci' is-struct='yes' naming-typedef-id='type-id-265' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' hash='bf4270d0b234e04c' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_protocol' is-struct='yes' naming-typedef-id='type-id-267' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' hash='0e9283dad46f6b4d' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ramdisk' is-struct='yes' naming-typedef-id='type-id-269' visibility='default' size-in-bits='304' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' hash='915026c28973b548' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_relative_offset' is-struct='yes' naming-typedef-id='type-id-271' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' hash='86db1d650c6b12a5' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas' is-struct='yes' naming-typedef-id='type-id-273' visibility='default' size-in-bits='352' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' hash='a7ddda3ae9ac9409' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas_ex' is-struct='yes' naming-typedef-id='type-id-275' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' hash='b7dbda6eb2aaf21a' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sata' is-struct='yes' naming-typedef-id='type-id-277' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' hash='4e06f84c3eccdf80' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_scsi' is-struct='yes' naming-typedef-id='type-id-279' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' hash='a57bbdd0ad8cce62' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sd' is-struct='yes' naming-typedef-id='type-id-281' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' hash='c5b3811e3ec32dd9' id='type-id-282'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart' is-struct='yes' naming-typedef-id='type-id-283' visibility='default' size-in-bits='152' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' hash='0443805f2b07cf8e' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart_flow_control' is-struct='yes' naming-typedef-id='type-id-285' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' hash='bddccc1608b5a3af' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='553' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ufs' is-struct='yes' naming-typedef-id='type-id-287' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' hash='e481220be92dac0d' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uri' is-struct='yes' naming-typedef-id='type-id-289' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' hash='a1f6bf871f5656f3' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb' is-struct='yes' naming-typedef-id='type-id-291' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' hash='69ba10b704e1d6fa' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_class' is-struct='yes' naming-typedef-id='type-id-293' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' hash='04d52521607f7783' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_wwid' is-struct='yes' naming-typedef-id='type-id-295' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' hash='7b7cd9f4d8ad2c99' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-225' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_vlan' is-struct='yes' naming-typedef-id='type-id-297' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' hash='627f0a8e48e4c38d' id='type-id-298'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_wifi' is-struct='yes' naming-typedef-id='type-id-299' visibility='default' size-in-bits='288' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' hash='655741e75268fa66' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' hash='91ff375fdb83a6da' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-302' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-181'/>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-184' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-183'/>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-187' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-186'/>
    <typedef-decl name='efidp' type-id='type-id-303' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' hash='de702e35ca2a7687' id='type-id-304'/>
    <typedef-decl name='efidp_1394' type-id='type-id-190' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-189'/>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-193' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-192'/>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-196' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-195'/>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-198' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-197'/>
    <typedef-decl name='efidp_atapi' type-id='type-id-200' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-199'/>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-202' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-201'/>
    <typedef-decl name='efidp_bmc' type-id='type-id-205' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-204'/>
    <typedef-decl name='efidp_boolean' type-id='type-id-54' size-in-bits='8' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' hash='6ebac62b3366db68' id='type-id-243'/>
    <typedef-decl name='efidp_bt' type-id='type-id-207' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-206'/>
    <typedef-decl name='efidp_btle' type-id='type-id-209' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-208'/>
    <typedef-decl name='efidp_cdrom' type-id='type-id-211' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-210'/>
    <typedef-decl name='efidp_controller' type-id='type-id-213' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-212'/>
    <typedef-decl name='efidp_data' type-id='type-id-305' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-169'/>
    <typedef-decl name='efidp_dns' type-id='type-id-215' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-214'/>
    <typedef-decl name='efidp_emmc' type-id='type-id-217' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-216'/>
    <typedef-decl name='efidp_fc' type-id='type-id-219' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-218'/>
    <typedef-decl name='efidp_fcex' type-id='type-id-221' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-220'/>
    <typedef-decl name='efidp_file' type-id='type-id-224' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-223'/>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-227' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-226'/>
