<abi-corpus path='libefivar.so' architecture='elf-amd-x86_64' soname='libefivar.so.1'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_efi_set_variable' version='libefivar.so.0' is-default-version='no' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_efi_set_variable_variadic' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_append_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_chmod_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_del_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_error_clear' version='LIBEFIVAR_1.30' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='efi_guid_lenovo_me_config' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_lenovo_msg' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_lenovo_rescue' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_lenovo_setup' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_lenovo_startup_interrupt' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_microsoft' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_pkcs7_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat_2' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_security' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha224' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shell' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shim' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_ux_capsule' size='16' version='LIBEFIVAR_1.33' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_zero' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids' size='18480' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids_end' size='1' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='efivarfs.c' comp-dir-path='src' language='LANG_C99'>
    <class-decl name='efi_var_operations' size-in-bits='2624' is-struct='yes' visibility='default' filepath='src/lib.h' line='29' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-2' visibility='default' filepath='src/lib.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='probe' type-id='type-id-3' visibility='default' filepath='src/lib.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='set_variable' type-id='type-id-4' visibility='default' filepath='src/lib.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='del_variable' type-id='type-id-5' visibility='default' filepath='src/lib.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='get_variable' type-id='type-id-6' visibility='default' filepath='src/lib.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='get_variable_attributes' type-id='type-id-7' visibility='default' filepath='src/lib.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='get_variable_size' type-id='type-id-8' visibility='default' filepath='src/lib.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='get_next_variable_name' type-id='type-id-9' visibility='default' filepath='src/lib.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='append_variable' type-id='type-id-10' visibility='default' filepath='src/lib.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='chmod_variable' type-id='type-id-11' visibility='default' filepath='src/lib.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-12'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-13'/>

    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='2040' id='type-id-2'>
      <subrange length='255' type-id='type-id-13' id='type-id-14'/>

    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-15'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-3'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar.h' line='33' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-22'/>
    <typedef-decl name='__uint32_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-23'/>
    <typedef-decl name='uint32_t' type-id='type-id-23' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-19'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-24'/>
    <typedef-decl name='__uint16_t' type-id='type-id-24' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-25'/>
    <typedef-decl name='uint16_t' type-id='type-id-25' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-20'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-26'/>
    <typedef-decl name='__uint8_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-27'/>
    <typedef-decl name='uint8_t' type-id='type-id-27' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-28'/>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='48' id='type-id-21'>
      <subrange length='6' type-id='type-id-13' id='type-id-29'/>

    </array-type-def>
    <typedef-decl name='efi_guid_t' type-id='type-id-18' filepath='src/include/efivar/efivar.h' line='39' column='1' id='type-id-17'/>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-32'/>
    <typedef-decl name='size_t' type-id='type-id-13' filepath='/usr/lib/gcc/x86_64-redhat-linux/8/include/stddef.h' line='216' column='1' id='type-id-33'/>
    <typedef-decl name='__mode_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-34'/>
    <typedef-decl name='mode_t' type-id='type-id-34' filepath='/usr/include/fcntl.h' line='50' column='1' id='type-id-35'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-11'/>
    <var-decl name='efivarfs_ops' type-id='type-id-1' visibility='default' filepath='src/lib.h' line='51' column='1'/>
    <function-type size-in-bits='64' id='type-id-16'>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-48'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-37'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-43'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-50'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-42'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-41'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-49'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='guid-symbols.c' comp-dir-path='src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-51'/>
    <var-decl name='efi_guid_empty' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='4' column='1'/>
    <var-decl name='efi_guid_zero' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='5' column='1'/>
    <var-decl name='efi_guid_sha512' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='6' column='1'/>
    <var-decl name='efi_guid_redhat' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='7' column='1'/>
    <var-decl name='efi_guid_fwupdate' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='8' column='1'/>
    <var-decl name='efi_guid_sha224' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='9' column='1'/>
    <var-decl name='efi_guid_lenovo_boot_menu' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='10' column='1'/>
    <var-decl name='efi_guid_ux_capsule' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='11' column='1'/>
    <var-decl name='efi_guid_x509_sha256' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='12' column='1'/>
    <var-decl name='efi_guid_rsa2048' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='13' column='1'/>
    <var-decl name='efi_guid_lenovo' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='14' column='1'/>
    <var-decl name='efi_guid_lenovo_diag' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='15' column='1'/>
    <var-decl name='efi_guid_x509_sha512' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='16' column='1'/>
    <var-decl name='efi_guid_external_management' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='17' column='1'/>
    <var-decl name='efi_guid_pkcs7_cert' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='18' column='1'/>
    <var-decl name='efi_guid_shim' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='19' column='1'/>
    <var-decl name='efi_guid_lenovo_rescue' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='20' column='1'/>
    <var-decl name='efi_guid_rsa2048_sha1' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='21' column='1'/>
    <var-decl name='efi_guid_x509_sha384' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='22' column='1'/>
    <var-decl name='efi_guid_lenovo_setup' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='23' column='1'/>
    <var-decl name='efi_guid_microsoft' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='24' column='1'/>
    <var-decl name='efi_guid_lenovo_2' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='25' column='1'/>
    <var-decl name='efi_guid_sha1' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='26' column='1'/>
    <var-decl name='efi_guid_lenovo_me_config' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='27' column='1'/>
    <var-decl name='efi_guid_global' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='28' column='1'/>
    <var-decl name='efi_guid_x509_cert' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='29' column='1'/>
    <var-decl name='efi_guid_rsa2048_sha256_cert' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='30' column='1'/>
    <var-decl name='efi_guid_lenovo_diag_splash' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='31' column='1'/>
    <var-decl name='efi_guid_redhat_2' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='32' column='1'/>
    <var-decl name='efi_guid_lenovo_msg' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='33' column='1'/>
    <var-decl name='efi_guid_sha256' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='34' column='1'/>
    <var-decl name='efi_guid_shell' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='35' column='1'/>
    <var-decl name='efi_guid_security' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='36' column='1'/>
    <var-decl name='efi_guid_rsa2048_sha256' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='37' column='1'/>
    <var-decl name='efi_guid_sha384' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='38' column='1'/>
    <var-decl name='efi_guid_lenovo_startup_interrupt' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='39' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='vars.c' comp-dir-path='src' language='LANG_C99'>
    <var-decl name='vars_ops' type-id='type-id-1' visibility='default' filepath='src/lib.h' line='50' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-35' name='mode'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-35' name='mode'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0'>
      <parameter type-id='type-id-45' name='guid'/>
      <parameter type-id='type-id-47' name='name'/>
      <parameter type-id='type-id-45' name='guid'/>
      <parameter type-id='type-id-47' name='name'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-39' name='size'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-39' name='size'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@LIBEFIVAR_1.35'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-40' name='attributes'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-40' name='attributes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-38' name='data'/>
      <parameter type-id='type-id-39' name='data_size'/>
      <parameter type-id='type-id-40' name='attributes'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-38' name='data'/>
      <parameter type-id='type-id-39' name='data_size'/>
      <parameter type-id='type-id-40' name='attributes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-32' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <parameter type-id='type-id-19' name='attributes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_efi_set_variable_mode' mangled-name='efi_set_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_variable@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-32' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <parameter type-id='type-id-19' name='attributes'/>
      <parameter type-id='type-id-35' name='mode'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-32' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <parameter type-id='type-id-19' name='attributes'/>
      <parameter type-id='type-id-35' name='mode'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-32' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <parameter type-id='type-id-19' name='attributes'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-32' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <parameter type-id='type-id-19' name='attributes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-32' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <parameter type-id='type-id-19' name='attributes'/>
      <parameter type-id='type-id-17' name='guid'/>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-32' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <parameter type-id='type-id-19' name='attributes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_name_to_guid' mangled-name='efi_name_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_name_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-31' name='name'/>
      <parameter type-id='type-id-44' name='guid'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <function-decl name='efi_guid_to_id_guid' mangled-name='efi_guid_to_id_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_id_guid@@libefivar.so.0'>
      <parameter type-id='type-id-52' name='guid'/>
      <parameter type-id='type-id-47' name='sp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_guid_to_symbol' mangled-name='efi_guid_to_symbol' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_symbol@@libefivar.so.0'>
      <parameter type-id='type-id-44' name='guid'/>
      <parameter type-id='type-id-47' name='symbol'/>
      <parameter type-id='type-id-44' name='guid'/>
      <parameter type-id='type-id-47' name='symbol'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_guid_to_name' mangled-name='efi_guid_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_name@@libefivar.so.0'>
      <parameter type-id='type-id-44' name='guid'/>
      <parameter type-id='type-id-47' name='symbol'/>
      <parameter type-id='type-id-44' name='guid'/>
      <parameter type-id='type-id-47' name='symbol'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
      <parameter type-id='type-id-52' name='guid'/>
      <parameter type-id='type-id-47' name='sp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' mangled-name='efi_str_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-31' name='s'/>
      <parameter type-id='type-id-44' name='guid'/>
      <parameter type-id='type-id-31' name='s'/>
      <parameter type-id='type-id-44' name='guid'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
      <parameter type-id='type-id-52' name='guid'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-52' name='a'/>
      <parameter type-id='type-id-52' name='b'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <class-decl name='efi_variable' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/export.c' line='35' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrs' type-id='type-id-54' visibility='default' filepath='src/export.c' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-44' visibility='default' filepath='src/export.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-46' visibility='default' filepath='src/export.c' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-32' visibility='default' filepath='src/export.c' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-33' visibility='default' filepath='src/export.c' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-55'/>
    <typedef-decl name='uint64_t' type-id='type-id-55' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-54'/>
    <typedef-decl name='efi_variable_t' type-id='type-id-53' filepath='src/include/efivar/efivar.h' line='133' column='1' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <function-decl name='efi_variable_realize' mangled-name='efi_variable_realize' filepath='src/include/efivar/efivar-dp.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_realize@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='318' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-58'/>
    <function-decl name='efi_variable_get_attributes' mangled-name='efi_variable_get_attributes' filepath='src/include/efivar/efivar-dp.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='306' column='1'/>
      <parameter type-id='type-id-58' name='attrs' filepath='src/include/efivar/efivar-dp.h' line='306' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_variable_get_guid' mangled-name='efi_variable_get_guid' filepath='src/include/efivar/efivar-dp.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_guid@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
      <parameter type-id='type-id-45' name='guid' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
      <parameter type-id='type-id-45' name='guid' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_variable_set_attributes' mangled-name='efi_variable_set_attributes' filepath='src/include/efivar/efivar-dp.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='299' column='1'/>
      <parameter type-id='type-id-54' name='attrs' filepath='src/include/efivar/efivar-dp.h' line='299' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
    <typedef-decl name='__ssize_t' type-id='type-id-59' filepath='/usr/include/bits/types.h' line='191' column='1' id='type-id-60'/>
    <typedef-decl name='ssize_t' type-id='type-id-60' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-61'/>
    <function-decl name='efi_variable_get_data' mangled-name='efi_variable_get_data' filepath='src/include/efivar/efivar-dp.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_data@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
      <parameter type-id='type-id-38' name='data' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
      <parameter type-id='type-id-39' name='size' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
      <parameter type-id='type-id-38' name='data' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
      <parameter type-id='type-id-39' name='size' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efi_variable_set_data' mangled-name='efi_variable_set_data' filepath='src/include/efivar/efivar-dp.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_data@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_variable_set_guid' mangled-name='efi_variable_set_guid' filepath='src/include/efivar/efivar-dp.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_guid@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='254' column='1'/>
      <parameter type-id='type-id-44' name='guid' filepath='src/include/efivar/efivar-dp.h' line='254' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efi_variable_get_name' mangled-name='efi_variable_get_name' filepath='src/include/efivar/efivar-dp.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_name@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='243' column='1'/>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='243' column='1'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='efi_variable_set_name' mangled-name='efi_variable_set_name' filepath='src/include/efivar/efivar-dp.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_name@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='236' column='1'/>
      <parameter type-id='type-id-46' name='name' filepath='src/include/efivar/efivar-dp.h' line='236' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <type-decl name='void' id='type-id-62'/>
    <function-decl name='efi_variable_free' mangled-name='efi_variable_free' filepath='src/include/efivar/efivar-dp.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_free@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='215' column='1'/>
      <parameter type-id='type-id-15' name='free_data' filepath='src/include/efivar/efivar-dp.h' line='215' column='1'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='efi_variable_export' mangled-name='efi_variable_export' filepath='src/include/efivar/efivar-dp.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export@@libefivar.so.0'>
      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='150' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='150' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='150' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-63'/>
    <function-decl name='efi_variable_import' mangled-name='efi_variable_import' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_import@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      <parameter type-id='type-id-63' name='var_out' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efi_get_verbose' mangled-name='efi_get_verbose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_verbose@@LIBEFIVAR_1.36'>
      <return type-id='type-id-15'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-72' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-74' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-66'/>
    <typedef-decl name='__off_t' type-id='type-id-59' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-67'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-68'/>

    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='8' id='type-id-69'>
      <subrange length='1' type-id='type-id-13' id='type-id-76'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-59' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-70'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-77'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-71'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-78'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-73'/>

    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='160' id='type-id-74'>
      <subrange length='20' type-id='type-id-13' id='type-id-79'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-64' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <function-decl name='efi_set_verbose' mangled-name='efi_set_verbose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_verbose@@LIBEFIVAR_1.36'>
      <parameter type-id='type-id-15' name='verbosity'/>
      <parameter type-id='type-id-81' name='errlog'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile@@LIBEFIVAR_1.36'>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='efi_error_clear' mangled-name='efi_error_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear@@LIBEFIVAR_1.30'>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='efi_error_set' mangled-name='efi_error_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-31' name='filename'/>
      <parameter type-id='type-id-31' name='function'/>
      <parameter type-id='type-id-15' name='line'/>
      <parameter type-id='type-id-15' name='error'/>
      <parameter type-id='type-id-31' name='fmt'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-82'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-83'/>
    <function-decl name='efi_error_get' mangled-name='efi_error_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_get@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-22' name='n'/>
      <parameter type-id='type-id-82' name='filename'/>
      <parameter type-id='type-id-82' name='function'/>
      <parameter type-id='type-id-83' name='line'/>
      <parameter type-id='type-id-82' name='message'/>
      <parameter type-id='type-id-83' name='error'/>
      <parameter type-id='type-id-22' name='n'/>
      <parameter type-id='type-id-82' name='filename'/>
      <parameter type-id='type-id-82' name='function'/>
      <parameter type-id='type-id-83' name='line'/>
      <parameter type-id='type-id-82' name='message'/>
      <parameter type-id='type-id-83' name='error'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-44' name='uuid'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-44' name='uuid'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-54' name='sas_address'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-54' name='sas_address'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-20' name='primary'/>
      <parameter type-id='type-id-20' name='slave'/>
      <parameter type-id='type-id-20' name='lun'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-20' name='primary'/>
      <parameter type-id='type-id-20' name='slave'/>
      <parameter type-id='type-id-20' name='lun'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-84'/>
    <typedef-decl name='__int16_t' type-id='type-id-84' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-85'/>
    <typedef-decl name='int16_t' type-id='type-id-85' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-86'/>
    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-20' name='hba_port'/>
      <parameter type-id='type-id-86' name='port_multiplier_port'/>
      <parameter type-id='type-id-20' name='lun'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-20' name='hba_port'/>
      <parameter type-id='type-id-86' name='port_multiplier_port'/>
      <parameter type-id='type-id-20' name='lun'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='namespace_id'/>
      <parameter type-id='type-id-32' name='ieee_eui_64'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='namespace_id'/>
      <parameter type-id='type-id-32' name='ieee_eui_64'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-20' name='target'/>
      <parameter type-id='type-id-20' name='lun'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-20' name='target'/>
      <parameter type-id='type-id-20' name='lun'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='local'/>
      <parameter type-id='type-id-19' name='remote'/>
      <parameter type-id='type-id-19' name='gateway'/>
      <parameter type-id='type-id-19' name='netmask'/>
      <parameter type-id='type-id-20' name='local_port'/>
      <parameter type-id='type-id-20' name='remote_port'/>
      <parameter type-id='type-id-20' name='protocol'/>
      <parameter type-id='type-id-15' name='is_static'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='local'/>
      <parameter type-id='type-id-19' name='remote'/>
      <parameter type-id='type-id-19' name='gateway'/>
      <parameter type-id='type-id-19' name='netmask'/>
      <parameter type-id='type-id-20' name='local_port'/>
      <parameter type-id='type-id-20' name='remote_port'/>
      <parameter type-id='type-id-20' name='protocol'/>
      <parameter type-id='type-id-15' name='is_static'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-87'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-89'/>
    <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-28' name='if_type'/>
      <parameter type-id='type-id-89' name='mac_addr'/>
      <parameter type-id='type-id-61' name='mac_addr_size'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-28' name='if_type'/>
      <parameter type-id='type-id-89' name='mac_addr'/>
      <parameter type-id='type-id-61' name='mac_addr_size'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-90'/>
    <var-decl name='ops' type-id='type-id-90' visibility='default' filepath='src/lib.c' line='43' column='1'/>
    <var-decl name='default_ops' type-id='type-id-1' visibility='default' filepath='src/lib.c' line='38' column='1'/>
    <class-decl name='guidname' size-in-bits='4224' is-struct='yes' visibility='default' filepath='src/guid.h' line='181' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='guid' type-id='type-id-17' visibility='default' filepath='src/guid.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='symbol' type-id='type-id-92' visibility='default' filepath='src/guid.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='name' type-id='type-id-92' visibility='default' filepath='src/guid.h' line='184' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='2048' id='type-id-92'>
      <subrange length='256' type-id='type-id-13' id='type-id-93'/>

    </array-type-def>
    <var-decl name='efi_well_known_names_end' type-id='type-id-91' visibility='default' filepath='src/guid.c' line='100' column='1'/>
    <var-decl name='efi_well_known_names' type-id='type-id-91' visibility='default' filepath='src/guid.c' line='98' column='1'/>
    <var-decl name='efi_well_known_guids_end' type-id='type-id-91' visibility='default' filepath='src/guid.c' line='99' column='1'/>
    <var-decl name='efi_well_known_guids' type-id='type-id-91' visibility='default' filepath='src/guid.c' line='97' column='1'/>
    <var-decl name='stderr' type-id='type-id-81' visibility='default' filepath='/usr/include/stdio.h' line='139' column='1'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='__builtin_calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='num'/>
      <parameter type-id='type-id-54' name='part_start'/>
      <parameter type-id='type-id-54' name='part_size'/>
      <parameter type-id='type-id-32' name='signature'/>
      <parameter type-id='type-id-28' name='format'/>
      <parameter type-id='type-id-28' name='signature_type'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='num'/>
      <parameter type-id='type-id-54' name='part_start'/>
      <parameter type-id='type-id-54' name='part_size'/>
      <parameter type-id='type-id-32' name='signature'/>
      <parameter type-id='type-id-28' name='format'/>
      <parameter type-id='type-id-28' name='signature_type'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-46' name='filepath'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='hardware_device'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='hardware_device'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-28' name='device'/>
      <parameter type-id='type-id-28' name='function'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-28' name='device'/>
      <parameter type-id='type-id-28' name='function'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='hid'/>
      <parameter type-id='type-id-19' name='uid'/>
      <parameter type-id='type-id-19' name='cid'/>
      <parameter type-id='type-id-31' name='hidstr'/>
      <parameter type-id='type-id-31' name='uidstr'/>
      <parameter type-id='type-id-31' name='cidstr'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='hid'/>
      <parameter type-id='type-id-19' name='uid'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-19' name='hid'/>
      <parameter type-id='type-id-19' name='uid'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-28' name='type'/>
      <parameter type-id='type-id-28' name='subtype'/>
      <parameter type-id='type-id-61' name='total_size'/>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-28' name='type'/>
      <parameter type-id='type-id-28' name='subtype'/>
      <parameter type-id='type-id-61' name='total_size'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf'/>
      <parameter type-id='type-id-61' name='size'/>
      <parameter type-id='type-id-28' name='type'/>
      <parameter type-id='type-id-28' name='subtype'/>
      <parameter type-id='type-id-17' name='vendor_guid'/>
      <parameter type-id='type-id-73' name='data'/>
      <parameter type-id='type-id-33' name='data_size'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1' id='type-id-94'>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pci' type-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pccard' type-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mmio' type-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hw_vendor' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='controller' type-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bmc' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid' type-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid_ex' type-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_adr' type-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='atapi' type-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='scsi' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fc' type-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fcex' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firewire' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_class' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_wwid' type-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='lun' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sata' type-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i2o' type-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac_addr' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv4_addr' type-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv6_addr' type-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vlan' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='infiniband' type-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='msg_vendor' type-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart_flow_control' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas' type-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas_ex' type-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iscsi' type-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvme' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uri' type-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ufs' type-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sd' type-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bt' type-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='wifi' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='emmc' type-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='btle' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dns' type-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvdimm' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hd' type-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cdrom' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='media_vendor' type-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='file' type-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='protocol' type-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_file' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_volume' type-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='relative_offset' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ramdisk' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='889' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bios_boot' type-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='890' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-148' filepath='src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-96'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pci' type-id='type-id-149' filepath='src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-97'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pccard' type-id='type-id-150' filepath='src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-98'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_mmio' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-99'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='81' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='8' id='type-id-153'>
      <subrange length='1' type-id='type-id-13' id='type-id-76'/>

    </array-type-def>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-152' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-100'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_controller' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-101'/>
    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bmc' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-102'/>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-103'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-104'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='166' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-159' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='168' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='32' id='type-id-159'>
      <subrange length='1' type-id='type-id-13' id='type-id-76'/>

    </array-type-def>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-158' filepath='src/include/efivar/efivar-dp.h' line='169' column='1' id='type-id-105'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_atapi' type-id='type-id-160' filepath='src/include/efivar/efivar-dp.h' line='332' column='1' id='type-id-106'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_scsi' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-107'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fc' type-id='type-id-162' filepath='src/include/efivar/efivar-dp.h' line='351' column='1' id='type-id-108'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='64' id='type-id-164'>
      <subrange length='8' type-id='type-id-13' id='type-id-165'/>

    </array-type-def>
    <typedef-decl name='efidp_fcex' type-id='type-id-163' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-109'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_1394' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-110'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb' type-id='type-id-167' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-111'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='382' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_class' type-id='type-id-168' filepath='src/include/efivar/efivar-dp.h' line='383' column='1' id='type-id-112'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='16' id='type-id-170'>
      <subrange length='1' type-id='type-id-13' id='type-id-76'/>

    </array-type-def>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-169' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-113'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_lun' type-id='type-id-171' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' id='type-id-114'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='418' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='422' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sata' type-id='type-id-172' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-115'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_i2o' type-id='type-id-173' filepath='src/include/efivar/efivar-dp.h' line='432' column='1' id='type-id-116'/>
    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='435' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='256' id='type-id-175'>
      <subrange length='32' type-id='type-id-13' id='type-id-176'/>

    </array-type-def>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-174' filepath='src/include/efivar/efivar-dp.h' line='439' column='1' id='type-id-117'/>
    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='456' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='32' id='type-id-178'>
      <subrange length='4' type-id='type-id-13' id='type-id-180'/>

    </array-type-def>
    <typedef-decl name='efidp_boolean' type-id='type-id-28' filepath='src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-179'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-177' filepath='src/include/efivar/efivar-dp.h' line='457' column='1' id='type-id-118'/>
    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='128' id='type-id-182'>
      <subrange length='16' type-id='type-id-13' id='type-id-183'/>

    </array-type-def>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-181' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-119'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_vlan' type-id='type-id-184' filepath='src/include/efivar/efivar-dp.h' line='489' column='1' id='type-id-120'/>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-186' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='128' id='type-id-186'>
      <subrange length='2' type-id='type-id-13' id='type-id-188'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1' id='type-id-187'>
      <data-member access='private'>
        <var-decl name='ioc_guid' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='497' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='service_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='498' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efidp_infiniband' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='502' column='1' id='type-id-121'/>
    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='517' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart' type-id='type-id-189' filepath='src/include/efivar/efivar-dp.h' line='518' column='1' id='type-id-122'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='542' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='546' column='1' id='type-id-123'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='555' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-191' filepath='src/include/efivar/efivar-dp.h' line='559' column='1' id='type-id-124'/>
    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='574' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='575' column='1' id='type-id-125'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-193' filepath='src/include/efivar/efivar-dp.h' line='606' column='1' id='type-id-126'/>
    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='618' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_iscsi' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='619' column='1' id='type-id-127'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvme' type-id='type-id-195' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-128'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uri' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-129'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ufs' type-id='type-id-197' filepath='src/include/efivar/efivar-dp.h' line='666' column='1' id='type-id-130'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='669' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sd' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='672' column='1' id='type-id-131'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='675' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bt' type-id='type-id-199' filepath='src/include/efivar/efivar-dp.h' line='678' column='1' id='type-id-132'/>
    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='681' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_wifi' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='684' column='1' id='type-id-133'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='689' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_emmc' type-id='type-id-201' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-134'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='696' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_btle' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='697' column='1' id='type-id-135'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='706' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar.h' line='49' column='1' id='type-id-205'>
      <data-member access='private'>
        <var-decl name='addr' type-id='type-id-206' visibility='default' filepath='src/include/efivar/efivar.h' line='50' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v4' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar.h' line='51' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v6' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar.h' line='52' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-206'>
      <subrange length='4' type-id='type-id-13' id='type-id-180'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar.h' line='41' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-209' filepath='src/include/efivar/efivar.h' line='43' column='1' id='type-id-207'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar.h' line='45' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-210' filepath='src/include/efivar/efivar.h' line='47' column='1' id='type-id-208'/>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-205' filepath='src/include/efivar/efivar.h' line='53' column='1' id='type-id-211'/>

    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='128' id='type-id-204'>
      <subrange length='1' type-id='type-id-13' id='type-id-76'/>

    </array-type-def>
    <typedef-decl name='efidp_dns' type-id='type-id-203' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-136'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='712' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='713' column='1' id='type-id-137'/>
    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hd' type-id='type-id-213' filepath='src/include/efivar/efivar-dp.h' line='729' column='1' id='type-id-138'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='747' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_cdrom' type-id='type-id-214' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-139'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='754' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='755' column='1' id='type-id-140'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_file' type-id='type-id-216' filepath='src/include/efivar/efivar-dp.h' line='765' column='1' id='type-id-141'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='771' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_protocol' type-id='type-id-217' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-142'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='777' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-218' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-143'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='783' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-219' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-144'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='791' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-220' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-145'/>
    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='800' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-221' filepath='src/include/efivar/efivar-dp.h' line='801' column='1' id='type-id-146'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='818' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-222' filepath='src/include/efivar/efivar-dp.h' line='819' column='1' id='type-id-147'/>
    <typedef-decl name='efidp_data' type-id='type-id-94' filepath='src/include/efivar/efivar-dp.h' line='891' column='1' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-224'/>
    <typedef-decl name='efidp' type-id='type-id-224' filepath='src/include/efivar/efivar-dp.h' line='892' column='1' id='type-id-225'/>
    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-46' name='path'/>
      <parameter type-id='type-id-225' name='out'/>
      <parameter type-id='type-id-33' name='size'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0'>
      <parameter type-id='type-id-46' name='path'/>
      <parameter type-id='type-id-225' name='out'/>
      <parameter type-id='type-id-33' name='size'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-227'/>
    <typedef-decl name='const_efidp' type-id='type-id-227' filepath='src/include/efivar/efivar-dp.h' line='893' column='1' id='type-id-228'/>
    <function-decl name='efidp_format_device_path' mangled-name='efidp_format_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-46' name='buf'/>
      <parameter type-id='type-id-33' name='size'/>
      <parameter type-id='type-id-228' name='dp'/>
      <parameter type-id='type-id-61' name='limit'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-229'/>
    <function-decl name='efidp_append_instance' mangled-name='efidp_append_instance' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_instance@@libefivar.so.0'>
      <parameter type-id='type-id-228' name='dp'/>
      <parameter type-id='type-id-228' name='dpi'/>
      <parameter type-id='type-id-229' name='out'/>
      <parameter type-id='type-id-228' name='dp'/>
      <parameter type-id='type-id-228' name='dpi'/>
      <parameter type-id='type-id-229' name='out'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efidp_append_node' mangled-name='efidp_append_node' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_node@@libefivar.so.0'>
      <parameter type-id='type-id-228' name='dp'/>
      <parameter type-id='type-id-228' name='dn'/>
      <parameter type-id='type-id-229' name='out'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efidp_append_path' mangled-name='efidp_append_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_path@@libefivar.so.0'>
      <parameter type-id='type-id-228' name='dp0'/>
      <parameter type-id='type-id-228' name='dp1'/>
      <parameter type-id='type-id-229' name='out'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='efidp_duplicate_path' mangled-name='efidp_duplicate_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_duplicate_path@@libefivar.so.0'>
