<abi-corpus version='2.4' path='libefivar.so' architecture='elf-amd-x86_64' soname='libefivar.so.1'>
  <elf-needed>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_efi_set_variable' version='libefivar.so.0' is-default-version='no' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_efi_set_variable_variadic' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_append_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_chmod_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_del_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_error_clear' version='LIBEFIVAR_1.30' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='mktime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='open64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='openat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='opendir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='printf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='puts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='readdir64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sched_yield' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='secure_getenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='setenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='snprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='statfs64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcasestr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strftime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strptime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='tzset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='umask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unsetenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='usleep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vasprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__timezone' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='timezone' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='dp-acpi.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-2'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-5'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-6'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-7'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-16' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-8' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-24'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-25' filepath='/usr/include/bits/types/struct_FILE.h' line='45' column='1' id='type-id-26'/>
    <typedef-decl name='__off64_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='153' column='1' hash='b119fe0931d2ee10' id='type-id-16'/>
    <typedef-decl name='__off_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-13'/>
    <typedef-decl name='ssize_t' type-id='type-id-28' size-in-bits='64' filepath='/usr/include/stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='type-id-29'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-30'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' hash='e8c018048121152c' id='type-id-20'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-31'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-18'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-34'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-35'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-36'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-37'/>
    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' filepath='src/dp-acpi.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0' hash='f5a2a9c0c61e24a4'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-acpi.c' line='275' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-acpi.c' line='275' column='1'/>
      <parameter type-id='type-id-39' name='hid' filepath='src/dp-acpi.c' line='275' column='1'/>
      <parameter type-id='type-id-39' name='uid' filepath='src/dp-acpi.c' line='275' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' filepath='src/dp-acpi.c' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0' hash='4281f7728a24ab46'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-acpi.c' line='295' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-acpi.c' line='295' column='1'/>
      <parameter type-id='type-id-39' name='hid' filepath='src/dp-acpi.c' line='296' column='1'/>
      <parameter type-id='type-id-39' name='uid' filepath='src/dp-acpi.c' line='296' column='1'/>
      <parameter type-id='type-id-39' name='cid' filepath='src/dp-acpi.c' line='296' column='1'/>
      <parameter type-id='type-id-40' name='hidstr' filepath='src/dp-acpi.c' line='297' column='1'/>
      <parameter type-id='type-id-40' name='uidstr' filepath='src/dp-acpi.c' line='297' column='1'/>
      <parameter type-id='type-id-40' name='cidstr' filepath='src/dp-acpi.c' line='298' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-37' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-32'/>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir' hash='388da3fa973fde78'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf' hash='31c19dfde3fac410'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-40'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf' hash='c4bcbce131b4d300'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf' hash='9e970561a213ee08'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-40'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='d2c49d83b30fb50c'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen' hash='e62a7a46b2904b02'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-42'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-hw.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-43'/>
    <qualified-type-def type-id='type-id-44' const='yes' hash='5ea91808138567e1' id='type-id-45'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' hash='d809134072fc3264' id='type-id-46'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-25'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-49'/>
    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' filepath='src/dp-hw.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0' hash='b73f76c73cec0ebf'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-hw.c' line='80' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-hw.c' line='80' column='1'/>
      <parameter type-id='type-id-50' name='device' filepath='src/dp-hw.c' line='80' column='1'/>
      <parameter type-id='type-id-50' name='function' filepath='src/dp-hw.c' line='80' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' filepath='src/dp-hw.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0' hash='07eca923f855f911'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-hw.c' line='99' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-hw.c' line='99' column='1'/>
      <parameter type-id='type-id-39' name='hardware_device' filepath='src/dp-hw.c' line='99' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-49' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-47'/>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-media.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-25'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-53'/>
    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' filepath='src/dp-media.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0' hash='3ce455c27a41063c'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-media.c' line='153' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-media.c' line='153' column='1'/>
      <parameter type-id='type-id-10' name='filepath' filepath='src/dp-media.c' line='153' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' filepath='src/dp-media.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0' hash='6522f79156f34f09'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-media.c' line='181' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-media.c' line='181' column='1'/>
      <parameter type-id='type-id-39' name='num' filepath='src/dp-media.c' line='181' column='1'/>
      <parameter type-id='type-id-54' name='part_start' filepath='src/dp-media.c' line='181' column='1'/>
      <parameter type-id='type-id-54' name='part_size' filepath='src/dp-media.c' line='182' column='1'/>
      <parameter type-id='type-id-38' name='signature' filepath='src/dp-media.c' line='182' column='1'/>
      <parameter type-id='type-id-50' name='format' filepath='src/dp-media.c' line='182' column='1'/>
      <parameter type-id='type-id-50' name='signature_type' filepath='src/dp-media.c' line='183' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-53' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-51'/>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-message.c' comp-dir-path='src' language='LANG_C11'>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='type-id-55'/>
    <typedef-decl name='__int16_t' type-id='type-id-55' size-in-bits='16' filepath='/usr/include/bits/types.h' line='39' column='1' hash='6c2352eccdcd3eea' id='type-id-56'/>
    <typedef-decl name='int16_t' type-id='type-id-56' size-in-bits='16' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' hash='6c2352eccdcd3eea' id='type-id-57'/>
    <qualified-type-def type-id='type-id-50' const='yes' hash='5a6582fbecdbfc78' id='type-id-58'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='d2a42ec7d4838233' id='type-id-59'/>
    <qualified-type-def type-id='type-id-59' const='yes' hash='5211ca787f6a625f' id='type-id-60'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='c6942bb633dc77f9' id='type-id-61'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-64'/>
    <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' filepath='src/dp-message.c' line='658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr@@libefivar.so.0' hash='64bda095715de9e4'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='658' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='658' column='1'/>
      <parameter type-id='type-id-50' name='if_type' filepath='src/dp-message.c' line='658' column='1'/>
      <parameter type-id='type-id-60' name='mac_addr' filepath='src/dp-message.c' line='659' column='1'/>
      <parameter type-id='type-id-29' name='mac_addr_size' filepath='src/dp-message.c' line='659' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='src/dp-message.c' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0' hash='03e6b2de327a64a6'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='679' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='679' column='1'/>
      <parameter type-id='type-id-39' name='local' filepath='src/dp-message.c' line='679' column='1'/>
      <parameter type-id='type-id-39' name='remote' filepath='src/dp-message.c' line='679' column='1'/>
      <parameter type-id='type-id-39' name='gateway' filepath='src/dp-message.c' line='680' column='1'/>
      <parameter type-id='type-id-39' name='netmask' filepath='src/dp-message.c' line='680' column='1'/>
      <parameter type-id='type-id-65' name='local_port' filepath='src/dp-message.c' line='681' column='1'/>
      <parameter type-id='type-id-65' name='remote_port' filepath='src/dp-message.c' line='681' column='1'/>
      <parameter type-id='type-id-65' name='protocol' filepath='src/dp-message.c' line='682' column='1'/>
      <parameter type-id='type-id-9' name='is_static' filepath='src/dp-message.c' line='682' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='src/dp-message.c' line='708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0' hash='7050a255ca14152e'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='708' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='708' column='1'/>
      <parameter type-id='type-id-65' name='target' filepath='src/dp-message.c' line='708' column='1'/>
      <parameter type-id='type-id-65' name='lun' filepath='src/dp-message.c' line='708' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='src/dp-message.c' line='726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0' hash='d9a2c0e27704fe63'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='726' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='726' column='1'/>
      <parameter type-id='type-id-39' name='namespace_id' filepath='src/dp-message.c' line='726' column='1'/>
      <parameter type-id='type-id-38' name='ieee_eui_64' filepath='src/dp-message.c' line='727' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='src/dp-message.c' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0' hash='6218a14b01b1ebaf'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='752' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='752' column='1'/>
      <parameter type-id='type-id-65' name='hba_port' filepath='src/dp-message.c' line='752' column='1'/>
      <parameter type-id='type-id-57' name='port_multiplier_port' filepath='src/dp-message.c' line='753' column='1'/>
      <parameter type-id='type-id-65' name='lun' filepath='src/dp-message.c' line='753' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='src/dp-message.c' line='774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0' hash='8d0fa82e7b25b51b'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='774' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='774' column='1'/>
      <parameter type-id='type-id-65' name='primary' filepath='src/dp-message.c' line='774' column='1'/>
      <parameter type-id='type-id-65' name='slave' filepath='src/dp-message.c' line='775' column='1'/>
      <parameter type-id='type-id-65' name='lun' filepath='src/dp-message.c' line='775' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='src/dp-message.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0' hash='b5a3c136924ec33c'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='797' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='797' column='1'/>
      <parameter type-id='type-id-54' name='sas_address' filepath='src/dp-message.c' line='797' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='src/dp-message.c' line='822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33' hash='a569643fc7cb3129'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-message.c' line='822' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-message.c' line='822' column='1'/>
      <parameter type-id='type-id-61' name='uuid' filepath='src/dp-message.c' line='822' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_emmc' mangled-name='efidp_make_emmc' filepath='src/dp-message.c' line='841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc@@libefivar.so.0' hash='07eca923f855f911'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp-hw.c' line='99' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp-hw.c' line='99' column='1'/>
      <parameter type-id='type-id-39' name='hardware_device' filepath='src/dp-hw.c' line='99' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-64' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-62'/>
  </abi-instr>
  <abi-instr address-size='64' path='dp.c' comp-dir-path='src' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='unknown' hash='6915b710ae33e54a' id='type-id-66'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='unknown' hash='19a7bd76e4562e22' id='type-id-69'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-67'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-9'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-27'/>
    <class-decl name='efi_guid_t' is-struct='yes' naming-typedef-id='type-id-44' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='17' column='1' hash='499ca0d1cb6501b7' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_ipv4_addr_t' is-struct='yes' naming-typedef-id='type-id-72' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='35' column='1' hash='06e09f2ac003723c' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_ipv6_addr_t' is-struct='yes' naming-typedef-id='type-id-75' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='39' column='1' hash='ce461c0a8c6878a7' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_1394' is-struct='yes' naming-typedef-id='type-id-78' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' hash='8544afd2aafea6c4' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_adr' is-struct='yes' naming-typedef-id='type-id-81' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' hash='75d0e8e62717b42b' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-83' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid' is-struct='yes' naming-typedef-id='type-id-84' visibility='default' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' hash='f05a5786606cbb01' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid_ex' is-struct='yes' naming-typedef-id='type-id-86' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' hash='29b2990c41a9b4f0' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_atapi' is-struct='yes' naming-typedef-id='type-id-88' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' hash='d9b48e4e9e80de96' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bios_boot' is-struct='yes' naming-typedef-id='type-id-90' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' hash='9b20103dc7a182eb' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bmc' is-struct='yes' naming-typedef-id='type-id-93' visibility='default' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' hash='943de8cd84cab34c' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bt' is-struct='yes' naming-typedef-id='type-id-95' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' hash='3d8ecae31af49d99' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_btle' is-struct='yes' naming-typedef-id='type-id-97' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' hash='52eaff9ff963af14' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_cdrom' is-struct='yes' naming-typedef-id='type-id-99' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' hash='2ac237d180dcc5c5' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_controller' is-struct='yes' naming-typedef-id='type-id-101' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' hash='cf9515f165aacac4' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_dns' is-struct='yes' naming-typedef-id='type-id-103' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' hash='d81b45e96bb460cd' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_emmc' is-struct='yes' naming-typedef-id='type-id-105' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' hash='064ef1691332f3bc' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fc' is-struct='yes' naming-typedef-id='type-id-107' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' hash='ced686a5243015d8' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fcex' is-struct='yes' naming-typedef-id='type-id-109' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' hash='fdd9f398457280d4' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_file' is-struct='yes' naming-typedef-id='type-id-112' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' hash='2a58d2bcdef661c1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_file' is-struct='yes' naming-typedef-id='type-id-115' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' hash='740a52927612a4c5' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_volume' is-struct='yes' naming-typedef-id='type-id-117' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' hash='b6940d9eaecb7302' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hd' is-struct='yes' naming-typedef-id='type-id-119' visibility='default' size-in-bits='336' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' hash='500adc973b4f83f2' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_header' is-struct='yes' naming-typedef-id='type-id-80' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' hash='8bed7d4ae6a96e19' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hw_vendor' is-struct='yes' naming-typedef-id='type-id-122' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' hash='62254feea29f4446' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_i2o' is-struct='yes' naming-typedef-id='type-id-124' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' hash='ab016445bf7b0a85' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_infiniband' is-struct='yes' naming-typedef-id='type-id-126' visibility='default' size-in-bits='384' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' hash='7a7174f779eb6615' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv4_addr' is-struct='yes' naming-typedef-id='type-id-130' visibility='default' size-in-bits='216' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' hash='6553af3521986270' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv6_addr' is-struct='yes' naming-typedef-id='type-id-133' visibility='default' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' hash='02c8d2b93351d381' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_iscsi' is-struct='yes' naming-typedef-id='type-id-135' visibility='default' size-in-bits='144' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' hash='8c2211be2f136161' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_lun' is-struct='yes' naming-typedef-id='type-id-137' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' hash='e54cf8b0a6f0bab5' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mac_addr' is-struct='yes' naming-typedef-id='type-id-139' visibility='default' size-in-bits='296' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' hash='fa351eabfeb13867' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_media_vendor' is-struct='yes' naming-typedef-id='type-id-142' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' hash='d30ec0e0233a9e6a' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mmio' is-struct='yes' naming-typedef-id='type-id-144' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' hash='5d1130b2b90fd17a' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_msg_vendor' is-struct='yes' naming-typedef-id='type-id-146' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' hash='3d3d09ed7bdcfc6c' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvdimm' is-struct='yes' naming-typedef-id='type-id-148' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' hash='f68f8a8ba35971ac' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvme' is-struct='yes' naming-typedef-id='type-id-150' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' hash='7266005b40c2b239' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='645' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pccard' is-struct='yes' naming-typedef-id='type-id-152' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' hash='76864c2dbba27f52' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pci' is-struct='yes' naming-typedef-id='type-id-154' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' hash='bf4270d0b234e04c' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_protocol' is-struct='yes' naming-typedef-id='type-id-156' visibility='default' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' hash='0e9283dad46f6b4d' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ramdisk' is-struct='yes' naming-typedef-id='type-id-158' visibility='default' size-in-bits='304' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' hash='915026c28973b548' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_relative_offset' is-struct='yes' naming-typedef-id='type-id-160' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' hash='86db1d650c6b12a5' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas' is-struct='yes' naming-typedef-id='type-id-162' visibility='default' size-in-bits='352' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' hash='a7ddda3ae9ac9409' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas_ex' is-struct='yes' naming-typedef-id='type-id-164' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' hash='b7dbda6eb2aaf21a' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sata' is-struct='yes' naming-typedef-id='type-id-166' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' hash='4e06f84c3eccdf80' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_scsi' is-struct='yes' naming-typedef-id='type-id-168' visibility='default' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' hash='a57bbdd0ad8cce62' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sd' is-struct='yes' naming-typedef-id='type-id-170' visibility='default' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' hash='c5b3811e3ec32dd9' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart' is-struct='yes' naming-typedef-id='type-id-172' visibility='default' size-in-bits='152' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' hash='0443805f2b07cf8e' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart_flow_control' is-struct='yes' naming-typedef-id='type-id-174' visibility='default' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' hash='bddccc1608b5a3af' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='553' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ufs' is-struct='yes' naming-typedef-id='type-id-176' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' hash='e481220be92dac0d' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uri' is-struct='yes' naming-typedef-id='type-id-178' visibility='default' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' hash='a1f6bf871f5656f3' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb' is-struct='yes' naming-typedef-id='type-id-180' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' hash='69ba10b704e1d6fa' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_class' is-struct='yes' naming-typedef-id='type-id-182' visibility='default' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' hash='04d52521607f7783' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_wwid' is-struct='yes' naming-typedef-id='type-id-184' visibility='default' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' hash='7b7cd9f4d8ad2c99' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_vlan' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' hash='627f0a8e48e4c38d' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_wifi' is-struct='yes' naming-typedef-id='type-id-188' visibility='default' size-in-bits='288' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' hash='655741e75268fa66' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' hash='91ff375fdb83a6da' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-28'/>
    <typedef-decl name='__uint16_t' type-id='type-id-14' size-in-bits='16' filepath='/usr/include/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-191'/>
    <typedef-decl name='__uint32_t' type-id='type-id-23' size-in-bits='32' filepath='/usr/include/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-192'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-21'/>
    <typedef-decl name='__uint8_t' type-id='type-id-193' size-in-bits='8' filepath='/usr/include/bits/types.h' line='38' column='1' hash='6ebac62b3366db68' id='type-id-194'/>
    <typedef-decl name='const_efidp' type-id='type-id-195' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' hash='8183b12658ab99b1' id='type-id-196'/>
    <typedef-decl name='efi_guid_t' type-id='type-id-70' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-44'/>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-197' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-68'/>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-73' size-in-bits='32' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-72'/>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-76' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-75'/>
    <typedef-decl name='efidp' type-id='type-id-198' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' hash='de702e35ca2a7687' id='type-id-199'/>
    <typedef-decl name='efidp_1394' type-id='type-id-79' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-78'/>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-82' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-81'/>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-85' size-in-bits='96' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-84'/>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-87' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-86'/>
    <typedef-decl name='efidp_atapi' type-id='type-id-89' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-88'/>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-91' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-90'/>
    <typedef-decl name='efidp_bmc' type-id='type-id-94' size-in-bits='104' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-93'/>
    <typedef-decl name='efidp_boolean' type-id='type-id-50' size-in-bits='8' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' hash='6ebac62b3366db68' id='type-id-132'/>
    <typedef-decl name='efidp_bt' type-id='type-id-96' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-95'/>
    <typedef-decl name='efidp_btle' type-id='type-id-98' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-97'/>
    <typedef-decl name='efidp_cdrom' type-id='type-id-100' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-99'/>
    <typedef-decl name='efidp_controller' type-id='type-id-102' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-101'/>
    <typedef-decl name='efidp_data' type-id='type-id-200' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-201'/>
    <typedef-decl name='efidp_dns' type-id='type-id-104' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-103'/>
    <typedef-decl name='efidp_emmc' type-id='type-id-106' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-105'/>
    <typedef-decl name='efidp_fc' type-id='type-id-108' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-107'/>
    <typedef-decl name='efidp_fcex' type-id='type-id-110' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-109'/>
    <typedef-decl name='efidp_file' type-id='type-id-113' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-112'/>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-116' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-115'/>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-118' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-117'/>
    <typedef-decl name='efidp_hd' type-id='type-id-120' size-in-bits='336' filepath='src/include/efivar/efivar-dp.h' line='726' column='1' id='type-id-119'/>
    <typedef-decl name='efidp_header' type-id='type-id-121' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-80'/>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-123' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-122'/>
    <typedef-decl name='efidp_i2o' type-id='type-id-125' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-124'/>
    <typedef-decl name='efidp_infiniband' type-id='type-id-127' size-in-bits='384' filepath='src/include/efivar/efivar-dp.h' line='497' column='1' id='type-id-126'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-131' size-in-bits='216' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-130'/>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-134' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-133'/>
    <typedef-decl name='efidp_iscsi' type-id='type-id-136' size-in-bits='144' filepath='src/include/efivar/efivar-dp.h' line='614' column='1' id='type-id-135'/>
    <typedef-decl name='efidp_lun' type-id='type-id-138' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-137'/>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-140' size-in-bits='296' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-139'/>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-143' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='752' column='1' id='type-id-142'/>
    <typedef-decl name='efidp_mmio' type-id='type-id-145' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-144'/>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-147' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='541' column='1' id='type-id-146'/>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-149' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-148'/>
    <typedef-decl name='efidp_nvme' type-id='type-id-151' size-in-bits='128' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-150'/>
    <typedef-decl name='efidp_pccard' type-id='type-id-153' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-152'/>
    <typedef-decl name='efidp_pci' type-id='type-id-155' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-154'/>
    <typedef-decl name='efidp_protocol' type-id='type-id-157' size-in-bits='160' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-156'/>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-159' size-in-bits='304' filepath='src/include/efivar/efivar-dp.h' line='798' column='1' id='type-id-158'/>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-161' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-160'/>
    <typedef-decl name='efidp_sas' type-id='type-id-163' size-in-bits='352' filepath='src/include/efivar/efivar-dp.h' line='570' column='1' id='type-id-162'/>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-165' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='601' column='1' id='type-id-164'/>
    <typedef-decl name='efidp_sata' type-id='type-id-167' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-166'/>
    <typedef-decl name='efidp_scsi' type-id='type-id-169' size-in-bits='64' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-168'/>
    <typedef-decl name='efidp_sd' type-id='type-id-171' size-in-bits='40' filepath='src/include/efivar/efivar-dp.h' line='667' column='1' id='type-id-170'/>
    <typedef-decl name='efidp_uart' type-id='type-id-173' size-in-bits='152' filepath='src/include/efivar/efivar-dp.h' line='513' column='1' id='type-id-172'/>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-175' size-in-bits='192' filepath='src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-174'/>
    <typedef-decl name='efidp_ufs' type-id='type-id-177' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-176'/>
    <typedef-decl name='efidp_uri' type-id='type-id-179' size-in-bits='32' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-178'/>
    <typedef-decl name='efidp_usb' type-id='type-id-181' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-180'/>
    <typedef-decl name='efidp_usb_class' type-id='type-id-183' size-in-bits='88' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-182'/>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-185' size-in-bits='80' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-184'/>
    <typedef-decl name='efidp_vlan' type-id='type-id-187' size-in-bits='48' filepath='src/include/efivar/efivar-dp.h' line='484' column='1' id='type-id-186'/>
    <typedef-decl name='efidp_wifi' type-id='type-id-189' size-in-bits='288' filepath='src/include/efivar/efivar-dp.h' line='679' column='1' id='type-id-188'/>
    <typedef-decl name='size_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-42'/>
    <typedef-decl name='uint16_t' type-id='type-id-191' size-in-bits='16' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-65'/>
    <typedef-decl name='uint32_t' type-id='type-id-192' size-in-bits='32' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-39'/>
    <typedef-decl name='uint64_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-54'/>
    <typedef-decl name='uint8_t' type-id='type-id-194' size-in-bits='8' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='type-id-50'/>
    <array-type-def dimensions='1' type-id='type-id-65' size-in-bits='unknown' hash='8995f724b5995f66' id='type-id-114'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='128' hash='54581fe115faa565' id='type-id-202'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-203'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='unknown' hash='d71ea9da2a27c259' id='type-id-83'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='128' hash='cedf16acf4bd1010' id='type-id-128'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-204'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='type-id-77'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-205'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='256' hash='037c09e5626cce93' id='type-id-141'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-206'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='32' hash='7df313b77e5f7cf4' id='type-id-74'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-203'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='48' hash='b6435304905fc8f6' id='type-id-71'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-207'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='64' hash='24c833a0e6bde8ce' id='type-id-111'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='unknown' hash='953f9801eb087566' id='type-id-92'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-67'/>
    </array-type-def>
    <union-decl name='efi_ip_addr_t' naming-typedef-id='type-id-68' visibility='default' size-in-bits='128' filepath='src/include/efivar/efivar-types.h' line='43' column='1' hash='dff3fd51392f9298' id='type-id-197'>
      <data-member access='public'>
        <var-decl name='addr' type-id='type-id-202' visibility='default' filepath='src/include/efivar/efivar-types.h' line='44' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v4' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-types.h' line='45' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v6' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='46' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='efidp_data' naming-typedef-id='type-id-201' visibility='default' size-in-bits='480' filepath='src/include/efivar/efivar-dp.h' line='830' column='1' hash='13b976cb49d0c85b' id='type-id-200'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-190' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='header' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pci' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pccard' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mmio' type-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hw_vendor' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='controller' type-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bmc' type-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid' type-id='type-id-84' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid_ex' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_adr' type-id='type-id-81' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='atapi' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scsi' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fc' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fcex' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firewire' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb' type-id='type-id-180' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_class' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_wwid' type-id='type-id-184' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='lun' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sata' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i2o' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mac_addr' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv4_addr' type-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv6_addr' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='vlan' type-id='type-id-186' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='infiniband' type-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart' type-id='type-id-172' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='msg_vendor' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart_flow_control' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas_ex' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='iscsi' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uri' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ufs' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sd' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bt' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='wifi' type-id='type-id-188' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='emmc' type-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='btle' type-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dns' type-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvdimm' type-id='type-id-148' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hd' type-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdrom' type-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='media_vendor' type-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='protocol' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_file' type-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_volume' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='relative_offset' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ramdisk' type-id='type-id-158' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bios_boot' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='src/include/efivar/efivar-dp.h' line='491' column='1' hash='0d901b21ae545901' id='type-id-129'>
      <data-member access='public'>
        <var-decl name='ioc_guid' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='service_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-193'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-23'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='type-id-14'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-10'/>
    <qualified-type-def type-id='type-id-1' const='yes' hash='3e50fd33f9bb78d9' id='type-id-208'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='c44743f354f6a443' id='type-id-40'/>
    <qualified-type-def type-id='type-id-201' const='yes' hash='6a235f390cae8715' id='type-id-209'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' hash='8183b12658ab99b1' id='type-id-195'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' hash='28e0b481a3d80c7d' id='type-id-210'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='de702e35ca2a7687' id='type-id-198'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-41'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' hash='24d8cca8965ce13e' id='type-id-38'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' hash='f0221758ecf0c0cb' id='type-id-211'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-214'/>
    <function-decl name='efidp_set_node_data' mangled-name='efidp_set_node_data' filepath='src/dp.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_set_node_data@@libefivar.so.0' hash='6de9a4bd46ff70b0'>
      <parameter type-id='type-id-196' name='dn' filepath='src/dp.c' line='33' column='1'/>
      <parameter type-id='type-id-19' name='buf' filepath='src/dp.c' line='33' column='1'/>
      <parameter type-id='type-id-42' name='bufsize' filepath='src/dp.c' line='33' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_duplicate_path' mangled-name='efidp_duplicate_path' filepath='src/dp.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_duplicate_path@@libefivar.so.0' hash='1cf4d83ba5e66981'>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='87' column='1'/>
      <parameter type-id='type-id-210' name='out' filepath='src/dp.c' line='87' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_append_path' mangled-name='efidp_append_path' filepath='src/dp.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_path@@libefivar.so.0' hash='ba948d10275faa66'>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='245' column='1'/>
      <parameter type-id='type-id-196' name='dpi' filepath='src/dp.c' line='245' column='1'/>
      <parameter type-id='type-id-210' name='out' filepath='src/dp.c' line='245' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_append_node' mangled-name='efidp_append_node' filepath='src/dp.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_node@@libefivar.so.0' hash='ba948d10275faa66'>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='245' column='1'/>
      <parameter type-id='type-id-196' name='dpi' filepath='src/dp.c' line='245' column='1'/>
      <parameter type-id='type-id-210' name='out' filepath='src/dp.c' line='245' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_append_instance' mangled-name='efidp_append_instance' filepath='src/dp.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_instance@@libefivar.so.0' hash='ba948d10275faa66'>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='245' column='1'/>
      <parameter type-id='type-id-196' name='dpi' filepath='src/dp.c' line='245' column='1'/>
      <parameter type-id='type-id-210' name='out' filepath='src/dp.c' line='245' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_format_device_path' mangled-name='efidp_format_device_path' filepath='src/dp.c' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path@@libefivar.so.0' hash='432553564090deee'>
      <parameter type-id='type-id-211' name='buf' filepath='src/dp.c' line='292' column='1'/>
      <parameter type-id='type-id-42' name='size' filepath='src/dp.c' line='292' column='1'/>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='292' column='1'/>
      <parameter type-id='type-id-29' name='limit' filepath='src/dp.c' line='293' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' filepath='src/dp.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0' hash='0a861b912613eced'>
      <parameter type-id='type-id-211' name='path' filepath='src/dp.c' line='413' column='1'/>
      <parameter type-id='type-id-199' name='out' filepath='src/dp.c' line='413' column='1'/>
      <parameter type-id='type-id-42' name='size' filepath='src/dp.c' line='414' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' filepath='src/dp.c' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0' hash='0a861b912613eced'>
      <parameter type-id='type-id-211' name='path' filepath='src/dp.c' line='413' column='1'/>
      <parameter type-id='type-id-199' name='out' filepath='src/dp.c' line='413' column='1'/>
      <parameter type-id='type-id-42' name='size' filepath='src/dp.c' line='414' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' filepath='src/dp.c' line='422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0' hash='08378e124bccaaf7'>
      <parameter type-id='type-id-38' name='buf' filepath='src/dp.c' line='422' column='1'/>
      <parameter type-id='type-id-29' name='size' filepath='src/dp.c' line='422' column='1'/>
      <parameter type-id='type-id-50' name='type' filepath='src/dp.c' line='422' column='1'/>
      <parameter type-id='type-id-50' name='subtype' filepath='src/dp.c' line='422' column='1'/>
      <parameter type-id='type-id-44' name='vendor_guid' filepath='src/dp.c' line='423' column='1'/>
      <parameter type-id='type-id-19' name='data' filepath='src/dp.c' line='423' column='1'/>
      <parameter type-id='type-id-42' name='data_size' filepath='src/dp.c' line='423' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' filepath='src/dp.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0' hash='b506cd9ed266061a'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-214' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-212'/>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc' hash='91495cdf6321a116'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-215'/>
    <type-decl name='void' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' id='type-id-19'/>
  </abi-instr>
  <abi-instr address-size='64' path='efivarfs.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-216' size-in-bits='256' hash='70feeb2888d73911' id='type-id-217'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-203'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-218' size-in-bits='192' hash='9904ddbe9e0e1da6' id='type-id-219'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-220'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-221'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-222'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='64' hash='8198620b8b558cae' id='type-id-223'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-204'/>
    </array-type-def>
    <class-decl name='__fsid_t' is-struct='yes' naming-typedef-id='type-id-224' visibility='default' size-in-bits='64' filepath='/usr/include/bits/types.h' line='155' column='1' hash='7524a6eddcff342d' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-223' visibility='default' filepath='/usr/include/bits/types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='/usr/include/bits/dirent.h' line='22' column='1' hash='f8f1acd4a88a2190' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-227' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-16' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-193' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-221' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' hash='4f24305487cf2e09' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-229' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-230' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-231' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-232' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-233' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-234' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-229' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-235' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-236' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-237' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-237' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-237' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-219' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='statfs' is-struct='yes' visibility='default' size-in-bits='960' filepath='/usr/include/bits/statfs.h' line='24' column='1' hash='e1c77b364b6de89f' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_type' type-id='type-id-216' visibility='default' filepath='/usr/include/bits/statfs.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_bsize' type-id='type-id-216' visibility='default' filepath='/usr/include/bits/statfs.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-239' visibility='default' filepath='/usr/include/bits/statfs.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-239' visibility='default' filepath='/usr/include/bits/statfs.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-239' visibility='default' filepath='/usr/include/bits/statfs.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-240' visibility='default' filepath='/usr/include/bits/statfs.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-240' visibility='default' filepath='/usr/include/bits/statfs.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_fsid' type-id='type-id-224' visibility='default' filepath='/usr/include/bits/statfs.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_namelen' type-id='type-id-216' visibility='default' filepath='/usr/include/bits/statfs.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_frsize' type-id='type-id-216' visibility='default' filepath='/usr/include/bits/statfs.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_flags' type-id='type-id-216' visibility='default' filepath='/usr/include/bits/statfs.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_spare' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/statfs.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-241' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-218' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__blkcnt_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-236'/>
    <typedef-decl name='__blksize_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-235'/>
    <typedef-decl name='__dev_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-229'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='185' column='1' hash='8fdc5eea2983a729' id='type-id-239'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='189' column='1' hash='8fdc5eea2983a729' id='type-id-240'/>
    <typedef-decl name='__fsid_t' type-id='type-id-225' size-in-bits='64' filepath='/usr/include/bits/types.h' line='155' column='1' id='type-id-224'/>
    <typedef-decl name='__fsword_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='192' column='1' hash='b119fe0931d2ee10' id='type-id-216'/>
    <typedef-decl name='__gid_t' type-id='type-id-23' size-in-bits='32' filepath='/usr/include/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-234'/>
    <typedef-decl name='__ino64_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='149' column='1' hash='8fdc5eea2983a729' id='type-id-227'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='148' column='1' hash='8fdc5eea2983a729' id='type-id-230'/>
    <typedef-decl name='__mode_t' type-id='type-id-23' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-232'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' size-in-bits='64' filepath='/usr/include/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-231'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-218'/>
    <typedef-decl name='__time_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-241'/>
    <typedef-decl name='__uid_t' type-id='type-id-23' size-in-bits='32' filepath='/usr/include/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-233'/>
    <typedef-decl name='__useconds_t' type-id='type-id-23' size-in-bits='32' filepath='/usr/include/bits/types.h' line='161' column='1' hash='e66b43f97c38e87a' id='type-id-242'/>
    <qualified-type-def type-id='type-id-30' restrict='yes' hash='6a2cf982d0fba87f' id='type-id-243'/>
    <qualified-type-def type-id='type-id-43' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-244'/>
    <qualified-type-def type-id='type-id-40' restrict='yes' hash='b7d5472019e79b5f' id='type-id-245'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' hash='1ce54f87b39780f9' id='type-id-246'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-247'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' hash='925ad1338878bb49' id='type-id-248'/>
    <qualified-type-def type-id='type-id-248' restrict='yes' hash='625d51349de39d13' id='type-id-249'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' hash='63a544ae1a0b8260' id='type-id-250'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='a285db8f38e4ea02' id='type-id-251'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' hash='5c14970df355af8b' id='type-id-252'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-255'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-256'/>
    <class-decl name='efi_var_operations' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='src/lib.h' line='26' column='1' id='type-id-257'/>
    <typedef-decl name='DIR' type-id='type-id-255' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-253'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-254'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64' hash='8210c868a3f56bcd'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-246'/>
    </function-decl>
    <function-decl name='dirfd' filepath='/usr/include/dirent.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dirfd' hash='388da3fa973fde78'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='err' filepath='/usr/include/err.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='err' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-40'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fcntl' mangled-name='fcntl64' filepath='/usr/include/fcntl.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fcntl64' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64' hash='1d81aff51c388187'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-9'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield' hash='388da3fa973fde78'>
      <return type-id='type-id-9'/>
    </function-decl>
    <var-decl name='stderr' type-id='type-id-30' visibility='default' filepath='/usr/include/stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen64' hash='6347265fef1b547c'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asprintf' hash='156e512eaea45d1d'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-245'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread' hash='b41d7fe688a81bb5'>
      <parameter type-id='type-id-256'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='fwrite' filepath='/usr/include/stdio.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwrite' hash='c5b905d4e2f958f3'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='strtoul' mangled-name='__isoc23_strtoul' filepath='/usr/include/stdlib.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtoul' hash='91a1f6f7dca9d3ed'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='exit' filepath='/usr/include/stdlib.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='exit' hash='388da3fa973fde78'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='secure_getenv' filepath='/usr/include/stdlib.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='secure_getenv' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='2da84c559242300d'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strdup' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl' hash='b03aa5f98a3a1499'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64' hash='5ffe6a576201da98'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64' hash='5227d00433989f9c'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='chmod' filepath='/usr/include/sys/stat.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chmod' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-232'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='statfs' mangled-name='statfs64' filepath='/usr/include/sys/statfs.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statfs64' hash='3aef3aa4b3baa20d'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='read' hash='e1f135b405ab837f'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write' hash='e1f135b405ab837f'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='usleep' filepath='/usr/include/unistd.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='usleep' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='geteuid' hash='2bb88322482ae81c'>
      <return type-id='type-id-233'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlink' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='error.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='_IO_cookie_io_functions_t' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='55' column='1' hash='adee7d4e9f5e8d76' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read' type-id='type-id-259' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write' type-id='type-id-260' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seek' type-id='type-id-261' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='close' type-id='type-id-262' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cookie_close_function_t' type-id='type-id-263' size-in-bits='64' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='48' column='1' id='type-id-264'/>
    <typedef-decl name='cookie_io_functions_t' type-id='type-id-258' size-in-bits='256' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='61' column='1' id='type-id-265'/>
    <typedef-decl name='cookie_read_function_t' type-id='type-id-266' size-in-bits='64' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='27' column='1' id='type-id-267'/>
    <typedef-decl name='cookie_seek_function_t' type-id='type-id-268' size-in-bits='64' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='45' column='1' id='type-id-269'/>
    <typedef-decl name='cookie_write_function_t' type-id='type-id-270' size-in-bits='64' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='36' column='1' id='type-id-271'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' hash='58e8e30156c6cb9b' id='type-id-272'/>
    <qualified-type-def type-id='type-id-43' const='yes' hash='2a879a2f2cae35b8' id='type-id-273'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' hash='b2a09e9f2c7b7d6e' id='type-id-262'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' hash='58feb972b850618e' id='type-id-259'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' hash='de1ff6ab22b15567' id='type-id-261'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' hash='d8a1611ae1699447' id='type-id-260'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-276'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-277'/>
    <function-decl name='efi_error_get' mangled-name='efi_error_get' filepath='src/error.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_get@@LIBEFIVAR_1.30' hash='205c87e598e55a29'>
      <parameter type-id='type-id-23' name='n' filepath='src/error.c' line='33' column='1'/>
      <parameter type-id='type-id-273' name='filename' filepath='src/error.c' line='34' column='1'/>
      <parameter type-id='type-id-273' name='function' filepath='src/error.c' line='35' column='1'/>
      <parameter type-id='type-id-41' name='line' filepath='src/error.c' line='36' column='1'/>
      <parameter type-id='type-id-273' name='message' filepath='src/error.c' line='37' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='src/error.c' line='38' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_error_set' mangled-name='efi_error_set' filepath='src/error.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set@@LIBEFIVAR_1.30' hash='70b5b1b837bb6203'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-40'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_error_pop' mangled-name='efi_error_pop' filepath='src/error.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_pop@@LIBEFIVAR_1.38' hash='7f32ffea222edbe7'>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='efi_set_loglevel' mangled-name='efi_set_loglevel' filepath='src/error.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38' hash='388da3fa973fde78'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='efi_error_clear' mangled-name='efi_error_clear' filepath='src/error.c' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear@@LIBEFIVAR_1.30' hash='7f32ffea222edbe7'>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' filepath='src/error.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile@@LIBEFIVAR_1.36' hash='2c833d407d937488'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='efi_set_verbose' mangled-name='efi_set_verbose' filepath='src/error.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_verbose@@LIBEFIVAR_1.36' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-9' name='verbosity' filepath='src/error.c' line='279' column='1'/>
      <parameter type-id='type-id-30' name='errlog' filepath='src/error.c' line='279' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='efi_get_verbose' mangled-name='efi_get_verbose' filepath='src/error.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_verbose@@LIBEFIVAR_1.36' hash='388da3fa973fde78'>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-276' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-274'/>
    <function-decl name='fopencookie' filepath='/usr/include/stdio.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopencookie' hash='aeb74fe6b22457aa'>
      <parameter type-id='type-id-277'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf' hash='cf2e9adf5c1c1adb'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fseek' hash='e969f70130fc158c'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftell' hash='eb0e1ae48e8b4470#2'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ferror' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='getrandom' filepath='/usr/include/sys/random.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrandom' hash='aed44c7f56b79ba9'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-type size-in-bits='64' hash='0d9b0f63cb844aed' id='type-id-266'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-28'/>
    </function-type>
    <function-type size-in-bits='64' hash='ce9381517a132f30' id='type-id-270'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-28'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-263'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='0b2cf557a6d64a54' id='type-id-268'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='export.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='0c85f2aac859fa27' id='type-id-278'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' hash='a7b536d51360d693' id='type-id-279'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-284'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-285'/>
    <function-decl name='efi_variable_import' mangled-name='efi_variable_import' filepath='src/export.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_import@@libefivar.so.0' hash='1a001d073e6b71d4'>
      <parameter type-id='type-id-38' name='data' filepath='src/export.c' line='314' column='1'/>
      <parameter type-id='type-id-42' name='size' filepath='src/export.c' line='314' column='1'/>
      <parameter type-id='type-id-284' name='var_out' filepath='src/export.c' line='314' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efi_variable_export_dmpstore' mangled-name='efi_variable_export_dmpstore' filepath='src/export.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export_dmpstore@@LIBEFIVAR_1.38' hash='1a001d073e6b71d4'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='457' column='1'/>
      <parameter type-id='type-id-38' name='data' filepath='src/export.c' line='457' column='1'/>
      <parameter type-id='type-id-42' name='datasz' filepath='src/export.c' line='457' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efi_variable_export' mangled-name='efi_variable_export' filepath='src/export.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export@@libefivar.so.0' hash='1a001d073e6b71d4'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='457' column='1'/>
      <parameter type-id='type-id-38' name='data' filepath='src/export.c' line='457' column='1'/>
      <parameter type-id='type-id-42' name='datasz' filepath='src/export.c' line='457' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efi_variable_alloc' mangled-name='efi_variable_alloc' filepath='src/export.c' line='595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_alloc@@LIBEFIVAR_1.38' hash='7f32ffea222edbe7'>
      <return type-id='type-id-283'/>
    </function-decl>
    <function-decl name='efi_variable_free' mangled-name='efi_variable_free' filepath='src/export.c' line='606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_free@@libefivar.so.0' hash='388da3fa973fde78'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='606' column='1'/>
      <parameter type-id='type-id-9' name='free_data' filepath='src/export.c' line='606' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='efi_variable_set_name' mangled-name='efi_variable_set_name' filepath='src/export.c' line='627' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_name@@libefivar.so.0' hash='e251a6658fef3b89'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='627' column='1'/>
      <parameter type-id='type-id-211' name='name' filepath='src/export.c' line='627' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_name' mangled-name='efi_variable_get_name' filepath='src/export.c' line='634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_name@@libefivar.so.0' hash='845433bf3a668620'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='634' column='1'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='efi_variable_set_guid' mangled-name='efi_variable_set_guid' filepath='src/export.c' line='645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_guid@@libefivar.so.0' hash='ca4a9bb9aeb3f218'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='645' column='1'/>
      <parameter type-id='type-id-61' name='guid' filepath='src/export.c' line='645' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_guid' mangled-name='efi_variable_get_guid' filepath='src/export.c' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_guid@@libefivar.so.0' hash='0b39b27adecea282'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='652' column='1'/>
      <parameter type-id='type-id-278' name='guid' filepath='src/export.c' line='652' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_set_data' mangled-name='efi_variable_set_data' filepath='src/export.c' line='664' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_data@@libefivar.so.0' hash='ef54822b6284c8d1'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='664' column='1'/>
      <parameter type-id='type-id-38' name='data' filepath='src/export.c' line='664' column='1'/>
      <parameter type-id='type-id-42' name='size' filepath='src/export.c' line='664' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_data' mangled-name='efi_variable_get_data' filepath='src/export.c' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_data@@libefivar.so.0' hash='5acae69422f492ea'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='677' column='1'/>
      <parameter type-id='type-id-252' name='data' filepath='src/export.c' line='677' column='1'/>
      <parameter type-id='type-id-247' name='size' filepath='src/export.c' line='677' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='efi_variable_set_attributes' mangled-name='efi_variable_set_attributes' filepath='src/export.c' line='690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_attributes@@libefivar.so.0' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='690' column='1'/>
      <parameter type-id='type-id-54' name='attrs' filepath='src/export.c' line='690' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_attributes' mangled-name='efi_variable_get_attributes' filepath='src/export.c' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_attributes@@libefivar.so.0' hash='0ef6d80b7999d270'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='697' column='1'/>
      <parameter type-id='type-id-279' name='attrs' filepath='src/export.c' line='697' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_realize' mangled-name='efi_variable_realize' filepath='src/export.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_realize@@libefivar.so.0' hash='388da3fa973fde78'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='709' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='efi_variable_t' type-id='type-id-286' filepath='src/include/efivar/efivar.h' line='82' column='1' id='type-id-282'/>
    <class-decl name='efi_variable' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='src/lib.h' line='18' column='1' id='type-id-286'/>
    <typedef-decl name='DIR' type-id='type-id-285' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-280'/>
  </abi-instr>
  <abi-instr address-size='64' path='guid-symbols.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-287' hash='b5ad7fb32598a614' id='type-id-288'>
      <subrange length='42' lower-bound='0' upper-bound='41' type-id='type-id-3' size-in-bits='64' is-anonymous='yes' hash='99c3ba48c0985a91' id='type-id-289'/>
    </array-type-def>
    <var-decl name='efi_guid_empty' type-id='type-id-45' mangled-name='efi_guid_empty' visibility='default' filepath='src/guid-symbols.c' line='23' column='1' elf-symbol-id='efi_guid_empty@@libefivar.so.0'/>
    <var-decl name='efi_guid_zero' type-id='type-id-45' mangled-name='efi_guid_zero' visibility='default' filepath='src/guid-symbols.c' line='27' column='1' elf-symbol-id='efi_guid_zero@@libefivar.so.0'/>
    <var-decl name='efi_guid_redhat_2' type-id='type-id-45' mangled-name='efi_guid_redhat_2' visibility='default' filepath='src/guid-symbols.c' line='32' column='1' elf-symbol-id='efi_guid_redhat_2@@libefivar.so.0'/>
    <var-decl name='efi_guid_redhat' type-id='type-id-45' mangled-name='efi_guid_redhat' visibility='default' filepath='src/guid-symbols.c' line='36' column='1' elf-symbol-id='efi_guid_redhat@@libefivar.so.0'/>
    <var-decl name='efi_guid_sha512' type-id='type-id-45' mangled-name='efi_guid_sha512' visibility='default' filepath='src/guid-symbols.c' line='40' column='1' elf-symbol-id='efi_guid_sha512@@libefivar.so.0'/>
    <var-decl name='efi_guid_fwupdate' type-id='type-id-45' mangled-name='efi_guid_fwupdate' visibility='default' filepath='src/guid-symbols.c' line='44' column='1' elf-symbol-id='efi_guid_fwupdate@@LIBEFIVAR_1.35'/>
    <var-decl name='efi_guid_sha224' type-id='type-id-45' mangled-name='efi_guid_sha224' visibility='default' filepath='src/guid-symbols.c' line='48' column='1' elf-symbol-id='efi_guid_sha224@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_boot_menu' type-id='type-id-45' mangled-name='efi_guid_lenovo_boot_menu' visibility='default' filepath='src/guid-symbols.c' line='52' column='1' elf-symbol-id='efi_guid_lenovo_boot_menu@@libefivar.so.0'/>
    <var-decl name='efi_guid_supermicro' type-id='type-id-45' mangled-name='efi_guid_supermicro' visibility='default' filepath='src/guid-symbols.c' line='56' column='1' elf-symbol-id='efi_guid_supermicro@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_asus' type-id='type-id-45' mangled-name='efi_guid_asus' visibility='default' filepath='src/guid-symbols.c' line='60' column='1' elf-symbol-id='efi_guid_asus@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_ux_capsule' type-id='type-id-45' mangled-name='efi_guid_ux_capsule' visibility='default' filepath='src/guid-symbols.c' line='64' column='1' elf-symbol-id='efi_guid_ux_capsule@@LIBEFIVAR_1.33'/>
    <var-decl name='efi_guid_x509_sha256' type-id='type-id-45' mangled-name='efi_guid_x509_sha256' visibility='default' filepath='src/guid-symbols.c' line='68' column='1' elf-symbol-id='efi_guid_x509_sha256@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048' type-id='type-id-45' mangled-name='efi_guid_rsa2048' visibility='default' filepath='src/guid-symbols.c' line='72' column='1' elf-symbol-id='efi_guid_rsa2048@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo' type-id='type-id-45' mangled-name='efi_guid_lenovo' visibility='default' filepath='src/guid-symbols.c' line='76' column='1' elf-symbol-id='efi_guid_lenovo@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_diag' type-id='type-id-45' mangled-name='efi_guid_lenovo_diag' visibility='default' filepath='src/guid-symbols.c' line='80' column='1' elf-symbol-id='efi_guid_lenovo_diag@@libefivar.so.0'/>
    <var-decl name='efi_guid_x509_sha512' type-id='type-id-45' mangled-name='efi_guid_x509_sha512' visibility='default' filepath='src/guid-symbols.c' line='84' column='1' elf-symbol-id='efi_guid_x509_sha512@@libefivar.so.0'/>
    <var-decl name='efi_guid_external_management' type-id='type-id-45' mangled-name='efi_guid_external_management' visibility='default' filepath='src/guid-symbols.c' line='88' column='1' elf-symbol-id='efi_guid_external_management@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_pkcs7_cert' type-id='type-id-45' mangled-name='efi_guid_pkcs7_cert' visibility='default' filepath='src/guid-symbols.c' line='92' column='1' elf-symbol-id='efi_guid_pkcs7_cert@@libefivar.so.0'/>
    <var-decl name='efi_guid_fives' type-id='type-id-45' mangled-name='efi_guid_fives' visibility='default' filepath='src/guid-symbols.c' line='96' column='1' elf-symbol-id='efi_guid_fives@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_shim' type-id='type-id-45' mangled-name='efi_guid_shim' visibility='default' filepath='src/guid-symbols.c' line='100' column='1' elf-symbol-id='efi_guid_shim@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_rescue' type-id='type-id-45' mangled-name='efi_guid_lenovo_rescue' visibility='default' filepath='src/guid-symbols.c' line='104' column='1' elf-symbol-id='efi_guid_lenovo_rescue@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048_sha1' type-id='type-id-45' mangled-name='efi_guid_rsa2048_sha1' visibility='default' filepath='src/guid-symbols.c' line='108' column='1' elf-symbol-id='efi_guid_rsa2048_sha1@@libefivar.so.0'/>
    <var-decl name='efi_guid_canonical' type-id='type-id-45' mangled-name='efi_guid_canonical' visibility='default' filepath='src/guid-symbols.c' line='112' column='1' elf-symbol-id='efi_guid_canonical@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_dell' type-id='type-id-45' mangled-name='efi_guid_dell' visibility='default' filepath='src/guid-symbols.c' line='116' column='1' elf-symbol-id='efi_guid_dell@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_x509_sha384' type-id='type-id-45' mangled-name='efi_guid_x509_sha384' visibility='default' filepath='src/guid-symbols.c' line='120' column='1' elf-symbol-id='efi_guid_x509_sha384@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_setup' type-id='type-id-45' mangled-name='efi_guid_lenovo_setup' visibility='default' filepath='src/guid-symbols.c' line='124' column='1' elf-symbol-id='efi_guid_lenovo_setup@@libefivar.so.0'/>
    <var-decl name='efi_guid_microsoft' type-id='type-id-45' mangled-name='efi_guid_microsoft' visibility='default' filepath='src/guid-symbols.c' line='128' column='1' elf-symbol-id='efi_guid_microsoft@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_2' type-id='type-id-45' mangled-name='efi_guid_lenovo_2' visibility='default' filepath='src/guid-symbols.c' line='132' column='1' elf-symbol-id='efi_guid_lenovo_2@@libefivar.so.0'/>
    <var-decl name='efi_guid_auto_created_boot_option' type-id='type-id-45' mangled-name='efi_guid_auto_created_boot_option' visibility='default' filepath='src/guid-symbols.c' line='136' column='1' elf-symbol-id='efi_guid_auto_created_boot_option@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_sha1' type-id='type-id-45' mangled-name='efi_guid_sha1' visibility='default' filepath='src/guid-symbols.c' line='140' column='1' elf-symbol-id='efi_guid_sha1@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_me_config' type-id='type-id-45' mangled-name='efi_guid_lenovo_me_config' visibility='default' filepath='src/guid-symbols.c' line='144' column='1' elf-symbol-id='efi_guid_lenovo_me_config@@libefivar.so.0'/>
    <var-decl name='efi_guid_global' type-id='type-id-45' mangled-name='efi_guid_global' visibility='default' filepath='src/guid-symbols.c' line='148' column='1' elf-symbol-id='efi_guid_global@@libefivar.so.0'/>
    <var-decl name='efi_guid_grub' type-id='type-id-45' mangled-name='efi_guid_grub' visibility='default' filepath='src/guid-symbols.c' line='152' column='1' elf-symbol-id='efi_guid_grub@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_x509_cert' type-id='type-id-45' mangled-name='efi_guid_x509_cert' visibility='default' filepath='src/guid-symbols.c' line='156' column='1' elf-symbol-id='efi_guid_x509_cert@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048_sha256_cert' type-id='type-id-45' mangled-name='efi_guid_rsa2048_sha256_cert' visibility='default' filepath='src/guid-symbols.c' line='160' column='1' elf-symbol-id='efi_guid_rsa2048_sha256_cert@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_diag_splash' type-id='type-id-45' mangled-name='efi_guid_lenovo_diag_splash' visibility='default' filepath='src/guid-symbols.c' line='164' column='1' elf-symbol-id='efi_guid_lenovo_diag_splash@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_msg' type-id='type-id-45' mangled-name='efi_guid_lenovo_msg' visibility='default' filepath='src/guid-symbols.c' line='168' column='1' elf-symbol-id='efi_guid_lenovo_msg@@libefivar.so.0'/>
    <var-decl name='efi_guid_sha256' type-id='type-id-45' mangled-name='efi_guid_sha256' visibility='default' filepath='src/guid-symbols.c' line='172' column='1' elf-symbol-id='efi_guid_sha256@@libefivar.so.0'/>
    <var-decl name='efi_guid_shell' type-id='type-id-45' mangled-name='efi_guid_shell' visibility='default' filepath='src/guid-symbols.c' line='176' column='1' elf-symbol-id='efi_guid_shell@@libefivar.so.0'/>
    <var-decl name='efi_guid_security' type-id='type-id-45' mangled-name='efi_guid_security' visibility='default' filepath='src/guid-symbols.c' line='180' column='1' elf-symbol-id='efi_guid_security@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048_sha256' type-id='type-id-45' mangled-name='efi_guid_rsa2048_sha256' visibility='default' filepath='src/guid-symbols.c' line='184' column='1' elf-symbol-id='efi_guid_rsa2048_sha256@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_startup_interrupt' type-id='type-id-45' mangled-name='efi_guid_lenovo_startup_interrupt' visibility='default' filepath='src/guid-symbols.c' line='188' column='1' elf-symbol-id='efi_guid_lenovo_startup_interrupt@@libefivar.so.0'/>
    <var-decl name='efi_guid_sha384' type-id='type-id-45' mangled-name='efi_guid_sha384' visibility='default' filepath='src/guid-symbols.c' line='192' column='1' elf-symbol-id='efi_guid_sha384@@libefivar.so.0'/>
    <var-decl name='efi_n_well_known_guids' type-id='type-id-290' mangled-name='efi_n_well_known_guids' visibility='default' filepath='src/guid-symbols.c' line='196' column='1' elf-symbol-id='efi_n_well_known_guids@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_n_well_known_names' type-id='type-id-290' mangled-name='efi_n_well_known_names' visibility='default' filepath='src/guid-symbols.c' line='199' column='1' elf-symbol-id='efi_n_well_known_names@@LIBEFIVAR_1.38'/>
    <class-decl name='efivar_guidname' is-struct='yes' visibility='default' size-in-bits='6272' filepath='src/include/efivar/efivar-guids.h' line='8' column='1' hash='5b6836daa36760a5' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='guid' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='symbol' type-id='type-id-221' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='name' type-id='type-id-221' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='description' type-id='type-id-221' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='efi_well_known_guids_' type-id='type-id-288' mangled-name='efi_well_known_guids_' visibility='default' filepath='src/guid-symbols.c' line='210' column='1' elf-symbol-id='efi_well_known_guids_@@libefivar.so.0'/>
    <var-decl name='efi_well_known_guids' type-id='type-id-292' mangled-name='efi_well_known_guids' visibility='default' filepath='src/guid-symbols.c' line='592' column='1' elf-symbol-id='efi_well_known_guids@@libefivar.so.0'/>
    <var-decl name='efi_well_known_guids_end' type-id='type-id-292' mangled-name='efi_well_known_guids_end' visibility='default' filepath='src/guid-symbols.c' line='595' column='1' elf-symbol-id='efi_well_known_guids_end@@libefivar.so.0'/>
    <var-decl name='efi_well_known_names_' type-id='type-id-288' mangled-name='efi_well_known_names_' visibility='default' filepath='src/guid-symbols.c' line='599' column='1' elf-symbol-id='efi_well_known_names_@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_well_known_names' type-id='type-id-292' mangled-name='efi_well_known_names' visibility='default' filepath='src/guid-symbols.c' line='981' column='1' elf-symbol-id='efi_well_known_names@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_well_known_names_end' type-id='type-id-292' mangled-name='efi_well_known_names_end' visibility='default' filepath='src/guid-symbols.c' line='984' column='1' elf-symbol-id='efi_well_known_names_end@@LIBEFIVAR_1.38'/>
  </abi-instr>
  <abi-instr address-size='64' path='guid.c' comp-dir-path='src' language='LANG_C11'>
    <qualified-type-def type-id='type-id-291' const='yes' hash='04f32338908eab73' id='type-id-287'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' hash='c5ae8d4470fb4867' id='type-id-293'/>
    <qualified-type-def type-id='type-id-293' const='yes' hash='5644d8c305b1e933' id='type-id-292'/>
    <qualified-type-def type-id='type-id-54' const='yes' hash='e9dc20ae58508001' id='type-id-290'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-296'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-297'/>
    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='src/guid.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24' hash='a62c1aff4bbad1e9'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' filepath='src/guid.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0' hash='4dddfcffb296533c'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' mangled-name='efi_str_to_guid' filepath='src/guid.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid@@libefivar.so.0' hash='b0097e728d3a5ab0'>
      <parameter type-id='type-id-40' name='name' filepath='src/guid.c' line='186' column='1'/>
      <parameter type-id='type-id-61' name='guid' filepath='src/guid.c' line='186' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' filepath='src/guid.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0' hash='79b8c9e5dc51e3e9'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_name' mangled-name='efi_guid_to_name' filepath='src/guid.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_name@@libefivar.so.0' hash='f1d314a336b25e21'>
      <parameter type-id='type-id-61' name='guid' filepath='src/guid.c' line='120' column='1'/>
      <parameter type-id='type-id-43' name='symbol' filepath='src/guid.c' line='120' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_symbol' mangled-name='efi_guid_to_symbol' filepath='src/guid.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_symbol@@libefivar.so.0' hash='f1d314a336b25e21'>
      <parameter type-id='type-id-61' name='guid' filepath='src/guid.c' line='120' column='1'/>
      <parameter type-id='type-id-43' name='symbol' filepath='src/guid.c' line='120' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_id_guid' mangled-name='efi_guid_to_id_guid' filepath='src/guid.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_id_guid@@libefivar.so.0' hash='79b8c9e5dc51e3e9'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_name_to_guid' mangled-name='efi_name_to_guid' filepath='src/guid.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_name_to_guid@@libefivar.so.0' hash='b0097e728d3a5ab0'>
      <parameter type-id='type-id-40' name='name' filepath='src/guid.c' line='186' column='1'/>
      <parameter type-id='type-id-61' name='guid' filepath='src/guid.c' line='186' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-296' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-294'/>
    <function-decl name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='dlclose' filepath='/usr/include/dlfcn.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlclose' hash='388da3fa973fde78'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlsym' hash='fa9b01215069aed9'>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strndup' filepath='/usr/include/string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strndup' hash='64b4b60cdba4ca37'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='lib.c' comp-dir-path='src' language='LANG_C11'>
    <typedef-decl name='mode_t' type-id='type-id-232' size-in-bits='32' filepath='/usr/include/fcntl.h' line='50' column='1' hash='e66b43f97c38e87a' id='type-id-298'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-300'/>
    <function-decl name='__builtin_puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='puts' hash='7f32ffea222edbe7'>
      <return type-id='type-id-25'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-301'/>
    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' filepath='src/lib.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0' hash='deb19ee8e8941766'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' filepath='src/lib.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0' hash='deb19ee8e8941766'>
      <parameter type-id='type-id-44' name='guid' filepath='src/lib.c' line='50' column='1'/>
      <parameter type-id='type-id-40' name='name' filepath='src/lib.c' line='50' column='1'/>
      <parameter type-id='type-id-59' name='data' filepath='src/lib.c' line='50' column='1'/>
      <parameter type-id='type-id-42' name='data_size' filepath='src/lib.c' line='51' column='1'/>
      <parameter type-id='type-id-39' name='attributes' filepath='src/lib.c' line='51' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_efi_set_variable_mode' mangled-name='efi_set_variable' filepath='src/lib.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_variable@@LIBEFIVAR_0.24' hash='0c6cfcc9c174330b'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-298'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' filepath='src/lib.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0' hash='deb19ee8e8941766'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' filepath='src/lib.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-44' name='guid' filepath='src/lib.c' line='165' column='1'/>
      <parameter type-id='type-id-40' name='name' filepath='src/lib.c' line='165' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' filepath='src/lib.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0' hash='4cec6eccd29b6dbe'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-251'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' filepath='src/lib.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0' hash='e612ffd19509f983'>
      <parameter type-id='type-id-44' name='guid' filepath='src/lib.c' line='147' column='1'/>
      <parameter type-id='type-id-40' name='name' filepath='src/lib.c' line='147' column='1'/>
      <parameter type-id='type-id-251' name='attributes' filepath='src/lib.c' line='148' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' filepath='src/lib.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@LIBEFIVAR_1.35' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-44' name='guid' filepath='src/lib.c' line='165' column='1'/>
      <parameter type-id='type-id-40' name='name' filepath='src/lib.c' line='165' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' filepath='src/lib.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0' hash='71a86865f38f69c6'>
      <parameter type-id='type-id-44' name='guid' filepath='src/lib.c' line='172' column='1'/>
      <parameter type-id='type-id-40' name='name' filepath='src/lib.c' line='172' column='1'/>
      <parameter type-id='type-id-247' name='size' filepath='src/lib.c' line='172' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' filepath='src/lib.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0' hash='b34326bcf8339ba1'>
      <parameter type-id='type-id-278' name='guid' filepath='src/lib.c' line='189' column='1'/>
      <parameter type-id='type-id-43' name='name' filepath='src/lib.c' line='189' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' filepath='src/lib.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-44' name='guid' filepath='src/lib.c' line='206' column='1'/>
      <parameter type-id='type-id-40' name='name' filepath='src/lib.c' line='206' column='1'/>
      <parameter type-id='type-id-298' name='mode' filepath='src/lib.c' line='206' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' filepath='src/lib.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0' hash='388da3fa973fde78'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_libefivar_version' mangled-name='efi_get_libefivar_version' filepath='src/lib.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefivar_version@@LIBEFIVAR_1.38' hash='2bb88322482ae81c'>
      <return type-id='type-id-39'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-301' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-299'/>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='printf' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-40'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strcasestr' filepath='/usr/include/string.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcasestr' hash='21babdbcb7a34ebe'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='time.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' hash='831fa813c3806379' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-241' size-in-bits='64' filepath='/usr/include/bits/types/time_t.h' line='10' column='1' hash='b119fe0931d2ee10' id='type-id-303'/>
    <qualified-type-def type-id='type-id-10' restrict='yes' hash='566dfacc48804f50' id='type-id-304'/>
    <qualified-type-def type-id='type-id-303' const='yes' hash='3d3ed5b21cd59821' id='type-id-305'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' hash='5933014f14812f40' id='type-id-306'/>
    <qualified-type-def type-id='type-id-306' restrict='yes' hash='ba279bf62b26c900' id='type-id-307'/>
    <qualified-type-def type-id='type-id-302' const='yes' hash='6d30d2c0485b21b8' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' hash='934b82f269d593b3' id='type-id-309'/>
    <qualified-type-def type-id='type-id-309' restrict='yes' hash='eb8bfc989b1d24fd' id='type-id-310'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='0450557ac0931bcf' id='type-id-311'/>
    <qualified-type-def type-id='type-id-311' restrict='yes' hash='757fb5c6c05e30f5' id='type-id-312'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-315'/>
    <typedef-decl name='DIR' type-id='type-id-315' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-313'/>
    <function-decl name='setenv' filepath='/usr/include/stdlib.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setenv' hash='5e8eff0065f8d4dd'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='unsetenv' filepath='/usr/include/stdlib.h' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unsetenv' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mktime' hash='93e83c388da365bd'>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strftime' hash='9dcd2db97e14a6fc'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-309'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='strptime' filepath='/usr/include/time.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strptime' hash='e40f9a9cb9b62f37'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gmtime_r' filepath='/usr/include/time.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gmtime_r' hash='738b12e2e9661338'>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-312'/>
      <return type-id='type-id-311'/>
    </function-decl>
    <function-decl name='localtime_r' filepath='/usr/include/time.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='localtime_r' hash='738b12e2e9661338'>
      <parameter type-id='type-id-307'/>
