<abi-corpus path='libefiboot.so' architecture='elf-amd-x86_64' soname='libefiboot.so.1'>
  <elf-needed>
    <dependency name='libefivar.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='efi_generate_file_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_file_device_path_from_esp' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_ipv4_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_ucs2' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_utf8' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_from_file' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_clear' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_set' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attrs' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_create' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_desc' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_is_valid' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data_size' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_pathlen' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='/home/pjones/devel/github.com/efivar/master/src' language='LANG_C99'>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/loadopt.c' line='28' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attributes' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/loadopt.c' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='file_path_list_length' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/loadopt.c' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='description' type-id='type-id-7' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/loadopt.c' line='31' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
    <typedef-decl name='__uint32_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-9'/>
    <typedef-decl name='uint32_t' type-id='type-id-9' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-10'/>
    <typedef-decl name='__uint16_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-11'/>
    <typedef-decl name='uint16_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-6'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='16' id='type-id-7'>
      <subrange length='1' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efi_load_option' type-id='type-id-4' filepath='include/efivar/efiboot-loadopt.h' line='24' column='1' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-16'/>
    <typedef-decl name='__ssize_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='181' column='1' id='type-id-17'/>
    <typedef-decl name='ssize_t' type-id='type-id-17' filepath='/usr/include/sys/types.h' line='109' column='1' id='type-id-18'/>
    <function-decl name='efi_loadopt_desc' mangled-name='efi_loadopt_desc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_desc@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-18' name='limit'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-19'/>
    <typedef-decl name='__uint8_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-20'/>
    <typedef-decl name='uint8_t' type-id='type-id-20' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-22'/>
    <function-decl name='efi_loadopt_args_as_ucs2' mangled-name='efi_loadopt_args_as_ucs2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_ucs2@@libefiboot.so.0'>
      <parameter type-id='type-id-19' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-22' name='utf8'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_loadopt_args_as_utf8' mangled-name='efi_loadopt_args_as_utf8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_utf8@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-22' name='utf8'/>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-22' name='utf8'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <function-decl name='efi_loadopt_args_from_file' mangled-name='efi_loadopt_args_from_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_from_file@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-24' name='filename'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-25'/>
    <typedef-decl name='size_t' type-id='type-id-12' filepath='/usr/lib/gcc/x86_64-redhat-linux/8/include/stddef.h' line='216' column='1' id='type-id-26'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-29'/>
    <function-decl name='efi_loadopt_optional_data' mangled-name='efi_loadopt_optional_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-26' name='opt_size'/>
      <parameter type-id='type-id-28' name='datap'/>
      <parameter type-id='type-id-29' name='len'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='832' column='1' id='type-id-30'>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='838' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pci' type-id='type-id-33' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='839' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pccard' type-id='type-id-34' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mmio' type-id='type-id-35' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hw_vendor' type-id='type-id-36' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='controller' type-id='type-id-37' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='843' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bmc' type-id='type-id-38' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid' type-id='type-id-39' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid_ex' type-id='type-id-40' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_adr' type-id='type-id-41' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='atapi' type-id='type-id-42' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='scsi' type-id='type-id-43' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fc' type-id='type-id-44' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fcex' type-id='type-id-45' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firewire' type-id='type-id-46' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb' type-id='type-id-47' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_class' type-id='type-id-48' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_wwid' type-id='type-id-49' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='lun' type-id='type-id-50' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sata' type-id='type-id-51' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i2o' type-id='type-id-52' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac_addr' type-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv4_addr' type-id='type-id-54' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv6_addr' type-id='type-id-55' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vlan' type-id='type-id-56' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='infiniband' type-id='type-id-57' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart' type-id='type-id-58' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='msg_vendor' type-id='type-id-59' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart_flow_control' type-id='type-id-60' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas' type-id='type-id-61' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas_ex' type-id='type-id-62' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iscsi' type-id='type-id-63' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvme' type-id='type-id-64' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uri' type-id='type-id-65' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ufs' type-id='type-id-66' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sd' type-id='type-id-67' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bt' type-id='type-id-68' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='wifi' type-id='type-id-69' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='emmc' type-id='type-id-70' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='btle' type-id='type-id-71' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dns' type-id='type-id-72' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvdimm' type-id='type-id-73' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hd' type-id='type-id-74' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cdrom' type-id='type-id-75' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='media_vendor' type-id='type-id-76' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='file' type-id='type-id-77' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='883' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='protocol' type-id='type-id-78' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='884' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_file' type-id='type-id-79' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='885' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_volume' type-id='type-id-80' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='886' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='relative_offset' type-id='type-id-81' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='887' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ramdisk' type-id='type-id-82' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='888' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bios_boot' type-id='type-id-83' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='889' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='833' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='836' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-84' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-32'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-33' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pci' type-id='type-id-85' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-33'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-34' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pccard' type-id='type-id-86' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-34'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-35' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-89'/>
    <typedef-decl name='uint64_t' type-id='type-id-89' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-88'/>
    <typedef-decl name='efidp_mmio' type-id='type-id-87' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-35'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-36' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='33' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-94' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='38' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='48' id='type-id-94'>
      <subrange length='6' type-id='type-id-12' id='type-id-95'/>

    </array-type-def>
    <typedef-decl name='efi_guid_t' type-id='type-id-93' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='39' column='1' id='type-id-91'/>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='8' id='type-id-92'>
      <subrange length='1' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-90' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-36'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-37' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_controller' type-id='type-id-96' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-37'/>
    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-38' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bmc' type-id='type-id-97' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-38'/>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-39' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-98' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-39'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-40' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-100' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='134' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='8' id='type-id-100'>
      <subrange length='1' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-99' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-40'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-41' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='165' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-102' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='167' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='32' id='type-id-102'>
      <subrange length='1' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-101' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='168' column='1' id='type-id-41'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_atapi' type-id='type-id-103' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-42'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-43' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='336' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='339' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_scsi' type-id='type-id-104' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-43'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-44' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='349' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fc' type-id='type-id-105' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='350' column='1' id='type-id-44'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-45' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-107' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='357' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='64' id='type-id-107'>
      <subrange length='8' type-id='type-id-12' id='type-id-108'/>

    </array-type-def>
    <typedef-decl name='efidp_fcex' type-id='type-id-106' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='358' column='1' id='type-id-45'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-46' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='361' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='364' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_1394' type-id='type-id-109' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='365' column='1' id='type-id-46'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-47' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='368' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb' type-id='type-id-110' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='372' column='1' id='type-id-47'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-48' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='375' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='381' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_class' type-id='type-id-111' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='382' column='1' id='type-id-48'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-49' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='402' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-7' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-112' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='408' column='1' id='type-id-49'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-50' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='411' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='413' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_lun' type-id='type-id-113' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='414' column='1' id='type-id-50'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-51' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sata' type-id='type-id-114' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='422' column='1' id='type-id-51'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-52' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='428' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='430' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_i2o' type-id='type-id-115' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='431' column='1' id='type-id-52'/>
    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-53' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='434' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-117' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='437' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' id='type-id-117'>
      <subrange length='32' type-id='type-id-12' id='type-id-118'/>

    </array-type-def>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-116' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='438' column='1' id='type-id-53'/>
    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-54' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='446' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-120' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-120' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-121' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-120' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-120' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='455' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='32' id='type-id-120'>
      <subrange length='4' type-id='type-id-12' id='type-id-122'/>

    </array-type-def>
    <typedef-decl name='efidp_boolean' type-id='type-id-21' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-121'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-119' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='456' column='1' id='type-id-54'/>
    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-55' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='468' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-124' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-124' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='477' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-124'>
      <subrange length='16' type-id='type-id-12' id='type-id-125'/>

    </array-type-def>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-123' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='478' column='1' id='type-id-55'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-56' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='485' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='487' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_vlan' type-id='type-id-126' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='488' column='1' id='type-id-56'/>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-57' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='491' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-128' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='500' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='128' id='type-id-128'>
      <subrange length='2' type-id='type-id-12' id='type-id-130'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='495' column='1' id='type-id-129'>
      <data-member access='private'>
        <var-decl name='ioc_guid' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='service_id' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='497' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efidp_infiniband' type-id='type-id-127' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='501' column='1' id='type-id-57'/>
    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-58' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='510' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='516' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart' type-id='type-id-131' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='517' column='1' id='type-id-58'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-59' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='541' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='544' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-132' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-59'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-60' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='557' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-133' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='558' column='1' id='type-id-60'/>
    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-61' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='565' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='573' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas' type-id='type-id-134' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='574' column='1' id='type-id-61'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-62' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='598' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-107' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='604' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-135' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='605' column='1' id='type-id-62'/>
    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-63' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='611' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='617' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_iscsi' type-id='type-id-136' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='618' column='1' id='type-id-63'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-64' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-107' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvme' type-id='type-id-137' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='650' column='1' id='type-id-64'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-65' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='655' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='657' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uri' type-id='type-id-138' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='658' column='1' id='type-id-65'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-66' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='664' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ufs' type-id='type-id-139' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-66'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-67' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='670' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sd' type-id='type-id-140' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-67'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-68' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-94' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='676' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bt' type-id='type-id-141' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-68'/>
    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-69' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-117' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='682' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_wifi' type-id='type-id-142' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='683' column='1' id='type-id-69'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-70' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='686' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='688' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_emmc' type-id='type-id-143' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='689' column='1' id='type-id-70'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-71' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='692' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-94' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='695' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_btle' type-id='type-id-144' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='696' column='1' id='type-id-71'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-146' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='705' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='49' column='1' id='type-id-147'>
      <data-member access='private'>
        <var-decl name='addr' type-id='type-id-148' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='50' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v4' type-id='type-id-149' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='51' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v6' type-id='type-id-150' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='52' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='128' id='type-id-148'>
      <subrange length='4' type-id='type-id-12' id='type-id-122'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-149' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='41' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-120' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-151' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='43' column='1' id='type-id-149'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-150' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='45' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-124' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-152' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='47' column='1' id='type-id-150'/>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-147' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar.h' line='53' column='1' id='type-id-153'/>

    <array-type-def dimensions='1' type-id='type-id-153' size-in-bits='128' id='type-id-146'>
      <subrange length='1' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_dns' type-id='type-id-145' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='706' column='1' id='type-id-72'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-73' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='709' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='711' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-154' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='712' column='1' id='type-id-73'/>
    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-74' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='717' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-124' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-21' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='724' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hd' type-id='type-id-155' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='728' column='1' id='type-id-74'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-75' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='742' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_cdrom' type-id='type-id-156' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='747' column='1' id='type-id-75'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-76' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='750' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='753' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-157' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='754' column='1' id='type-id-76'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-77' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='761' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='763' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_file' type-id='type-id-158' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='764' column='1' id='type-id-77'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-78' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='768' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='770' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_protocol' type-id='type-id-159' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='771' column='1' id='type-id-78'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-79' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='774' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='776' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-160' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='777' column='1' id='type-id-79'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-80' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='780' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-161' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='783' column='1' id='type-id-80'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-81' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='786' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='790' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-162' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='791' column='1' id='type-id-81'/>
    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-82' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='794' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-88' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-91' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='799' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-163' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='800' column='1' id='type-id-82'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-83' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='813' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-6' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-92' visibility='default' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='817' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-164' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='818' column='1' id='type-id-83'/>
    <typedef-decl name='efidp_data' type-id='type-id-30' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='890' column='1' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <typedef-decl name='efidp' type-id='type-id-166' filepath='/home/pjones/devel/github.com/efivar/master/src/include/efivar/efivar-dp.h' line='891' column='1' id='type-id-167'/>
    <function-decl name='efi_loadopt_path' mangled-name='efi_loadopt_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_path@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-18' name='limit'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='efi_loadopt_pathlen' mangled-name='efi_loadopt_pathlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_pathlen@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-18' name='limit'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='void' id='type-id-168'/>
    <function-decl name='efi_loadopt_attr_clear' mangled-name='efi_loadopt_attr_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_clear@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-6' name='attr'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='efi_loadopt_attr_set' mangled-name='efi_loadopt_attr_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_set@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-6' name='attr'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='efi_loadopt_attrs' mangled-name='efi_loadopt_attrs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attrs@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='efi_loadopt_is_valid' mangled-name='efi_loadopt_is_valid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_is_valid@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-26' name='size'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='efi_loadopt_optional_data_size' mangled-name='efi_loadopt_optional_data_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data_size@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt'/>
      <parameter type-id='type-id-26' name='size'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_loadopt_create' mangled-name='efi_loadopt_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_create@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-5' name='attributes'/>
      <parameter type-id='type-id-167' name='dp'/>
      <parameter type-id='type-id-18' name='dp_size'/>
      <parameter type-id='type-id-27' name='description'/>
      <parameter type-id='type-id-22' name='optional_data'/>
      <parameter type-id='type-id-26' name='optional_data_size'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-169'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-171'/>
    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-171' name='ifname'/>
      <parameter type-id='type-id-171' name='local_addr'/>
      <parameter type-id='type-id-171' name='remote_addr'/>
      <parameter type-id='type-id-171' name='gateway_addr'/>
      <parameter type-id='type-id-171' name='netmask'/>
      <parameter type-id='type-id-6' name='local_port'/>
      <parameter type-id='type-id-6' name='remote_port'/>
      <parameter type-id='type-id-6' name='protocol'/>
      <parameter type-id='type-id-21' name='addr_origin'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-171' name='filepath'/>
      <parameter type-id='type-id-5' name='options'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-18' name='size'/>
      <parameter type-id='type-id-170' name='devpath'/>
      <parameter type-id='type-id-25' name='partition'/>
      <parameter type-id='type-id-170' name='relpath'/>
      <parameter type-id='type-id-5' name='options'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/libio.h' line='245' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/libio.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-173' visibility='default' filepath='/usr/include/bits/libio.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-174' visibility='default' filepath='/usr/include/bits/libio.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/libio.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-175' visibility='default' filepath='/usr/include/bits/libio.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-176' visibility='default' filepath='/usr/include/bits/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-100' visibility='default' filepath='/usr/include/bits/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-177' visibility='default' filepath='/usr/include/bits/libio.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-178' visibility='default' filepath='/usr/include/bits/libio.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-178' visibility='default' filepath='/usr/include/bits/libio.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-178' visibility='default' filepath='/usr/include/bits/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-178' visibility='default' filepath='/usr/include/bits/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-179' visibility='default' filepath='/usr/include/bits/libio.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/bits/libio.h' line='160' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-173' visibility='default' filepath='/usr/include/bits/libio.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-174' visibility='default' filepath='/usr/include/bits/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/libio.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-174'/>
    <typedef-decl name='__off_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='140' column='1' id='type-id-175'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-176'/>
    <typedef-decl name='__off64_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='141' column='1' id='type-id-177'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-178'/>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='160' id='type-id-179'>
      <subrange length='20' type-id='type-id-12' id='type-id-181'/>

    </array-type-def>
    <var-decl name='stderr' type-id='type-id-174' visibility='default' filepath='/usr/include/stdio.h' line='137' column='1'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='__builtin_calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
