<abi-corpus path='libefiboot.so' architecture='elf-amd-x86_64' soname='libefiboot.so.1'>
  <elf-needed>
    <dependency name='libefivar.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='efi_generate_file_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_file_device_path_from_esp' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_generate_ipv4_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_ucs2' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_as_utf8' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_args_from_file' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_clear' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attr_set' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_attrs' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_create' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_desc' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_is_valid' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_optional_data_size' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_loadopt_pathlen' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='31' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attributes' type-id='type-id-5' visibility='default' filepath='src/loadopt.c' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='file_path_list_length' type-id='type-id-6' visibility='default' filepath='src/loadopt.c' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='description' type-id='type-id-7' visibility='default' filepath='src/loadopt.c' line='34' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
    <typedef-decl name='__uint32_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-9'/>
    <typedef-decl name='uint32_t' type-id='type-id-9' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-10'/>
    <typedef-decl name='__uint16_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-11'/>
    <typedef-decl name='uint16_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-6'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-7'>
      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efi_load_option' type-id='type-id-4' filepath='src/include/efivar/efiboot-loadopt.h' line='24' column='1' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-16'/>
    <typedef-decl name='__ssize_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='193' column='1' id='type-id-17'/>
    <typedef-decl name='ssize_t' type-id='type-id-17' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-18'/>
    <function-decl name='efi_loadopt_desc' mangled-name='efi_loadopt_desc' filepath='/usr/include/sys/sysmacros.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_desc@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='367' column='1'/>
      <parameter type-id='type-id-18' name='limit' filepath='/usr/include/sys/sysmacros.h' line='367' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-19'/>
    <typedef-decl name='__uint8_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-20'/>
    <typedef-decl name='uint8_t' type-id='type-id-20' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-22'/>
    <function-decl name='efi_loadopt_args_as_ucs2' mangled-name='efi_loadopt_args_as_ucs2' filepath='/usr/include/sys/sysmacros.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_ucs2@@libefiboot.so.0'>
      <parameter type-id='type-id-19' name='buf' filepath='/usr/include/sys/sysmacros.h' line='336' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='/usr/include/sys/sysmacros.h' line='336' column='1'/>
      <parameter type-id='type-id-22' name='utf8' filepath='/usr/include/sys/sysmacros.h' line='336' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_loadopt_args_as_utf8' mangled-name='efi_loadopt_args_as_utf8' filepath='/usr/include/sys/sysmacros.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_utf8@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/sys/sysmacros.h' line='311' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='/usr/include/sys/sysmacros.h' line='311' column='1'/>
      <parameter type-id='type-id-22' name='utf8' filepath='/usr/include/sys/sysmacros.h' line='311' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <function-decl name='efi_loadopt_args_from_file' mangled-name='efi_loadopt_args_from_file' filepath='/usr/include/sys/sysmacros.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_from_file@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/sys/sysmacros.h' line='268' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='/usr/include/sys/sysmacros.h' line='268' column='1'/>
      <parameter type-id='type-id-24' name='filename' filepath='/usr/include/sys/sysmacros.h' line='268' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-25'/>
    <typedef-decl name='size_t' type-id='type-id-12' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-26'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-29'/>
    <function-decl name='efi_loadopt_optional_data' mangled-name='efi_loadopt_optional_data' filepath='/usr/include/sys/sysmacros.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='235' column='1'/>
      <parameter type-id='type-id-26' name='opt_size' filepath='/usr/include/sys/sysmacros.h' line='235' column='1'/>
      <parameter type-id='type-id-28' name='datap' filepath='/usr/include/sys/sysmacros.h' line='236' column='1'/>
      <parameter type-id='type-id-29' name='len' filepath='/usr/include/sys/sysmacros.h' line='236' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1' id='type-id-30'>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pci' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pccard' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mmio' type-id='type-id-35' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hw_vendor' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='controller' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bmc' type-id='type-id-38' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid_ex' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_adr' type-id='type-id-41' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='atapi' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='scsi' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fc' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fcex' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firewire' type-id='type-id-46' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb' type-id='type-id-47' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_class' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_wwid' type-id='type-id-49' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='lun' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sata' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i2o' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac_addr' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv4_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv6_addr' type-id='type-id-55' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vlan' type-id='type-id-56' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='infiniband' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='msg_vendor' type-id='type-id-59' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart_flow_control' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas_ex' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iscsi' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvme' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uri' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ufs' type-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sd' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bt' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='wifi' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='emmc' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='btle' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dns' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvdimm' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hd' type-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cdrom' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='media_vendor' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='file' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='889' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='protocol' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='890' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_file' type-id='type-id-79' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='891' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_volume' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='892' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='relative_offset' type-id='type-id-81' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='893' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ramdisk' type-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='894' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bios_boot' type-id='type-id-83' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='895' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-84' filepath='src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-32'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pci' type-id='type-id-85' filepath='src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-33'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pccard' type-id='type-id-86' filepath='src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-34'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-35' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-89'/>
    <typedef-decl name='uint64_t' type-id='type-id-89' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-88'/>
    <typedef-decl name='efidp_mmio' type-id='type-id-87' filepath='src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-35'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar.h' line='34' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar.h' line='39' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='48' id='type-id-94'>
      <subrange length='6' type-id='type-id-12' id='type-id-95'/>

    </array-type-def>
    <typedef-decl name='efi_guid_t' type-id='type-id-93' filepath='src/include/efivar/efivar.h' line='40' column='1' id='type-id-91'/>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='infinite' id='type-id-92'>
      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-90' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-36'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_controller' type-id='type-id-96' filepath='src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-37'/>
    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-38' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bmc' type-id='type-id-97' filepath='src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-38'/>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-98' filepath='src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-39'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='134' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='infinite' id='type-id-100'>
      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-99' filepath='src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-40'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-41' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='169' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='171' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='infinite' id='type-id-102'>
      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-101' filepath='src/include/efivar/efivar-dp.h' line='172' column='1' id='type-id-41'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_atapi' type-id='type-id-103' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-42'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_scsi' type-id='type-id-104' filepath='src/include/efivar/efivar-dp.h' line='344' column='1' id='type-id-43'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='353' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fc' type-id='type-id-105' filepath='src/include/efivar/efivar-dp.h' line='354' column='1' id='type-id-44'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='361' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='64' id='type-id-107'>
      <subrange length='8' type-id='type-id-12' id='type-id-108'/>

    </array-type-def>
    <typedef-decl name='efidp_fcex' type-id='type-id-106' filepath='src/include/efivar/efivar-dp.h' line='362' column='1' id='type-id-45'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-46' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='368' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_1394' type-id='type-id-109' filepath='src/include/efivar/efivar-dp.h' line='369' column='1' id='type-id-46'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-47' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb' type-id='type-id-110' filepath='src/include/efivar/efivar-dp.h' line='376' column='1' id='type-id-47'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='379' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='385' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_class' type-id='type-id-111' filepath='src/include/efivar/efivar-dp.h' line='386' column='1' id='type-id-48'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-49' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-112' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-49'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='417' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_lun' type-id='type-id-113' filepath='src/include/efivar/efivar-dp.h' line='418' column='1' id='type-id-50'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sata' type-id='type-id-114' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-51'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='434' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_i2o' type-id='type-id-115' filepath='src/include/efivar/efivar-dp.h' line='435' column='1' id='type-id-52'/>
    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' id='type-id-117'>
      <subrange length='32' type-id='type-id-12' id='type-id-118'/>

    </array-type-def>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-116' filepath='src/include/efivar/efivar-dp.h' line='442' column='1' id='type-id-53'/>
    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='459' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='32' id='type-id-120'>
      <subrange length='4' type-id='type-id-12' id='type-id-122'/>

    </array-type-def>
    <typedef-decl name='efidp_boolean' type-id='type-id-21' filepath='src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-121'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-119' filepath='src/include/efivar/efivar-dp.h' line='460' column='1' id='type-id-54'/>
    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-55' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-124'>
      <subrange length='16' type-id='type-id-12' id='type-id-125'/>

    </array-type-def>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-123' filepath='src/include/efivar/efivar-dp.h' line='482' column='1' id='type-id-55'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-56' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_vlan' type-id='type-id-126' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-56'/>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='504' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='128' id='type-id-128'>
      <subrange length='2' type-id='type-id-12' id='type-id-130'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='499' column='1' id='type-id-129'>
      <data-member access='private'>
        <var-decl name='ioc_guid' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='500' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='service_id' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efidp_infiniband' type-id='type-id-127' filepath='src/include/efivar/efivar-dp.h' line='505' column='1' id='type-id-57'/>
    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-58' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='514' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart' type-id='type-id-131' filepath='src/include/efivar/efivar-dp.h' line='521' column='1' id='type-id-58'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-59' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-132' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-59'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-133' filepath='src/include/efivar/efivar-dp.h' line='562' column='1' id='type-id-60'/>
    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-61' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='577' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas' type-id='type-id-134' filepath='src/include/efivar/efivar-dp.h' line='578' column='1' id='type-id-61'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-135' filepath='src/include/efivar/efivar-dp.h' line='609' column='1' id='type-id-62'/>
    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='615' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='621' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_iscsi' type-id='type-id-136' filepath='src/include/efivar/efivar-dp.h' line='622' column='1' id='type-id-63'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvme' type-id='type-id-137' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-64'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uri' type-id='type-id-138' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-65'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='668' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ufs' type-id='type-id-139' filepath='src/include/efivar/efivar-dp.h' line='669' column='1' id='type-id-66'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='674' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sd' type-id='type-id-140' filepath='src/include/efivar/efivar-dp.h' line='675' column='1' id='type-id-67'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='680' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bt' type-id='type-id-141' filepath='src/include/efivar/efivar-dp.h' line='681' column='1' id='type-id-68'/>
    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='686' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_wifi' type-id='type-id-142' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' id='type-id-69'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_emmc' type-id='type-id-143' filepath='src/include/efivar/efivar-dp.h' line='693' column='1' id='type-id-70'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='698' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_btle' type-id='type-id-144' filepath='src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-71'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar.h' line='50' column='1' id='type-id-147'>
      <data-member access='private'>
        <var-decl name='addr' type-id='type-id-148' visibility='default' filepath='src/include/efivar/efivar.h' line='51' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v4' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar.h' line='52' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v6' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar.h' line='53' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='128' id='type-id-148'>
      <subrange length='4' type-id='type-id-12' id='type-id-122'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar.h' line='42' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-151' filepath='src/include/efivar/efivar.h' line='44' column='1' id='type-id-149'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar.h' line='46' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-152' filepath='src/include/efivar/efivar.h' line='48' column='1' id='type-id-150'/>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-147' filepath='src/include/efivar/efivar.h' line='54' column='1' id='type-id-153'/>

    <array-type-def dimensions='1' type-id='type-id-153' size-in-bits='infinite' id='type-id-146'>
      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <typedef-decl name='efidp_dns' type-id='type-id-145' filepath='src/include/efivar/efivar-dp.h' line='712' column='1' id='type-id-72'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='718' column='1' id='type-id-73'/>
    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='730' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hd' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='734' column='1' id='type-id-74'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_cdrom' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='753' column='1' id='type-id-75'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='756' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='759' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='760' column='1' id='type-id-76'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_file' type-id='type-id-158' filepath='src/include/efivar/efivar-dp.h' line='770' column='1' id='type-id-77'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='776' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_protocol' type-id='type-id-159' filepath='src/include/efivar/efivar-dp.h' line='777' column='1' id='type-id-78'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-79' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-160' filepath='src/include/efivar/efivar-dp.h' line='783' column='1' id='type-id-79'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-80'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-81' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-162' filepath='src/include/efivar/efivar-dp.h' line='797' column='1' id='type-id-81'/>
    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='800' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='805' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-163' filepath='src/include/efivar/efivar-dp.h' line='806' column='1' id='type-id-82'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-83' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='819' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='823' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='824' column='1' id='type-id-83'/>
    <typedef-decl name='efidp_data' type-id='type-id-30' filepath='src/include/efivar/efivar-dp.h' line='896' column='1' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <typedef-decl name='efidp' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='897' column='1' id='type-id-167'/>
    <function-decl name='efi_loadopt_path' mangled-name='efi_loadopt_path' filepath='/usr/include/sys/sysmacros.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_path@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='206' column='1'/>
      <parameter type-id='type-id-18' name='limit' filepath='/usr/include/sys/sysmacros.h' line='206' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='efi_loadopt_pathlen' mangled-name='efi_loadopt_pathlen' filepath='/usr/include/sys/sysmacros.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_pathlen@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='192' column='1'/>
      <parameter type-id='type-id-18' name='limit' filepath='/usr/include/sys/sysmacros.h' line='192' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='void' id='type-id-168'/>
    <function-decl name='efi_loadopt_attr_clear' mangled-name='efi_loadopt_attr_clear' filepath='/usr/include/sys/sysmacros.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_clear@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='185' column='1'/>
      <parameter type-id='type-id-6' name='attr' filepath='/usr/include/sys/sysmacros.h' line='185' column='1'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='efi_loadopt_attr_set' mangled-name='efi_loadopt_attr_set' filepath='/usr/include/sys/sysmacros.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_set@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='185' column='1'/>
      <parameter type-id='type-id-6' name='attr' filepath='/usr/include/sys/sysmacros.h' line='185' column='1'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='efi_loadopt_attrs' mangled-name='efi_loadopt_attrs' filepath='/usr/include/sys/sysmacros.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attrs@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='173' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='efi_loadopt_optional_data_size' mangled-name='efi_loadopt_optional_data_size' filepath='/usr/include/sys/sysmacros.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data_size@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='116' column='1'/>
      <parameter type-id='type-id-26' name='size' filepath='/usr/include/sys/sysmacros.h' line='116' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_loadopt_is_valid' mangled-name='efi_loadopt_is_valid' filepath='/usr/include/sys/sysmacros.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_is_valid@@libefiboot.so.0'>
      <parameter type-id='type-id-15' name='opt' filepath='/usr/include/sys/sysmacros.h' line='164' column='1'/>
      <parameter type-id='type-id-26' name='size' filepath='/usr/include/sys/sysmacros.h' line='164' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='efi_loadopt_create' mangled-name='efi_loadopt_create' filepath='/usr/include/sys/sysmacros.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_create@@libefiboot.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/sys/sysmacros.h' line='40' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='/usr/include/sys/sysmacros.h' line='40' column='1'/>
      <parameter type-id='type-id-5' name='attributes' filepath='/usr/include/sys/sysmacros.h' line='40' column='1'/>
      <parameter type-id='type-id-167' name='dp' filepath='/usr/include/sys/sysmacros.h' line='41' column='1'/>
      <parameter type-id='type-id-18' name='dp_size' filepath='/usr/include/sys/sysmacros.h' line='41' column='1'/>
      <parameter type-id='type-id-27' name='description' filepath='/usr/include/sys/sysmacros.h' line='41' column='1'/>
      <parameter type-id='type-id-22' name='optional_data' filepath='/usr/include/sys/sysmacros.h' line='42' column='1'/>
      <parameter type-id='type-id-26' name='optional_data_size' filepath='/usr/include/sys/sysmacros.h' line='42' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-169'/>
    <enum-decl name='interface_type' filepath='src/linux.h' line='100' column='1' id='type-id-170'>
      <underlying-type type-id='type-id-169'/>
      <enumerator name='unknown' value='0'/>
      <enumerator name='isa' value='1'/>
      <enumerator name='acpi_root' value='2'/>
      <enumerator name='pci_root' value='3'/>
      <enumerator name='soc_root' value='4'/>
      <enumerator name='pci' value='5'/>
      <enumerator name='network' value='6'/>
      <enumerator name='ata' value='7'/>
      <enumerator name='atapi' value='8'/>
      <enumerator name='scsi' value='9'/>
      <enumerator name='sata' value='10'/>
      <enumerator name='sas' value='11'/>
      <enumerator name='usb' value='12'/>
      <enumerator name='i1394' value='13'/>
      <enumerator name='fibre' value='14'/>
      <enumerator name='i2o' value='15'/>
      <enumerator name='md' value='16'/>
      <enumerator name='virtblk' value='17'/>
      <enumerator name='nvme' value='18'/>
      <enumerator name='nd_pmem' value='19'/>
      <enumerator name='emmc' value='20'/>
    </enum-decl>

    <array-type-def dimensions='1' type-id='type-id-170' size-in-bits='64' alignment-in-bits='32' id='type-id-171'>
      <subrange length='2' type-id='type-id-12' id='type-id-130'/>

    </array-type-def>
    <var-decl name='i2o_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-i2o.c' line='55' column='1'/>
    <var-decl name='scsi_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-scsi.c' line='320' column='1'/>

    <array-type-def dimensions='1' type-id='type-id-170' size-in-bits='96' alignment-in-bits='32' id='type-id-172'>
      <subrange length='3' type-id='type-id-12' id='type-id-173'/>

    </array-type-def>
    <var-decl name='ata_iftypes' type-id='type-id-172' visibility='default' filepath='src/linux-ata.c' line='152' column='1'/>
    <var-decl name='sata_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-sata.c' line='255' column='1'/>
    <var-decl name='sas_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-sas.c' line='256' column='1'/>
    <var-decl name='virtblk_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-virtblk.c' line='78' column='1'/>
    <var-decl name='soc_root_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-soc-root.c' line='65' column='1'/>
    <var-decl name='pci_root_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-pci-root.c' line='125' column='1'/>
    <var-decl name='acpi_root_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-acpi-root.c' line='190' column='1'/>
    <var-decl name='pmem_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-pmem.c' line='183' column='1'/>
    <class-decl name='dev_probe' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='258' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iftypes' type-id='type-id-175' visibility='default' filepath='src/linux.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parse' type-id='type-id-176' visibility='default' filepath='src/linux.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='create' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='make_part_name' type-id='type-id-178' visibility='default' filepath='src/linux.h' line='266' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-175'/>
    <class-decl name='device' size-in-bits='2752' is-struct='yes' visibility='default' filepath='src/linux.h' line='112' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interface_type' type-id='type-id-170' visibility='default' filepath='src/linux.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='driver' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='probes' type-id='type-id-180' visibility='default' filepath='src/linux.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_probes' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-181' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-180'/>
    <union-decl name='__anonymous_union__' size-in-bits='2368' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='122' column='1' id='type-id-181'>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ifname' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='151' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='2368' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='123' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stat' type-id='type-id-184' visibility='default' filepath='src/linux.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='controllernum' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='disknum' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='part' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='major' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='minor' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='edd10_devicenum' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='disk_name' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='part_name' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='acpi_root' type-id='type-id-185' visibility='default' filepath='src/linux.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='pci_root' type-id='type-id-186' visibility='default' filepath='src/linux.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='n_pci_devs' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pci_dev' type-id='type-id-187' visibility='default' filepath='src/linux.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='' type-id='type-id-188' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/stat.h' line='46' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-190' visibility='default' filepath='/usr/include/bits/stat.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-192' visibility='default' filepath='/usr/include/bits/stat.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-193' visibility='default' filepath='/usr/include/bits/stat.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-194' visibility='default' filepath='/usr/include/bits/stat.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/stat.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/stat.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-195' visibility='default' filepath='/usr/include/bits/stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-196' visibility='default' filepath='/usr/include/bits/stat.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-197' visibility='default' filepath='/usr/include/bits/stat.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-198' visibility='default' filepath='/usr/include/bits/stat.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-198' visibility='default' filepath='/usr/include/bits/stat.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-198' visibility='default' filepath='/usr/include/bits/stat.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-199' visibility='default' filepath='/usr/include/bits/stat.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-189'/>
    <typedef-decl name='__ino_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-190'/>
    <typedef-decl name='__nlink_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-191'/>
    <typedef-decl name='__mode_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-192'/>
    <typedef-decl name='__uid_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-193'/>
    <typedef-decl name='__gid_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-194'/>
    <typedef-decl name='__off_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-195'/>
    <typedef-decl name='__blksize_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='174' column='1' id='type-id-196'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='179' column='1' id='type-id-197'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-200' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-201' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-200'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-201'/>

    <array-type-def dimensions='1' type-id='type-id-201' size-in-bits='192' id='type-id-199'>
      <subrange length='3' type-id='type-id-12' id='type-id-173'/>

    </array-type-def>
    <class-decl name='acpi_root_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='24' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acpi_hid' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acpi_uid' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acpi_cid' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acpi_hid_str' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='acpi_uid_str' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='acpi_cid_str' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pci_root_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='33' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pci_domain' type-id='type-id-6' visibility='default' filepath='src/linux.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pci_bus' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pci_dev_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/linux.h' line='38' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pci_domain' type-id='type-id-6' visibility='default' filepath='src/linux.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pci_bus' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='pci_device' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pci_function' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driverlink' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-187'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='141' column='1' id='type-id-188'>
      <data-member access='private'>
        <var-decl name='scsi_info' type-id='type-id-203' visibility='default' filepath='src/linux.h' line='142' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas_info' type-id='type-id-204' visibility='default' filepath='src/linux.h' line='143' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sata_info' type-id='type-id-205' visibility='default' filepath='src/linux.h' line='144' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ata_info' type-id='type-id-206' visibility='default' filepath='src/linux.h' line='145' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvme_info' type-id='type-id-207' visibility='default' filepath='src/linux.h' line='146' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='emmc_info' type-id='type-id-208' visibility='default' filepath='src/linux.h' line='147' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvdimm_info' type-id='type-id-209' visibility='default' filepath='src/linux.h' line='148' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='scsi_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/linux.h' line='46' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sas_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='53' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sata_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/linux.h' line='62' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ata_devno' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ata_port' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ata_pmp' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ata_print_id' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ata_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='75' column='1' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scsi_host' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_info' size-in-bits='160' is-struct='yes' visibility='default' filepath='src/linux.h' line='84' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrl_id' type-id='type-id-210' visibility='default' filepath='src/linux.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ns_id' type-id='type-id-210' visibility='default' filepath='src/linux.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='has_eui' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='eui' type-id='type-id-107' visibility='default' filepath='src/linux.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-211'/>
    <typedef-decl name='int32_t' type-id='type-id-211' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-210'/>
    <class-decl name='emmc_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='96' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot_id' type-id='type-id-210' visibility='default' filepath='src/linux.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvdimm_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='91' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='namespace_label' type-id='type-id-91' visibility='default' filepath='src/linux.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvdimm_label' type-id='type-id-91' visibility='default' filepath='src/linux.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-212'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-213'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-215'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-178'/>
    <var-decl name='emmc_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='288' column='1'/>
    <var-decl name='i2o_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='285' column='1'/>
    <var-decl name='scsi_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='286' column='1'/>
    <var-decl name='ata_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='287' column='1'/>
    <var-decl name='nvme_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='283' column='1'/>
    <var-decl name='sata_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='282' column='1'/>
    <var-decl name='sas_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='281' column='1'/>
    <var-decl name='virtblk_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='284' column='1'/>
    <var-decl name='soc_root_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='279' column='1'/>
    <var-decl name='pci_root_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='277' column='1'/>
    <var-decl name='acpi_root_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='278' column='1'/>
    <var-decl name='pmem_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='276' column='1'/>
    <var-decl name='pci_iftypes' type-id='type-id-171' visibility='default' filepath='src/linux-pci.c' line='155' column='1'/>
    <var-decl name='pci_parser' type-id='type-id-174' visibility='default' filepath='src/linux.h' line='280' column='1'/>
    <function-decl name='strcspn' mangled-name='strcspn' filepath='/usr/include/string.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='vasprintf' mangled-name='vasprintf' filepath='/usr/include/stdio.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='efi_error_set' mangled-name='efi_error_set' filepath='src/include/efivar/efivar.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
