<abi-corpus path='libefivar.so' architecture='elf-amd-x86_64' soname='libefivar.so.1'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_efi_set_variable' version='libefivar.so.0' is-default-version='no' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_efi_set_variable_variadic' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_append_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_chmod_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_del_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_error_clear' version='LIBEFIVAR_1.30' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='efi_guid_lenovo_rescue' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_lenovo_setup' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_lenovo_startup_interrupt' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_microsoft' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_pkcs7_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat_2' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_security' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha224' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shell' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shim' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_ux_capsule' size='16' version='LIBEFIVAR_1.33' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_zero' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids' size='18480' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids_end' size='1' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' filepath='/usr/include/sys/ioctl.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar.h' line='34' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-7'/>
    <typedef-decl name='__uint32_t' type-id='type-id-7' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-8'/>
    <typedef-decl name='uint32_t' type-id='type-id-8' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-4'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-9'/>
    <typedef-decl name='__uint16_t' type-id='type-id-9' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-10'/>
    <typedef-decl name='uint16_t' type-id='type-id-10' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-5'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-11'/>
    <typedef-decl name='__uint8_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-12'/>
    <typedef-decl name='uint8_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-13'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-14'/>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='48' id='type-id-6'>
      <subrange length='6' type-id='type-id-14' id='type-id-15'/>

    </array-type-def>
    <typedef-decl name='efi_guid_t' type-id='type-id-3' filepath='src/include/efivar/efivar.h' line='40' column='1' id='type-id-2'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-17'/>
    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='/usr/include/dirent.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-17' name='a' filepath='/usr/include/dirent.h' line='34' column='1'/>
      <parameter type-id='type-id-17' name='b' filepath='/usr/include/dirent.h' line='34' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' filepath='/usr/include/dirent.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid' filepath='/usr/include/dirent.h' line='40' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='efi_variable' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/export.c' line='35' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrs' type-id='type-id-19' visibility='default' filepath='src/export.c' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-20' visibility='default' filepath='src/export.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-21' visibility='default' filepath='src/export.c' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-22' visibility='default' filepath='src/export.c' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-23' visibility='default' filepath='src/export.c' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-24'/>
    <typedef-decl name='uint64_t' type-id='type-id-24' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-19'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-20'/>
    <type-decl name='char' size-in-bits='8' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-22'/>
    <typedef-decl name='size_t' type-id='type-id-14' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-23'/>
    <typedef-decl name='efi_variable_t' type-id='type-id-18' filepath='src/include/efivar/efivar.h' line='134' column='1' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-28'/>
    <function-decl name='efi_variable_get_attributes' mangled-name='efi_variable_get_attributes' filepath='/usr/include/stdio.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='306' column='1'/>
      <parameter type-id='type-id-28' name='attrs' filepath='/usr/include/stdio.h' line='306' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_set_attributes' mangled-name='efi_variable_set_attributes' filepath='/usr/include/stdio.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='299' column='1'/>
      <parameter type-id='type-id-19' name='attrs' filepath='/usr/include/stdio.h' line='299' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-29'/>
    <typedef-decl name='__ssize_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='193' column='1' id='type-id-30'/>
    <typedef-decl name='ssize_t' type-id='type-id-30' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-31'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-33'/>
    <function-decl name='efi_variable_get_data' mangled-name='efi_variable_get_data' filepath='/usr/include/stdio.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_data@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='286' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='/usr/include/stdio.h' line='286' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='/usr/include/stdio.h' line='286' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efi_variable_set_data' mangled-name='efi_variable_set_data' filepath='/usr/include/stdio.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_data@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='273' column='1'/>
      <parameter type-id='type-id-22' name='data' filepath='/usr/include/stdio.h' line='273' column='1'/>
      <parameter type-id='type-id-23' name='size' filepath='/usr/include/stdio.h' line='273' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-34'/>
    <function-decl name='efi_variable_get_guid' mangled-name='efi_variable_get_guid' filepath='/usr/include/stdio.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_guid@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='261' column='1'/>
      <parameter type-id='type-id-34' name='guid' filepath='/usr/include/stdio.h' line='261' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_set_guid' mangled-name='efi_variable_set_guid' filepath='/usr/include/stdio.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_guid@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='254' column='1'/>
      <parameter type-id='type-id-20' name='guid' filepath='/usr/include/stdio.h' line='254' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_get_name' mangled-name='efi_variable_get_name' filepath='/usr/include/stdio.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_name@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='243' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='efi_variable_set_name' mangled-name='efi_variable_set_name' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_name@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='236' column='1'/>
      <parameter type-id='type-id-21' name='name' filepath='/usr/include/stdio.h' line='236' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-35'/>
    <function-decl name='efi_variable_free' mangled-name='efi_variable_free' filepath='/usr/include/stdio.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_free@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='215' column='1'/>
      <parameter type-id='type-id-1' name='free_data' filepath='/usr/include/stdio.h' line='215' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='efi_variable_export' mangled-name='efi_variable_export' filepath='/usr/include/stdio.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='150' column='1'/>
      <parameter type-id='type-id-22' name='data' filepath='/usr/include/stdio.h' line='150' column='1'/>
      <parameter type-id='type-id-23' name='size' filepath='/usr/include/stdio.h' line='150' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-36'/>
    <function-decl name='efi_variable_import' mangled-name='efi_variable_import' filepath='/usr/include/stdio.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_import@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='data' filepath='/usr/include/stdio.h' line='58' column='1'/>
      <parameter type-id='type-id-23' name='size' filepath='/usr/include/stdio.h' line='58' column='1'/>
      <parameter type-id='type-id-36' name='var_out' filepath='/usr/include/stdio.h' line='58' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efi_get_verbose' mangled-name='efi_get_verbose' filepath='src/&lt;built-in&gt;' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_verbose@@LIBEFIVAR_1.36'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-42' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-44' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-45' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-39'/>
    <typedef-decl name='__off_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-40'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-41'/>

    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='8' id='type-id-42'>
      <subrange length='1' type-id='type-id-14' id='type-id-50'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-35' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-43'/>
    <typedef-decl name='__off64_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-44'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-45'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-47'/>

    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='160' id='type-id-48'>
      <subrange length='20' type-id='type-id-14' id='type-id-54'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-37' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-55'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <function-decl name='efi_set_verbose' mangled-name='efi_set_verbose' filepath='src/&lt;built-in&gt;' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_verbose@@LIBEFIVAR_1.36'>
      <parameter type-id='type-id-1' name='verbosity' filepath='src/&lt;built-in&gt;' line='173' column='1'/>
      <parameter type-id='type-id-56' name='errlog' filepath='src/&lt;built-in&gt;' line='173' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' filepath='src/&lt;built-in&gt;' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile@@LIBEFIVAR_1.36'>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='efi_error_clear' mangled-name='efi_error_clear' filepath='src/&lt;built-in&gt;' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear@@LIBEFIVAR_1.30'>
      <return type-id='type-id-35'/>
    </function-decl>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-57'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <function-decl name='efi_error_set' mangled-name='efi_error_set' filepath='src/&lt;built-in&gt;' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-58' name='filename' filepath='src/&lt;built-in&gt;' line='82' column='1'/>
      <parameter type-id='type-id-58' name='function' filepath='src/&lt;built-in&gt;' line='83' column='1'/>
      <parameter type-id='type-id-1' name='line' filepath='src/&lt;built-in&gt;' line='84' column='1'/>
      <parameter type-id='type-id-1' name='error' filepath='src/&lt;built-in&gt;' line='85' column='1'/>
      <parameter type-id='type-id-58' name='fmt' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='__mode_t' type-id='type-id-7' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-59'/>
    <typedef-decl name='mode_t' type-id='type-id-59' filepath='/usr/include/fcntl.h' line='50' column='1' id='type-id-60'/>
    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' filepath='/usr/include/sys/ioctl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='205' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='205' column='1'/>
      <parameter type-id='type-id-60' name='mode' filepath='/usr/include/sys/ioctl.h' line='205' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-61'/>
    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' filepath='/usr/include/sys/ioctl.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0'>
      <parameter type-id='type-id-34' name='guid' filepath='/usr/include/sys/ioctl.h' line='188' column='1'/>
      <parameter type-id='type-id-61' name='name' filepath='/usr/include/sys/ioctl.h' line='188' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' filepath='/usr/include/sys/ioctl.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='171' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='171' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='/usr/include/sys/ioctl.h' line='171' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-62'/>
    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' filepath='/usr/include/sys/ioctl.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='146' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='146' column='1'/>
      <parameter type-id='type-id-62' name='attributes' filepath='/usr/include/sys/ioctl.h' line='147' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' filepath='/usr/include/sys/ioctl.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@LIBEFIVAR_1.35'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='164' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='164' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' filepath='/usr/include/sys/ioctl.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='128' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='128' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='/usr/include/sys/ioctl.h' line='128' column='1'/>
      <parameter type-id='type-id-33' name='data_size' filepath='/usr/include/sys/ioctl.h' line='129' column='1'/>
      <parameter type-id='type-id-62' name='attributes' filepath='/usr/include/sys/ioctl.h' line='129' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' filepath='/usr/include/sys/ioctl.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='111' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='111' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_efi_set_variable_mode' mangled-name='efi_set_variable' filepath='/usr/include/sys/ioctl.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_variable@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='70' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='70' column='1'/>
      <parameter type-id='type-id-22' name='data' filepath='/usr/include/sys/ioctl.h' line='70' column='1'/>
      <parameter type-id='type-id-23' name='data_size' filepath='/usr/include/sys/ioctl.h' line='71' column='1'/>
      <parameter type-id='type-id-4' name='attributes' filepath='/usr/include/sys/ioctl.h' line='71' column='1'/>
      <parameter type-id='type-id-60' name='mode' filepath='/usr/include/sys/ioctl.h' line='71' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' filepath='/usr/include/sys/ioctl.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='89' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='89' column='1'/>
      <parameter type-id='type-id-22' name='data' filepath='/usr/include/sys/ioctl.h' line='89' column='1'/>
      <parameter type-id='type-id-23' name='data_size' filepath='/usr/include/sys/ioctl.h' line='90' column='1'/>
      <parameter type-id='type-id-4' name='attributes' filepath='/usr/include/sys/ioctl.h' line='90' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_variable_realize' mangled-name='efi_variable_realize' filepath='/usr/include/stdio.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_realize@@libefivar.so.0'>
      <parameter type-id='type-id-27' name='var' filepath='/usr/include/stdio.h' line='318' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' filepath='/usr/include/sys/ioctl.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='58' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='58' column='1'/>
      <parameter type-id='type-id-22' name='data' filepath='/usr/include/sys/ioctl.h' line='58' column='1'/>
      <parameter type-id='type-id-23' name='data_size' filepath='/usr/include/sys/ioctl.h' line='59' column='1'/>
      <parameter type-id='type-id-4' name='attributes' filepath='/usr/include/sys/ioctl.h' line='59' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' filepath='/usr/include/sys/ioctl.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0'>
      <parameter type-id='type-id-2' name='guid' filepath='/usr/include/sys/ioctl.h' line='58' column='1'/>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/sys/ioctl.h' line='58' column='1'/>
      <parameter type-id='type-id-22' name='data' filepath='/usr/include/sys/ioctl.h' line='58' column='1'/>
      <parameter type-id='type-id-23' name='data_size' filepath='/usr/include/sys/ioctl.h' line='59' column='1'/>
      <parameter type-id='type-id-4' name='attributes' filepath='/usr/include/sys/ioctl.h' line='59' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_id_guid' mangled-name='efi_guid_to_id_guid' filepath='/usr/include/dirent.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_id_guid@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid' filepath='/usr/include/dirent.h' line='175' column='1'/>
      <parameter type-id='type-id-61' name='sp' filepath='/usr/include/dirent.h' line='175' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_symbol' mangled-name='efi_guid_to_symbol' filepath='/usr/include/dirent.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_symbol@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='guid' filepath='/usr/include/dirent.h' line='161' column='1'/>
      <parameter type-id='type-id-61' name='symbol' filepath='/usr/include/dirent.h' line='161' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' filepath='/usr/include/dirent.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
      <parameter type-id='type-id-17' name='guid' filepath='/usr/include/dirent.h' line='60' column='1'/>
      <parameter type-id='type-id-61' name='sp' filepath='/usr/include/dirent.h' line='60' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_guid_to_name' mangled-name='efi_guid_to_name' filepath='/usr/include/dirent.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_name@@libefivar.so.0'>
      <parameter type-id='type-id-20' name='guid' filepath='/usr/include/dirent.h' line='161' column='1'/>
      <parameter type-id='type-id-61' name='symbol' filepath='/usr/include/dirent.h' line='161' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' mangled-name='efi_str_to_guid' filepath='/usr/include/dirent.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-58' name='s' filepath='/usr/include/dirent.h' line='50' column='1'/>
      <parameter type-id='type-id-20' name='guid' filepath='/usr/include/dirent.h' line='50' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_name_to_guid' mangled-name='efi_name_to_guid' filepath='/usr/include/dirent.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_name_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-58' name='name' filepath='/usr/include/dirent.h' line='243' column='1'/>
      <parameter type-id='type-id-20' name='guid' filepath='/usr/include/dirent.h' line='243' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-61' const='yes' id='type-id-63'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-64'/>
    <function-decl name='efi_error_get' mangled-name='efi_error_get' filepath='src/&lt;built-in&gt;' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_get@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-7' name='n' filepath='src/&lt;built-in&gt;' line='56' column='1'/>
      <parameter type-id='type-id-63' name='filename' filepath='src/&lt;built-in&gt;' line='57' column='1'/>
      <parameter type-id='type-id-63' name='function' filepath='src/&lt;built-in&gt;' line='58' column='1'/>
      <parameter type-id='type-id-64' name='line' filepath='src/&lt;built-in&gt;' line='59' column='1'/>
      <parameter type-id='type-id-63' name='message' filepath='src/&lt;built-in&gt;' line='60' column='1'/>
      <parameter type-id='type-id-64' name='error' filepath='src/&lt;built-in&gt;' line='61' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efidp_make_emmc' mangled-name='efidp_make_emmc' filepath='/usr/include/fcntl.h' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='831' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='831' column='1'/>
      <parameter type-id='type-id-4' name='slot_id' filepath='/usr/include/fcntl.h' line='831' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='/usr/include/fcntl.h' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='812' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='812' column='1'/>
      <parameter type-id='type-id-20' name='uuid' filepath='/usr/include/fcntl.h' line='812' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='/usr/include/fcntl.h' line='787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='787' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='787' column='1'/>
      <parameter type-id='type-id-19' name='sas_address' filepath='/usr/include/fcntl.h' line='787' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='/usr/include/fcntl.h' line='764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='764' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='764' column='1'/>
      <parameter type-id='type-id-5' name='primary' filepath='/usr/include/fcntl.h' line='764' column='1'/>
      <parameter type-id='type-id-5' name='slave' filepath='/usr/include/fcntl.h' line='765' column='1'/>
      <parameter type-id='type-id-5' name='lun' filepath='/usr/include/fcntl.h' line='765' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-65'/>
    <typedef-decl name='__int16_t' type-id='type-id-65' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-66'/>
    <typedef-decl name='int16_t' type-id='type-id-66' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-67'/>
    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='/usr/include/fcntl.h' line='742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='742' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='742' column='1'/>
      <parameter type-id='type-id-5' name='hba_port' filepath='/usr/include/fcntl.h' line='742' column='1'/>
      <parameter type-id='type-id-67' name='port_multiplier_port' filepath='/usr/include/fcntl.h' line='743' column='1'/>
      <parameter type-id='type-id-5' name='lun' filepath='/usr/include/fcntl.h' line='743' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='/usr/include/fcntl.h' line='716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='716' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='716' column='1'/>
      <parameter type-id='type-id-4' name='namespace_id' filepath='/usr/include/fcntl.h' line='716' column='1'/>
      <parameter type-id='type-id-22' name='ieee_eui_64' filepath='/usr/include/fcntl.h' line='717' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='/usr/include/fcntl.h' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='698' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='698' column='1'/>
      <parameter type-id='type-id-5' name='target' filepath='/usr/include/fcntl.h' line='698' column='1'/>
      <parameter type-id='type-id-5' name='lun' filepath='/usr/include/fcntl.h' line='698' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='/usr/include/fcntl.h' line='669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='669' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='669' column='1'/>
      <parameter type-id='type-id-4' name='local' filepath='/usr/include/fcntl.h' line='669' column='1'/>
      <parameter type-id='type-id-4' name='remote' filepath='/usr/include/fcntl.h' line='669' column='1'/>
      <parameter type-id='type-id-4' name='gateway' filepath='/usr/include/fcntl.h' line='670' column='1'/>
      <parameter type-id='type-id-4' name='netmask' filepath='/usr/include/fcntl.h' line='670' column='1'/>
      <parameter type-id='type-id-5' name='local_port' filepath='/usr/include/fcntl.h' line='671' column='1'/>
      <parameter type-id='type-id-5' name='remote_port' filepath='/usr/include/fcntl.h' line='671' column='1'/>
      <parameter type-id='type-id-5' name='protocol' filepath='/usr/include/fcntl.h' line='672' column='1'/>
      <parameter type-id='type-id-1' name='is_static' filepath='/usr/include/fcntl.h' line='672' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-70'/>
    <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' filepath='/usr/include/fcntl.h' line='648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf' filepath='/usr/include/fcntl.h' line='648' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='/usr/include/fcntl.h' line='648' column='1'/>
      <parameter type-id='type-id-13' name='if_type' filepath='/usr/include/fcntl.h' line='648' column='1'/>
      <parameter type-id='type-id-70' name='mac_addr' filepath='/usr/include/fcntl.h' line='649' column='1'/>
      <parameter type-id='type-id-31' name='mac_addr_size' filepath='/usr/include/fcntl.h' line='649' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <var-decl name='efi_guid_empty' type-id='type-id-16' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='4' column='1'/>
    <var-decl name='efi_guid_zero' type-id='type-id-16' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='5' column='1'/>
    <class-decl name='efi_var_operations' size-in-bits='2624' is-struct='yes' visibility='default' filepath='src/lib.h' line='29' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-72' visibility='default' filepath='src/lib.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='probe' type-id='type-id-73' visibility='default' filepath='src/lib.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='set_variable' type-id='type-id-74' visibility='default' filepath='src/lib.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='del_variable' type-id='type-id-75' visibility='default' filepath='src/lib.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='get_variable' type-id='type-id-76' visibility='default' filepath='src/lib.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='get_variable_attributes' type-id='type-id-77' visibility='default' filepath='src/lib.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='get_variable_size' type-id='type-id-78' visibility='default' filepath='src/lib.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='get_next_variable_name' type-id='type-id-79' visibility='default' filepath='src/lib.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='append_variable' type-id='type-id-80' visibility='default' filepath='src/lib.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='chmod_variable' type-id='type-id-81' visibility='default' filepath='src/lib.h' line='45' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='2040' id='type-id-72'>
      <subrange length='255' type-id='type-id-14' id='type-id-82'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-92'/>
    <var-decl name='ops' type-id='type-id-92' visibility='default' filepath='src/lib.c' line='43' column='1'/>
    <var-decl name='default_ops' type-id='type-id-71' visibility='default' filepath='src/lib.c' line='38' column='1'/>
    <var-decl name='vars_ops' type-id='type-id-71' visibility='default' filepath='src/lib.h' line='50' column='1'/>
    <var-decl name='efivarfs_ops' type-id='type-id-71' visibility='default' filepath='src/lib.h' line='51' column='1'/>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='asprintf' mangled-name='asprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='chmod' mangled-name='chmod' filepath='/usr/include/sys/stat.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='umask' mangled-name='umask' filepath='/usr/include/sys/stat.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strncpy' mangled-name='strncpy' filepath='/usr/include/string.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strtoul' mangled-name='strtoul' filepath='/usr/include/stdlib.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='ioctl' mangled-name='ioctl' filepath='/usr/include/sys/ioctl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='memcmp' mangled-name='memcmp' filepath='/usr/include/string.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='541' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='printf' mangled-name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strcasestr' mangled-name='strcasestr' filepath='/usr/include/string.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='__builtin_puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' filepath='/usr/include/stdlib.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='vasprintf' mangled-name='vasprintf' filepath='/usr/include/stdio.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='realloc' mangled-name='realloc' filepath='/usr/include/stdlib.h' line='549' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' filepath='/usr/include/string.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='snprintf' mangled-name='snprintf' filepath='/usr/include/stdio.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir' filepath='/usr/include/dirent.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='closedir' mangled-name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='opendir' mangled-name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='dirfd' mangled-name='dirfd' filepath='/usr/include/dirent.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fcntl' mangled-name='fcntl' filepath='/usr/include/fcntl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='read' mangled-name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='sched_yield' mangled-name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='open' mangled-name='open' filepath='/usr/include/fcntl.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='write' mangled-name='write' filepath='/usr/include/unistd.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strtoll' mangled-name='strtoll' filepath='/usr/include/stdlib.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='openat' mangled-name='openat' filepath='/usr/include/fcntl.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='geteuid' mangled-name='geteuid' filepath='/usr/include/unistd.h' line='678' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='usleep' mangled-name='usleep' filepath='/usr/include/unistd.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='access' mangled-name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strndup' mangled-name='strndup' filepath='/usr/include/string.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='dlopen' mangled-name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='dlsym' mangled-name='dlsym' filepath='/usr/include/dlfcn.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='dlclose' mangled-name='dlclose' filepath='/usr/include/dlfcn.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strnlen' mangled-name='strnlen' filepath='/usr/include/string.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='__fxstat' mangled-name='__fxstat' filepath='/usr/include/sys/stat.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='unlink' mangled-name='unlink' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='__xstat' mangled-name='__xstat' filepath='/usr/include/sys/stat.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='statfs' mangled-name='statfs' filepath='/usr/include/sys/statfs.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-13' name='type'/>
      <parameter type-id='type-id-13' name='subtype'/>
      <parameter type-id='type-id-31' name='total_size'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-4' name='num'/>
      <parameter type-id='type-id-19' name='part_start'/>
      <parameter type-id='type-id-19' name='part_size'/>
      <parameter type-id='type-id-22' name='signature'/>
      <parameter type-id='type-id-13' name='format'/>
      <parameter type-id='type-id-13' name='signature_type'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-21' name='filepath'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-4' name='hardware_device'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-13' name='device'/>
      <parameter type-id='type-id-13' name='function'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-4' name='hid'/>
      <parameter type-id='type-id-4' name='uid'/>
      <parameter type-id='type-id-4' name='cid'/>
      <parameter type-id='type-id-58' name='hidstr'/>
      <parameter type-id='type-id-58' name='uidstr'/>
      <parameter type-id='type-id-58' name='cidstr'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-4' name='hid'/>
      <parameter type-id='type-id-4' name='uid'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0'>
      <parameter type-id='type-id-22' name='buf'/>
      <parameter type-id='type-id-31' name='size'/>
      <parameter type-id='type-id-13' name='type'/>
      <parameter type-id='type-id-13' name='subtype'/>
      <parameter type-id='type-id-2' name='vendor_guid'/>
      <parameter type-id='type-id-47' name='data'/>
      <parameter type-id='type-id-23' name='data_size'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1' id='type-id-93'>
      <data-member access='private'>
        <var-decl name='' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pci' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pccard' type-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mmio' type-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hw_vendor' type-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='controller' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bmc' type-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_hid_ex' type-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='acpi_adr' type-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='atapi' type-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='scsi' type-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fc' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fcex' type-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firewire' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_class' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='usb_wwid' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='lun' type-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sata' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i2o' type-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac_addr' type-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv4_addr' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ipv6_addr' type-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vlan' type-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='infiniband' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart' type-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='msg_vendor' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uart_flow_control' type-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sas_ex' type-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iscsi' type-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvme' type-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='uri' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ufs' type-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sd' type-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bt' type-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='wifi' type-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='emmc' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='btle' type-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dns' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nvdimm' type-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hd' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cdrom' type-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='media_vendor' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='file' type-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='889' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='protocol' type-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='890' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_file' type-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='891' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='firmware_volume' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='892' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='relative_offset' type-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='893' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ramdisk' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='894' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bios_boot' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='895' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-147' filepath='src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-95'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pci' type-id='type-id-148' filepath='src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-96'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pccard' type-id='type-id-149' filepath='src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-97'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_mmio' type-id='type-id-150' filepath='src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-98'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='81' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='infinite' id='type-id-152'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-153'/>

    </array-type-def>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-99'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_controller' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-100'/>
    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bmc' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-101'/>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-102'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-158' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='134' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='infinite' id='type-id-158'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-153'/>

    </array-type-def>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-103'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='169' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='171' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='infinite' id='type-id-160'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-153'/>

    </array-type-def>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-159' filepath='src/include/efivar/efivar-dp.h' line='172' column='1' id='type-id-104'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_atapi' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-105'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_scsi' type-id='type-id-162' filepath='src/include/efivar/efivar-dp.h' line='344' column='1' id='type-id-106'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='353' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fc' type-id='type-id-163' filepath='src/include/efivar/efivar-dp.h' line='354' column='1' id='type-id-107'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='361' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='64' id='type-id-165'>
      <subrange length='8' type-id='type-id-14' id='type-id-166'/>

    </array-type-def>
    <typedef-decl name='efidp_fcex' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='362' column='1' id='type-id-108'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='368' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_1394' type-id='type-id-167' filepath='src/include/efivar/efivar-dp.h' line='369' column='1' id='type-id-109'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb' type-id='type-id-168' filepath='src/include/efivar/efivar-dp.h' line='376' column='1' id='type-id-110'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='379' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='385' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_class' type-id='type-id-169' filepath='src/include/efivar/efivar-dp.h' line='386' column='1' id='type-id-111'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='411' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='infinite' id='type-id-171'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-153'/>

    </array-type-def>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-170' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-112'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='417' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_lun' type-id='type-id-172' filepath='src/include/efivar/efivar-dp.h' line='418' column='1' id='type-id-113'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sata' type-id='type-id-173' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-114'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='434' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_i2o' type-id='type-id-174' filepath='src/include/efivar/efivar-dp.h' line='435' column='1' id='type-id-115'/>
    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='256' id='type-id-176'>
      <subrange length='32' type-id='type-id-14' id='type-id-177'/>

    </array-type-def>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-175' filepath='src/include/efivar/efivar-dp.h' line='442' column='1' id='type-id-116'/>
    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-180' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='459' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='32' id='type-id-179'>
      <subrange length='4' type-id='type-id-14' id='type-id-181'/>

    </array-type-def>
    <typedef-decl name='efidp_boolean' type-id='type-id-13' filepath='src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-180'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='460' column='1' id='type-id-117'/>
    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-183'>
      <subrange length='16' type-id='type-id-14' id='type-id-184'/>

    </array-type-def>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-182' filepath='src/include/efivar/efivar-dp.h' line='482' column='1' id='type-id-118'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_vlan' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-119'/>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='504' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-187'>
      <subrange length='2' type-id='type-id-14' id='type-id-189'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='499' column='1' id='type-id-188'>
      <data-member access='private'>
        <var-decl name='ioc_guid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='500' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='service_id' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efidp_infiniband' type-id='type-id-186' filepath='src/include/efivar/efivar-dp.h' line='505' column='1' id='type-id-120'/>
    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='514' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='521' column='1' id='type-id-121'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-191' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-122'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='562' column='1' id='type-id-123'/>
    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='577' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas' type-id='type-id-193' filepath='src/include/efivar/efivar-dp.h' line='578' column='1' id='type-id-124'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='609' column='1' id='type-id-125'/>
    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='615' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='621' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_iscsi' type-id='type-id-195' filepath='src/include/efivar/efivar-dp.h' line='622' column='1' id='type-id-126'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvme' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-127'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uri' type-id='type-id-197' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-128'/>
    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='668' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ufs' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='669' column='1' id='type-id-129'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='674' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sd' type-id='type-id-199' filepath='src/include/efivar/efivar-dp.h' line='675' column='1' id='type-id-130'/>
    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='680' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bt' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='681' column='1' id='type-id-131'/>
    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='686' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_wifi' type-id='type-id-201' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' id='type-id-132'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_emmc' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='693' column='1' id='type-id-133'/>
    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='698' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_btle' type-id='type-id-203' filepath='src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-134'/>
    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar.h' line='50' column='1' id='type-id-206'>
      <data-member access='private'>
        <var-decl name='addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar.h' line='51' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v4' type-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar.h' line='52' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='v6' type-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar.h' line='53' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-207'>
      <subrange length='4' type-id='type-id-14' id='type-id-181'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-208' visibility='default' filepath='src/include/efivar/efivar.h' line='42' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-210' filepath='src/include/efivar/efivar.h' line='44' column='1' id='type-id-208'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar.h' line='46' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-211' filepath='src/include/efivar/efivar.h' line='48' column='1' id='type-id-209'/>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-206' filepath='src/include/efivar/efivar.h' line='54' column='1' id='type-id-212'/>

    <array-type-def dimensions='1' type-id='type-id-212' size-in-bits='infinite' id='type-id-205'>
      <subrange length='infinite' type-id='type-id-14' id='type-id-153'/>

    </array-type-def>
    <typedef-decl name='efidp_dns' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='712' column='1' id='type-id-135'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-213' filepath='src/include/efivar/efivar-dp.h' line='718' column='1' id='type-id-136'/>
    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-13' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='730' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hd' type-id='type-id-214' filepath='src/include/efivar/efivar-dp.h' line='734' column='1' id='type-id-137'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_cdrom' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='753' column='1' id='type-id-138'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='756' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='759' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-216' filepath='src/include/efivar/efivar-dp.h' line='760' column='1' id='type-id-139'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_file' type-id='type-id-217' filepath='src/include/efivar/efivar-dp.h' line='770' column='1' id='type-id-140'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='776' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_protocol' type-id='type-id-218' filepath='src/include/efivar/efivar-dp.h' line='777' column='1' id='type-id-141'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-219' filepath='src/include/efivar/efivar-dp.h' line='783' column='1' id='type-id-142'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-220' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-143'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-221' filepath='src/include/efivar/efivar-dp.h' line='797' column='1' id='type-id-144'/>
    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='800' column='1' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-2' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='805' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-222' filepath='src/include/efivar/efivar-dp.h' line='806' column='1' id='type-id-145'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='819' column='1' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='823' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-223' filepath='src/include/efivar/efivar-dp.h' line='824' column='1' id='type-id-146'/>
    <typedef-decl name='efidp_data' type-id='type-id-93' filepath='src/include/efivar/efivar-dp.h' line='896' column='1' id='type-id-224'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-225'/>
    <typedef-decl name='efidp' type-id='type-id-225' filepath='src/include/efivar/efivar-dp.h' line='897' column='1' id='type-id-226'/>
    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-21' name='path'/>
      <parameter type-id='type-id-226' name='out'/>
      <parameter type-id='type-id-23' name='size'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0'>
      <parameter type-id='type-id-21' name='path'/>
      <parameter type-id='type-id-226' name='out'/>
      <parameter type-id='type-id-23' name='size'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-227'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-228'/>
    <typedef-decl name='const_efidp' type-id='type-id-228' filepath='src/include/efivar/efivar-dp.h' line='898' column='1' id='type-id-229'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-230'/>
    <function-decl name='efidp_append_node' mangled-name='efidp_append_node' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_node@@libefivar.so.0'>
      <parameter type-id='type-id-229' name='dp'/>
      <parameter type-id='type-id-229' name='dn'/>
      <parameter type-id='type-id-230' name='out'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efidp_duplicate_path' mangled-name='efidp_duplicate_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_duplicate_path@@libefivar.so.0'>
      <parameter type-id='type-id-229' name='dp'/>
      <parameter type-id='type-id-230' name='out'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efidp_append_instance' mangled-name='efidp_append_instance' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_instance@@libefivar.so.0'>
      <parameter type-id='type-id-229' name='dp'/>
      <parameter type-id='type-id-229' name='dpi'/>
      <parameter type-id='type-id-230' name='out'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efidp_append_path' mangled-name='efidp_append_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_path@@libefivar.so.0'>
      <parameter type-id='type-id-229' name='dp0'/>
      <parameter type-id='type-id-229' name='dp1'/>
      <parameter type-id='type-id-230' name='out'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efidp_set_node_data' mangled-name='efidp_set_node_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_set_node_data@@libefivar.so.0'>
      <parameter type-id='type-id-229' name='dn'/>
      <parameter type-id='type-id-47' name='buf'/>
      <parameter type-id='type-id-23' name='bufsize'/>
      <return type-id='type-id-1'/>
    </function-decl>
