<abi-corpus version='2.0' path='libefivar.so' architecture='elf-amd-x86_64' soname='libefivar.so.1'>
  <elf-needed>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_efi_set_variable' version='libefivar.so.0' is-default-version='no' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_efi_set_variable_variadic' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_append_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_chmod_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_del_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_error_clear' version='LIBEFIVAR_1.30' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='efi_guid_pkcs7_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_redhat_2' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_rsa2048_sha256_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_security' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha1' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha224' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shell' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_shim' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_ux_capsule' size='16' version='LIBEFIVAR_1.33' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_cert' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha256' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha384' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_x509_sha512' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_guid_zero' size='16' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids' size='19536' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_well_known_guids_end' size='1' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='dp-acpi.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-2'>
      <subrange length='1' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-5'>
      <subrange length='20' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-7'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-8'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-10'/>
    <typedef-decl name='__off_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-12'/>
    <typedef-decl name='__off64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-13'/>
    <typedef-decl name='FILE' type-id='type-id-14' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-15'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-16' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-17'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-21' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-28'/>
    <qualified-type-def type-id='type-id-28' restrict='yes' id='type-id-29'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-25'/>
    <qualified-type-def type-id='type-id-30' restrict='yes' id='type-id-31'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-7'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-8'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' filepath='src/dp-acpi.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-acpi.c' line='268' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-acpi.c' line='268' column='1'/>
      <parameter type-id='type-id-34' name='hid' filepath='src/dp-acpi.c' line='268' column='1'/>
      <parameter type-id='type-id-34' name='uid' filepath='src/dp-acpi.c' line='268' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' filepath='src/dp-acpi.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-acpi.c' line='288' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-acpi.c' line='288' column='1'/>
      <parameter type-id='type-id-34' name='hid' filepath='src/dp-acpi.c' line='289' column='1'/>
      <parameter type-id='type-id-34' name='uid' filepath='src/dp-acpi.c' line='289' column='1'/>
      <parameter type-id='type-id-34' name='cid' filepath='src/dp-acpi.c' line='289' column='1'/>
      <parameter type-id='type-id-30' name='hidstr' filepath='src/dp-acpi.c' line='290' column='1'/>
      <parameter type-id='type-id-30' name='uidstr' filepath='src/dp-acpi.c' line='290' column='1'/>
      <parameter type-id='type-id-30' name='cidstr' filepath='src/dp-acpi.c' line='291' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efi_set_loglevel' mangled-name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile@@LIBEFIVAR_1.36'>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-31'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='391' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-22'/>
  </abi-instr>
  <abi-instr address-size='64' path='dp-hw.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-37'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' filepath='src/dp-hw.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-hw.c' line='73' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-hw.c' line='73' column='1'/>
      <parameter type-id='type-id-39' name='device' filepath='src/dp-hw.c' line='73' column='1'/>
      <parameter type-id='type-id-39' name='function' filepath='src/dp-hw.c' line='73' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' filepath='src/dp-hw.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-hw.c' line='92' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-hw.c' line='92' column='1'/>
      <parameter type-id='type-id-34' name='hardware_device' filepath='src/dp-hw.c' line='92' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' filepath='src/include/efivar/efivar.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='src/include/efivar/efivar.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='554' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-media.c' comp-dir-path='src' language='LANG_C11'>
    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' filepath='src/dp-media.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-media.c' line='142' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-media.c' line='142' column='1'/>
      <parameter type-id='type-id-19' name='filepath' filepath='src/dp-media.c' line='142' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' filepath='src/dp-media.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-media.c' line='170' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-media.c' line='170' column='1'/>
      <parameter type-id='type-id-34' name='num' filepath='src/dp-media.c' line='170' column='1'/>
      <parameter type-id='type-id-40' name='part_start' filepath='src/dp-media.c' line='170' column='1'/>
      <parameter type-id='type-id-40' name='part_size' filepath='src/dp-media.c' line='171' column='1'/>
      <parameter type-id='type-id-32' name='signature' filepath='src/dp-media.c' line='171' column='1'/>
      <parameter type-id='type-id-39' name='format' filepath='src/dp-media.c' line='171' column='1'/>
      <parameter type-id='type-id-39' name='signature_type' filepath='src/dp-media.c' line='172' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' filepath='src/include/efivar/efivar.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='550' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-message.c' comp-dir-path='src' language='LANG_C11'>
    <type-decl name='short int' size-in-bits='16' id='type-id-41'/>
    <typedef-decl name='int16_t' type-id='type-id-42' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-43'/>
    <typedef-decl name='__int16_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-42'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-47'/>
    <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' filepath='src/dp-message.c' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='636' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='636' column='1'/>
      <parameter type-id='type-id-39' name='if_type' filepath='src/dp-message.c' line='636' column='1'/>
      <parameter type-id='type-id-46' name='mac_addr' filepath='src/dp-message.c' line='637' column='1'/>
      <parameter type-id='type-id-33' name='mac_addr_size' filepath='src/dp-message.c' line='637' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='src/dp-message.c' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='657' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='657' column='1'/>
      <parameter type-id='type-id-34' name='local' filepath='src/dp-message.c' line='657' column='1'/>
      <parameter type-id='type-id-34' name='remote' filepath='src/dp-message.c' line='657' column='1'/>
      <parameter type-id='type-id-34' name='gateway' filepath='src/dp-message.c' line='658' column='1'/>
      <parameter type-id='type-id-34' name='netmask' filepath='src/dp-message.c' line='658' column='1'/>
      <parameter type-id='type-id-48' name='local_port' filepath='src/dp-message.c' line='659' column='1'/>
      <parameter type-id='type-id-48' name='remote_port' filepath='src/dp-message.c' line='659' column='1'/>
      <parameter type-id='type-id-48' name='protocol' filepath='src/dp-message.c' line='660' column='1'/>
      <parameter type-id='type-id-18' name='is_static' filepath='src/dp-message.c' line='660' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='src/dp-message.c' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='686' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='686' column='1'/>
      <parameter type-id='type-id-48' name='target' filepath='src/dp-message.c' line='686' column='1'/>
      <parameter type-id='type-id-48' name='lun' filepath='src/dp-message.c' line='686' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='src/dp-message.c' line='704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='704' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='704' column='1'/>
      <parameter type-id='type-id-34' name='namespace_id' filepath='src/dp-message.c' line='704' column='1'/>
      <parameter type-id='type-id-32' name='ieee_eui_64' filepath='src/dp-message.c' line='705' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='src/dp-message.c' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='730' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='730' column='1'/>
      <parameter type-id='type-id-48' name='hba_port' filepath='src/dp-message.c' line='730' column='1'/>
      <parameter type-id='type-id-43' name='port_multiplier_port' filepath='src/dp-message.c' line='731' column='1'/>
      <parameter type-id='type-id-48' name='lun' filepath='src/dp-message.c' line='731' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='src/dp-message.c' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='752' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='752' column='1'/>
      <parameter type-id='type-id-48' name='primary' filepath='src/dp-message.c' line='752' column='1'/>
      <parameter type-id='type-id-48' name='slave' filepath='src/dp-message.c' line='753' column='1'/>
      <parameter type-id='type-id-48' name='lun' filepath='src/dp-message.c' line='753' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='src/dp-message.c' line='775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='775' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='775' column='1'/>
      <parameter type-id='type-id-40' name='sas_address' filepath='src/dp-message.c' line='775' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='src/dp-message.c' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='800' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='800' column='1'/>
      <parameter type-id='type-id-47' name='uuid' filepath='src/dp-message.c' line='800' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_emmc' mangled-name='efidp_make_emmc' filepath='src/dp-message.c' line='819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp-message.c' line='819' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp-message.c' line='819' column='1'/>
      <parameter type-id='type-id-34' name='slot_id' filepath='src/dp-message.c' line='819' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp.c' comp-dir-path='src' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-49'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-50'/>
    </array-type-def>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-51'/>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='infinite' id='type-id-53'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-50'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-18'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-11'/>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='infinite' id='type-id-54'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-50'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='128' id='type-id-55'>
      <subrange length='4' type-id='type-id-3' id='type-id-56'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='infinite' id='type-id-57'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-50'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-40' size-in-bits='128' id='type-id-58'>
      <subrange length='2' type-id='type-id-3' id='type-id-59'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='128' id='type-id-60'>
      <subrange length='16' type-id='type-id-3' id='type-id-61'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='256' id='type-id-62'>
      <subrange length='32' type-id='type-id-3' id='type-id-63'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='32' id='type-id-64'>
      <subrange length='4' type-id='type-id-3' id='type-id-56'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='48' id='type-id-65'>
      <subrange length='6' type-id='type-id-3' id='type-id-66'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='64' id='type-id-67'>
      <subrange length='8' type-id='type-id-3' id='type-id-68'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='infinite' id='type-id-69'>
      <subrange length='infinite' type-id='type-id-3' id='type-id-50'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-70'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-71'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-22'/>
    <type-decl name='variadic parameter type' id='type-id-72'/>
    <type-decl name='void' id='type-id-16'/>
    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='23' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-74' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-73'/>
    <typedef-decl name='efidp_boolean' type-id='type-id-39' filepath='src/include/efivar/efivar-dp.h' line='30' column='1' id='type-id-75'/>
    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='42' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pci' type-id='type-id-77' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-76'/>
    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_pccard' type-id='type-id-79' filepath='src/include/efivar/efivar-dp.h' line='54' column='1' id='type-id-78'/>
    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_mmio' type-id='type-id-81' filepath='src/include/efivar/efivar-dp.h' line='62' column='1' id='type-id-80'/>
    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-83' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-82'/>
    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-84' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_controller' type-id='type-id-85' filepath='src/include/efivar/efivar-dp.h' line='89' column='1' id='type-id-84'/>
    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bmc' type-id='type-id-87' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-86'/>
    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-89' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-88'/>
    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-49' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-91' filepath='src/include/efivar/efivar-dp.h' line='122' column='1' id='type-id-90'/>
    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='156' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-93' filepath='src/include/efivar/efivar-dp.h' line='159' column='1' id='type-id-92'/>
    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='317' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_atapi' type-id='type-id-95' filepath='src/include/efivar/efivar-dp.h' line='322' column='1' id='type-id-94'/>
    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_scsi' type-id='type-id-97' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-96'/>
    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fc' type-id='type-id-99' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-98'/>
    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_fcex' type-id='type-id-101' filepath='src/include/efivar/efivar-dp.h' line='349' column='1' id='type-id-100'/>
    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_1394' type-id='type-id-103' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-102'/>
    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb' type-id='type-id-105' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-104'/>
    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_class' type-id='type-id-107' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-106'/>
    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='393' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-109' filepath='src/include/efivar/efivar-dp.h' line='399' column='1' id='type-id-108'/>
    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_lun' type-id='type-id-111' filepath='src/include/efivar/efivar-dp.h' line='405' column='1' id='type-id-110'/>
    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sata' type-id='type-id-113' filepath='src/include/efivar/efivar-dp.h' line='413' column='1' id='type-id-112'/>
    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_i2o' type-id='type-id-115' filepath='src/include/efivar/efivar-dp.h' line='422' column='1' id='type-id-114'/>
    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='428' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-117' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-116'/>
    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-119' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-118'/>
    <class-decl name='efidp_ipv6_addr' size-in-bits='360' is-struct='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='459' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-121' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-120'/>
    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_vlan' type-id='type-id-123' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-122'/>
    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-126'>
      <data-member access='public'>
        <var-decl name='ioc_guid' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='service_id' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efidp_infiniband' type-id='type-id-125' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-124'/>
    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart' type-id='type-id-128' filepath='src/include/efivar/efivar-dp.h' line='508' column='1' id='type-id-127'/>
    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='532' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='535' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-130' filepath='src/include/efivar/efivar-dp.h' line='536' column='1' id='type-id-129'/>
    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-132' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-131'/>
    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas' type-id='type-id-134' filepath='src/include/efivar/efivar-dp.h' line='565' column='1' id='type-id-133'/>
    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='589' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-136' filepath='src/include/efivar/efivar-dp.h' line='596' column='1' id='type-id-135'/>
    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_iscsi' type-id='type-id-138' filepath='src/include/efivar/efivar-dp.h' line='609' column='1' id='type-id-137'/>
    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='637' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='640' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvme' type-id='type-id-140' filepath='src/include/efivar/efivar-dp.h' line='641' column='1' id='type-id-139'/>
    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_uri' type-id='type-id-142' filepath='src/include/efivar/efivar-dp.h' line='649' column='1' id='type-id-141'/>
    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='655' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ufs' type-id='type-id-144' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-143'/>
    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_sd' type-id='type-id-146' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-145'/>
    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bt' type-id='type-id-148' filepath='src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-147'/>
    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_wifi' type-id='type-id-150' filepath='src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-149'/>
    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-151' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_emmc' type-id='type-id-152' filepath='src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-151'/>
    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_btle' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='689' column='1' id='type-id-153'/>
    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-155' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='695' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='698' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_dns' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='699' column='1' id='type-id-155'/>
    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-158' filepath='src/include/efivar/efivar-dp.h' line='705' column='1' id='type-id-157'/>
    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-159' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='714' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_hd' type-id='type-id-160' filepath='src/include/efivar/efivar-dp.h' line='721' column='1' id='type-id-159'/>
    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-161' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='735' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='739' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_cdrom' type-id='type-id-162' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' id='type-id-161'/>
    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='747' column='1' id='type-id-163'/>
    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='754' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='756' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_file' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='757' column='1' id='type-id-165'/>
    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='763' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_protocol' type-id='type-id-168' filepath='src/include/efivar/efivar-dp.h' line='764' column='1' id='type-id-167'/>
    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-170' filepath='src/include/efivar/efivar-dp.h' line='770' column='1' id='type-id-169'/>
    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-172' filepath='src/include/efivar/efivar-dp.h' line='776' column='1' id='type-id-171'/>
    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='783' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-174' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-173'/>
    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-176' filepath='src/include/efivar/efivar-dp.h' line='793' column='1' id='type-id-175'/>
    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='806' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='810' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' id='type-id-177'/>
    <union-decl name='efidp_data' size-in-bits='384' naming-typedef-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='825' column='1' id='type-id-180'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='header' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pci' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pccard' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mmio' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hw_vendor' type-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='835' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='controller' type-id='type-id-84' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bmc' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid_ex' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_adr' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='atapi' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scsi' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fc' type-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fcex' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firewire' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb' type-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_class' type-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_wwid' type-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='lun' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sata' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i2o' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mac_addr' type-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv4_addr' type-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv6_addr' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='vlan' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='infiniband' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart' type-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='msg_vendor' type-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart_flow_control' type-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas_ex' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='iscsi' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uri' type-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ufs' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sd' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bt' type-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='wifi' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='emmc' type-id='type-id-151' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='btle' type-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dns' type-id='type-id-155' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvdimm' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hd' type-id='type-id-159' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdrom' type-id='type-id-161' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='media_vendor' type-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='protocol' type-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_file' type-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_volume' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='relative_offset' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ramdisk' type-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bios_boot' type-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='826' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='829' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_data' type-id='type-id-180' filepath='src/include/efivar/efivar-dp.h' line='883' column='1' id='type-id-179'/>
    <typedef-decl name='efidp' type-id='type-id-182' filepath='src/include/efivar/efivar-dp.h' line='884' column='1' id='type-id-183'/>
    <typedef-decl name='const_efidp' type-id='type-id-184' filepath='src/include/efivar/efivar-dp.h' line='885' column='1' id='type-id-185'/>
    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar.h' line='20' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_guid_t' type-id='type-id-186' filepath='src/include/efivar/efivar.h' line='26' column='1' id='type-id-36'/>
    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar.h' line='28' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-188' filepath='src/include/efivar/efivar.h' line='30' column='1' id='type-id-187'/>
    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar.h' line='32' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-190' filepath='src/include/efivar/efivar.h' line='34' column='1' id='type-id-189'/>
    <union-decl name='efi_ip_addr_t' size-in-bits='128' naming-typedef-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1' id='type-id-191'>
      <data-member access='public'>
        <var-decl name='addr' type-id='type-id-55' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v4' type-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v6' type-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar.h' line='39' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-191' filepath='src/include/efivar/efivar.h' line='40' column='1' id='type-id-52'/>
    <typedef-decl name='uint8_t' type-id='type-id-192' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-39'/>
    <typedef-decl name='uint16_t' type-id='type-id-193' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-48'/>
    <typedef-decl name='uint32_t' type-id='type-id-194' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-34'/>
    <typedef-decl name='uint64_t' type-id='type-id-195' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-40'/>
    <typedef-decl name='__uint8_t' type-id='type-id-70' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-192'/>
    <typedef-decl name='__uint16_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-193'/>
    <typedef-decl name='__uint32_t' type-id='type-id-71' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-194'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-195'/>
    <typedef-decl name='__ssize_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-196'/>
    <typedef-decl name='DIR' type-id='type-id-51' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-197'/>
    <typedef-decl name='ssize_t' type-id='type-id-196' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-33'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/11/include/stddef.h' line='209' column='1' id='type-id-27'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-19'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-199'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-30'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-26'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-51'/>
    <function-decl name='efidp_set_node_data' mangled-name='efidp_set_node_data' filepath='src/dp.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_set_node_data@@libefivar.so.0'>
      <parameter type-id='type-id-185' name='dn' filepath='src/dp.c' line='33' column='1'/>
      <parameter type-id='type-id-26' name='buf' filepath='src/dp.c' line='33' column='1'/>
      <parameter type-id='type-id-27' name='bufsize' filepath='src/dp.c' line='33' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efidp_duplicate_path' mangled-name='efidp_duplicate_path' filepath='src/dp.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_duplicate_path@@libefivar.so.0'>
      <parameter type-id='type-id-185' name='dp' filepath='src/dp.c' line='87' column='1'/>
      <parameter type-id='type-id-201' name='out' filepath='src/dp.c' line='87' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efidp_append_path' mangled-name='efidp_append_path' filepath='src/dp.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_path@@libefivar.so.0'>
      <parameter type-id='type-id-185' name='dp0' filepath='src/dp.c' line='97' column='1'/>
      <parameter type-id='type-id-185' name='dp1' filepath='src/dp.c' line='97' column='1'/>
      <parameter type-id='type-id-201' name='out' filepath='src/dp.c' line='97' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efidp_append_node' mangled-name='efidp_append_node' filepath='src/dp.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_node@@libefivar.so.0'>
      <parameter type-id='type-id-185' name='dp' filepath='src/dp.c' line='179' column='1'/>
      <parameter type-id='type-id-185' name='dn' filepath='src/dp.c' line='179' column='1'/>
      <parameter type-id='type-id-201' name='out' filepath='src/dp.c' line='179' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efidp_append_instance' mangled-name='efidp_append_instance' filepath='src/dp.c' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_instance@@libefivar.so.0'>
      <parameter type-id='type-id-185' name='dp' filepath='src/dp.c' line='241' column='1'/>
      <parameter type-id='type-id-185' name='dpi' filepath='src/dp.c' line='241' column='1'/>
      <parameter type-id='type-id-201' name='out' filepath='src/dp.c' line='241' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efidp_format_device_path' mangled-name='efidp_format_device_path' filepath='src/dp.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-203' name='buf' filepath='src/dp.c' line='288' column='1'/>
      <parameter type-id='type-id-27' name='size' filepath='src/dp.c' line='288' column='1'/>
      <parameter type-id='type-id-185' name='dp' filepath='src/dp.c' line='288' column='1'/>
      <parameter type-id='type-id-33' name='limit' filepath='src/dp.c' line='289' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' filepath='src/dp.c' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0'>
      <parameter type-id='type-id-203' name='path' filepath='src/dp.c' line='393' column='1'/>
      <parameter type-id='type-id-183' name='out' filepath='src/dp.c' line='394' column='1'/>
      <parameter type-id='type-id-27' name='size' filepath='src/dp.c' line='394' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' filepath='src/dp.c' line='402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-203' name='path' filepath='src/dp.c' line='402' column='1'/>
      <parameter type-id='type-id-183' name='out' filepath='src/dp.c' line='402' column='1'/>
      <parameter type-id='type-id-27' name='size' filepath='src/dp.c' line='403' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' filepath='src/dp.c' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-39' name='type' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-39' name='subtype' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-36' name='vendor_guid' filepath='src/dp.c' line='412' column='1'/>
      <parameter type-id='type-id-26' name='data' filepath='src/dp.c' line='412' column='1'/>
      <parameter type-id='type-id-27' name='data_size' filepath='src/dp.c' line='412' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' filepath='src/dp.c' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='buf' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-33' name='size' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-39' name='type' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-39' name='subtype' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-33' name='total_size' filepath='src/dp.c' line='428' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='_format_hw_dn' filepath='src/dp.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-185'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='_format_acpi_dn' filepath='src/dp.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-185'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='_format_message_dn' filepath='src/dp.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-185'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='_format_media_dn' filepath='src/dp.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-185'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efi_error_set' mangled-name='efi_error_set' filepath='src/include/efivar/efivar.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-30'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-30'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='efivarfs.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-204' size-in-bits='256' id='type-id-205'>
      <subrange length='4' type-id='type-id-3' id='type-id-56'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-206' size-in-bits='192' id='type-id-207'>
      <subrange length='3' type-id='type-id-3' id='type-id-208'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2040' id='type-id-209'>
      <subrange length='255' type-id='type-id-3' id='type-id-210'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2048' id='type-id-211'>
      <subrange length='256' type-id='type-id-3' id='type-id-212'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='64' id='type-id-213'>
      <subrange length='2' type-id='type-id-3' id='type-id-59'/>
    </array-type-def>
    <class-decl name='efi_var_operations' size-in-bits='2624' is-struct='yes' visibility='default' filepath='src/lib.h' line='15' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-209' visibility='default' filepath='src/lib.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='probe' type-id='type-id-215' visibility='default' filepath='src/lib.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='set_variable' type-id='type-id-216' visibility='default' filepath='src/lib.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='del_variable' type-id='type-id-217' visibility='default' filepath='src/lib.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='get_variable' type-id='type-id-218' visibility='default' filepath='src/lib.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='get_variable_attributes' type-id='type-id-219' visibility='default' filepath='src/lib.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='get_variable_size' type-id='type-id-220' visibility='default' filepath='src/lib.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='get_next_variable_name' type-id='type-id-221' visibility='default' filepath='src/lib.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='append_variable' type-id='type-id-222' visibility='default' filepath='src/lib.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='chmod_variable' type-id='type-id-223' visibility='default' filepath='src/lib.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-225' visibility='default' filepath='/usr/include/bits/dirent.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/dirent.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-211' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='statfs' size-in-bits='960' is-struct='yes' visibility='default' filepath='/usr/include/bits/statfs.h' line='24' column='1' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_type' type-id='type-id-204' visibility='default' filepath='/usr/include/bits/statfs.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_bsize' type-id='type-id-204' visibility='default' filepath='/usr/include/bits/statfs.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-227' visibility='default' filepath='/usr/include/bits/statfs.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-227' visibility='default' filepath='/usr/include/bits/statfs.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-227' visibility='default' filepath='/usr/include/bits/statfs.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-228' visibility='default' filepath='/usr/include/bits/statfs.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-228' visibility='default' filepath='/usr/include/bits/statfs.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_fsid' type-id='type-id-229' visibility='default' filepath='/usr/include/bits/statfs.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_namelen' type-id='type-id-204' visibility='default' filepath='/usr/include/bits/statfs.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_frsize' type-id='type-id-204' visibility='default' filepath='/usr/include/bits/statfs.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_flags' type-id='type-id-204' visibility='default' filepath='/usr/include/bits/statfs.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_spare' type-id='type-id-205' visibility='default' filepath='/usr/include/bits/statfs.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-231' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-225' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-232' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-233' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-234' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-235' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-231' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-236' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-237' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-238' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-238' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-238' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-207' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-231'/>
    <typedef-decl name='__uid_t' type-id='type-id-71' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-234'/>
    <typedef-decl name='__gid_t' type-id='type-id-71' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-235'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-225'/>
    <typedef-decl name='__mode_t' type-id='type-id-71' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-233'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-232'/>
    <class-decl name='__fsid_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-229' visibility='default' filepath='/usr/include/bits/types.h' line='155' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-213' visibility='default' filepath='/usr/include/bits/types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fsid_t' type-id='type-id-239' filepath='/usr/include/bits/types.h' line='155' column='1' id='type-id-229'/>
    <typedef-decl name='__time_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-240'/>
    <typedef-decl name='__useconds_t' type-id='type-id-71' filepath='/usr/include/bits/types.h' line='161' column='1' id='type-id-241'/>
    <typedef-decl name='__blksize_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-236'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='180' column='1' id='type-id-237'/>
    <typedef-decl name='__fsblkcnt_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='184' column='1' id='type-id-227'/>
    <typedef-decl name='__fsfilcnt_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='188' column='1' id='type-id-228'/>
    <typedef-decl name='__fsword_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='192' column='1' id='type-id-204'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-206'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-240' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-206' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mode_t' type-id='type-id-233' filepath='/usr/include/fcntl.h' line='50' column='1' id='type-id-242'/>
    <qualified-type-def type-id='type-id-35' restrict='yes' id='type-id-243'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-244'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-245'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-219'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-256'/>
    <qualified-type-def type-id='type-id-256' restrict='yes' id='type-id-257'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-260'/>
    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' filepath='src/include/efivar/efivar.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-259'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_error_clear' mangled-name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear@@LIBEFIVAR_1.30'>
      <return type-id='type-id-16'/>
    </function-decl>
    <var-decl name='efivarfs_ops' type-id='type-id-214' visibility='default' filepath='src/lib.h' line='37' column='1'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-198'/>
    </function-decl>
    <function-decl name='readdir' filepath='/usr/include/dirent.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='dirfd' filepath='/usr/include/dirent.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='err' filepath='/usr/include/err.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-30'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='open' filepath='/usr/include/fcntl.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-31'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='secure_getenv' filepath='/usr/include/stdlib.h' line='644' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='stat' filepath='/usr/include/sys/stat.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fstat' filepath='/usr/include/sys/stat.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='chmod' filepath='/usr/include/sys/stat.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='statfs' filepath='/usr/include/sys/statfs.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='usleep' filepath='/usr/include/unistd.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-234'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='855' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-246'>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-247'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-248'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-249'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-250'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-259'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-259'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-253'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-254'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-18'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='error.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-26' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cookie_read_function_t' type-id='type-id-262' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='27' column='1' id='type-id-263'/>
    <typedef-decl name='cookie_write_function_t' type-id='type-id-264' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='36' column='1' id='type-id-265'/>
    <typedef-decl name='cookie_seek_function_t' type-id='type-id-266' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='45' column='1' id='type-id-267'/>
    <typedef-decl name='cookie_close_function_t' type-id='type-id-268' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='48' column='1' id='type-id-269'/>
    <class-decl name='_IO_cookie_io_functions_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='55' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read' type-id='type-id-271' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write' type-id='type-id-272' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seek' type-id='type-id-273' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='close' type-id='type-id-274' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cookie_io_functions_t' type-id='type-id-270' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='61' column='1' id='type-id-275'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-277'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-278'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-279'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-272'/>
    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-280'/>
    <function-decl name='efi_error_get' mangled-name='efi_error_get' filepath='src/error.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_get@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-71' name='n' filepath='src/error.c' line='34' column='1'/>
      <parameter type-id='type-id-279' name='filename' filepath='src/error.c' line='35' column='1'/>
      <parameter type-id='type-id-279' name='function' filepath='src/error.c' line='36' column='1'/>
      <parameter type-id='type-id-202' name='line' filepath='src/error.c' line='37' column='1'/>
      <parameter type-id='type-id-279' name='message' filepath='src/error.c' line='38' column='1'/>
      <parameter type-id='type-id-202' name='error' filepath='src/error.c' line='39' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='efi_error_pop' mangled-name='efi_error_pop' filepath='src/error.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_pop@@LIBEFIVAR_1.38'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='efi_set_verbose' mangled-name='efi_set_verbose' filepath='src/error.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_verbose@@LIBEFIVAR_1.36'>
      <parameter type-id='type-id-18' name='verbosity' filepath='src/error.c' line='291' column='1'/>
      <parameter type-id='type-id-28' name='errlog' filepath='src/error.c' line='291' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='efi_get_verbose' mangled-name='efi_get_verbose' filepath='src/error.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_verbose@@LIBEFIVAR_1.36'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='memfd_create' filepath='/usr/include/bits/mman-shared.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fopencookie' filepath='/usr/include/stdio.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='/usr/include/stdio.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fwrite' filepath='/usr/include/stdio.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='707' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='782' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='784' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='getrandom' filepath='/usr/include/sys/random.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='lseek' filepath='/usr/include/unistd.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-268'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-266'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-276'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-262'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-196'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-196'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='export.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='efi_variable' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/export.c' line='21' column='1' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrs' type-id='type-id-40' visibility='default' filepath='src/export.c' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-47' visibility='default' filepath='src/export.c' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-203' visibility='default' filepath='src/export.c' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-32' visibility='default' filepath='src/export.c' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-27' visibility='default' filepath='src/export.c' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_variable_t' type-id='type-id-281' filepath='src/include/efivar/efivar.h' line='120' column='1' id='type-id-282'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-285'/>
    <function-decl name='crc32' filepath='src/crc32.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='efi_variable_import' mangled-name='efi_variable_import' filepath='src/export.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_import@@libefivar.so.0'>
      <parameter type-id='type-id-32' name='data' filepath='src/export.c' line='327' column='1'/>
      <parameter type-id='type-id-27' name='size' filepath='src/export.c' line='327' column='1'/>
      <parameter type-id='type-id-284' name='var_out' filepath='src/export.c' line='327' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efi_variable_export_dmpstore' mangled-name='efi_variable_export_dmpstore' filepath='src/export.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export_dmpstore@@LIBEFIVAR_1.38'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='340' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='src/export.c' line='340' column='1'/>
      <parameter type-id='type-id-27' name='datasz' filepath='src/export.c' line='340' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efi_variable_export' mangled-name='efi_variable_export' filepath='src/export.c' line='470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export@@libefivar.so.0'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='470' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='src/export.c' line='470' column='1'/>
      <parameter type-id='type-id-27' name='datasz' filepath='src/export.c' line='470' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='efi_variable_alloc' mangled-name='efi_variable_alloc' filepath='src/export.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_alloc@@LIBEFIVAR_1.38'>
      <return type-id='type-id-283'/>
    </function-decl>
    <function-decl name='efi_variable_free' mangled-name='efi_variable_free' filepath='src/export.c' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_free@@libefivar.so.0'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='619' column='1'/>
      <parameter type-id='type-id-18' name='free_data' filepath='src/export.c' line='619' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='efi_variable_set_name' mangled-name='efi_variable_set_name' filepath='src/export.c' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_name@@libefivar.so.0'>
      <parameter type-id='type-id-283' name='var' filepath='src/export.c' line='640' column='1'/>
      <parameter type-id='type-id-203' name='name' filepath='src/export.c' line='640' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
